TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 16:40:49 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/api_mac.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

   11119                            .dwattr $C$DW$832, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11120                            .dwattr $C$DW$832, DW_AT_decl_line(0x5e)
   11121                            .dwattr $C$DW$832, DW_AT_decl_column(0x03)
   11122                    
   11123                    $C$DW$833       .dwtag  DW_TAG_enumerator
   11124                            .dwattr $C$DW$833, DW_AT_name("MAC_FH_GET_REQ")
   11125                            .dwattr $C$DW$833, DW_AT_const_value(0xf5)
   11126                            .dwattr $C$DW$833, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11127                            .dwattr $C$DW$833, DW_AT_decl_line(0x5f)
   11128                            .dwattr $C$DW$833, DW_AT_decl_column(0x03)
   11129                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  204

   11130                    $C$DW$834       .dwtag  DW_TAG_enumerator
   11131                            .dwattr $C$DW$834, DW_AT_name("MAC_MLME_WS_ASYNC_REQ")
   11132                            .dwattr $C$DW$834, DW_AT_const_value(0xf6)
   11133                            .dwattr $C$DW$834, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11134                            .dwattr $C$DW$834, DW_AT_decl_line(0x60)
   11135                            .dwattr $C$DW$834, DW_AT_decl_column(0x03)
   11136                    
   11137                    $C$DW$835       .dwtag  DW_TAG_enumerator
   11138                            .dwattr $C$DW$835, DW_AT_name("MAC_SEC_ADD_DEVICE")
   11139                            .dwattr $C$DW$835, DW_AT_const_value(0xf7)
   11140                            .dwattr $C$DW$835, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11141                            .dwattr $C$DW$835, DW_AT_decl_line(0x61)
   11142                            .dwattr $C$DW$835, DW_AT_decl_column(0x03)
   11143                    
   11144                    $C$DW$836       .dwtag  DW_TAG_enumerator
   11145                            .dwattr $C$DW$836, DW_AT_name("MAC_SEC_DEL_DEVICE")
   11146                            .dwattr $C$DW$836, DW_AT_const_value(0xf8)
   11147                            .dwattr $C$DW$836, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11148                            .dwattr $C$DW$836, DW_AT_decl_line(0x62)
   11149                            .dwattr $C$DW$836, DW_AT_decl_column(0x03)
   11150                    
   11151                    $C$DW$837       .dwtag  DW_TAG_enumerator
   11152                            .dwattr $C$DW$837, DW_AT_name("MAC_SEC_DEL_KEY_AND_DEVICES")
   11153                            .dwattr $C$DW$837, DW_AT_const_value(0xf9)
   11154                            .dwattr $C$DW$837, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11155                            .dwattr $C$DW$837, DW_AT_decl_line(0x63)
   11156                            .dwattr $C$DW$837, DW_AT_decl_column(0x03)
   11157                    
   11158                    $C$DW$838       .dwtag  DW_TAG_enumerator
   11159                            .dwattr $C$DW$838, DW_AT_name("MAC_SEC_DEL_ALL_DEVICES")
   11160                            .dwattr $C$DW$838, DW_AT_const_value(0xfa)
   11161                            .dwattr $C$DW$838, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11162                            .dwattr $C$DW$838, DW_AT_decl_line(0x64)
   11163                            .dwattr $C$DW$838, DW_AT_decl_column(0x03)
   11164                    
   11165                    $C$DW$839       .dwtag  DW_TAG_enumerator
   11166                            .dwattr $C$DW$839, DW_AT_name("MAC_SEC_GET_DEFAULT_SOURCE_KEY")
   11167                            .dwattr $C$DW$839, DW_AT_const_value(0xfb)
   11168                            .dwattr $C$DW$839, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11169                            .dwattr $C$DW$839, DW_AT_decl_line(0x65)
   11170                            .dwattr $C$DW$839, DW_AT_decl_column(0x03)
   11171                    
   11172                    $C$DW$840       .dwtag  DW_TAG_enumerator
   11173                            .dwattr $C$DW$840, DW_AT_name("MAC_SEC_ADD_KEY_INIT_FC")
   11174                            .dwattr $C$DW$840, DW_AT_const_value(0xfc)
   11175                            .dwattr $C$DW$840, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11176                            .dwattr $C$DW$840, DW_AT_decl_line(0x66)
   11177                            .dwattr $C$DW$840, DW_AT_decl_column(0x03)
   11178                    
   11179                            .dwattr $C$DW$T$725, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11180                            .dwattr $C$DW$T$725, DW_AT_decl_line(0x39)
   11181                            .dwattr $C$DW$T$725, DW_AT_decl_column(0x01)
   11182                            .dwendtag $C$DW$T$725
   11183                    
   11184                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  205

   11185                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
   11186                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
   11187                    $C$DW$841       .dwtag  DW_TAG_member
   11188                            .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$186)
   11189                            .dwattr $C$DW$841, DW_AT_name("addr")
   11190                            .dwattr $C$DW$841, DW_AT_TI_symbol_name("addr")
   11191                            .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11192                            .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
   11193                            .dwattr $C$DW$841, DW_AT_decl_file("..\Application\api_mac.h")
   11194                            .dwattr $C$DW$841, DW_AT_decl_line(0x4db)
   11195                            .dwattr $C$DW$841, DW_AT_decl_column(0x07)
   11196                    
   11197                    $C$DW$842       .dwtag  DW_TAG_member
   11198                            .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$20)
   11199                            .dwattr $C$DW$842, DW_AT_name("addrMode")
   11200                            .dwattr $C$DW$842, DW_AT_TI_symbol_name("addrMode")
   11201                            .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11202                            .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
   11203                            .dwattr $C$DW$842, DW_AT_decl_file("..\Application\api_mac.h")
   11204                            .dwattr $C$DW$842, DW_AT_decl_line(0x4de)
   11205                            .dwattr $C$DW$842, DW_AT_decl_column(0x17)
   11206                    
   11207                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\api_mac.h")
   11208                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x4d0)
   11209                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
   11210                            .dwendtag $C$DW$T$21
   11211                    
   11212                    $C$DW$T$385     .dwtag  DW_TAG_typedef
   11213                            .dwattr $C$DW$T$385, DW_AT_name("ApiMac_sAddr_t")
   11214                            .dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$21)
   11215                            .dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
   11216                            .dwattr $C$DW$T$385, DW_AT_decl_file("..\Application\api_mac.h")
   11217                            .dwattr $C$DW$T$385, DW_AT_decl_line(0x4df)
   11218                            .dwattr $C$DW$T$385, DW_AT_decl_column(0x03)
   11219                    
   11220                    $C$DW$T$726     .dwtag  DW_TAG_pointer_type
   11221                            .dwattr $C$DW$T$726, DW_AT_type(*$C$DW$T$385)
   11222                            .dwattr $C$DW$T$726, DW_AT_address_class(0x20)
   11223                    
   11224                    $C$DW$T$727     .dwtag  DW_TAG_const_type
   11225                            .dwattr $C$DW$T$727, DW_AT_type(*$C$DW$T$726)
   11226                    
   11227                    
   11228                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
   11229                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x40)
   11230                    $C$DW$843       .dwtag  DW_TAG_member
   11231                            .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$23)
   11232                            .dwattr $C$DW$843, DW_AT_name("beaconType")
   11233                            .dwattr $C$DW$843, DW_AT_TI_symbol_name("beaconType")
   11234                            .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11235                            .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
   11236                            .dwattr $C$DW$843, DW_AT_decl_file("..\Application\api_mac.h")
   11237                            .dwattr $C$DW$843, DW_AT_decl_line(0x886)
   11238                            .dwattr $C$DW$843, DW_AT_decl_column(0x19)
   11239                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  206

   11240                    $C$DW$844       .dwtag  DW_TAG_member
   11241                            .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$24)
   11242                            .dwattr $C$DW$844, DW_AT_name("bsn")
   11243                            .dwattr $C$DW$844, DW_AT_TI_symbol_name("bsn")
   11244                            .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11245                            .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
   11246                            .dwattr $C$DW$844, DW_AT_decl_file("..\Application\api_mac.h")
   11247                            .dwattr $C$DW$844, DW_AT_decl_line(0x888)
   11248                            .dwattr $C$DW$844, DW_AT_decl_column(0x0d)
   11249                    
   11250                    $C$DW$845       .dwtag  DW_TAG_member
   11251                            .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$25)
   11252                            .dwattr $C$DW$845, DW_AT_name("panDesc")
   11253                            .dwattr $C$DW$845, DW_AT_TI_symbol_name("panDesc")
   11254                            .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11255                            .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
   11256                            .dwattr $C$DW$845, DW_AT_decl_file("..\Application\api_mac.h")
   11257                            .dwattr $C$DW$845, DW_AT_decl_line(0x88a)
   11258                            .dwattr $C$DW$845, DW_AT_decl_column(0x16)
   11259                    
   11260                    $C$DW$846       .dwtag  DW_TAG_member
   11261                            .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$189)
   11262                            .dwattr $C$DW$846, DW_AT_name("beaconData")
   11263                            .dwattr $C$DW$846, DW_AT_TI_symbol_name("beaconData")
   11264                            .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11265                            .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
   11266                            .dwattr $C$DW$846, DW_AT_decl_file("..\Application\api_mac.h")
   11267                            .dwattr $C$DW$846, DW_AT_decl_line(0x895)
   11268                            .dwattr $C$DW$846, DW_AT_decl_column(0x07)
   11269                    
   11270                            .dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\api_mac.h")
   11271                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x884)
   11272                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
   11273                            .dwendtag $C$DW$T$26
   11274                    
   11275                    $C$DW$T$299     .dwtag  DW_TAG_typedef
   11276                            .dwattr $C$DW$T$299, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
   11277                            .dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$26)
   11278                            .dwattr $C$DW$T$299, DW_AT_language(DW_LANG_C)
   11279                            .dwattr $C$DW$T$299, DW_AT_decl_file("..\Application\api_mac.h")
   11280                            .dwattr $C$DW$T$299, DW_AT_decl_line(0x896)
   11281                            .dwattr $C$DW$T$299, DW_AT_decl_column(0x03)
   11282                    
   11283                    $C$DW$T$300     .dwtag  DW_TAG_pointer_type
   11284                            .dwattr $C$DW$T$300, DW_AT_type(*$C$DW$T$299)
   11285                            .dwattr $C$DW$T$300, DW_AT_address_class(0x20)
   11286                    
   11287                    
   11288                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
   11289                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
   11290                    $C$DW$847       .dwtag  DW_TAG_member
   11291                            .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$27)
   11292                            .dwattr $C$DW$847, DW_AT_name("event")
   11293                            .dwattr $C$DW$847, DW_AT_TI_symbol_name("event")
   11294                            .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  207

   11295                            .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
   11296                            .dwattr $C$DW$847, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11297                            .dwattr $C$DW$847, DW_AT_decl_line(0x2b6)
   11298                            .dwattr $C$DW$847, DW_AT_decl_column(0x0b)
   11299                    
   11300                    $C$DW$848       .dwtag  DW_TAG_member
   11301                            .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$27)
   11302                            .dwattr $C$DW$848, DW_AT_name("status")
   11303                            .dwattr $C$DW$848, DW_AT_TI_symbol_name("status")
   11304                            .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11305                            .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
   11306                            .dwattr $C$DW$848, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11307                            .dwattr $C$DW$848, DW_AT_decl_line(0x2b7)
   11308                            .dwattr $C$DW$848, DW_AT_decl_column(0x0b)
   11309                    
   11310                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11311                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x2b5)
   11312                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
   11313                            .dwendtag $C$DW$T$28
   11314                    
   11315                    $C$DW$T$29      .dwtag  DW_TAG_typedef
   11316                            .dwattr $C$DW$T$29, DW_AT_name("macEventHdr_t")
   11317                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
   11318                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
   11319                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11320                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2b8)
   11321                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
   11322                    
   11323                    $C$DW$T$732     .dwtag  DW_TAG_pointer_type
   11324                            .dwattr $C$DW$T$732, DW_AT_type(*$C$DW$T$29)
   11325                            .dwattr $C$DW$T$732, DW_AT_address_class(0x20)
   11326                    
   11327                    
   11328                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
   11329                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x16)
   11330                    $C$DW$849       .dwtag  DW_TAG_member
   11331                            .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$29)
   11332                            .dwattr $C$DW$849, DW_AT_name("hdr")
   11333                            .dwattr $C$DW$849, DW_AT_TI_symbol_name("hdr")
   11334                            .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11335                            .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
   11336                            .dwattr $C$DW$849, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11337                            .dwattr $C$DW$849, DW_AT_decl_line(0x480)
   11338                            .dwattr $C$DW$849, DW_AT_decl_column(0x17)
   11339                    
   11340                    $C$DW$850       .dwtag  DW_TAG_member
   11341                            .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$31)
   11342                            .dwattr $C$DW$850, DW_AT_name("deviceAddress")
   11343                            .dwattr $C$DW$850, DW_AT_TI_symbol_name("deviceAddress")
   11344                            .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11345                            .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
   11346                            .dwattr $C$DW$850, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11347                            .dwattr $C$DW$850, DW_AT_decl_line(0x481)
   11348                            .dwattr $C$DW$850, DW_AT_decl_column(0x17)
   11349                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  208

   11350                    $C$DW$851       .dwtag  DW_TAG_member
   11351                            .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$27)
   11352                            .dwattr $C$DW$851, DW_AT_name("capabilityInformation")
   11353                            .dwattr $C$DW$851, DW_AT_TI_symbol_name("capabilityInformation")
   11354                            .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11355                            .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
   11356                            .dwattr $C$DW$851, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11357                            .dwattr $C$DW$851, DW_AT_decl_line(0x482)
   11358                            .dwattr $C$DW$851, DW_AT_decl_column(0x17)
   11359                    
   11360                    $C$DW$852       .dwtag  DW_TAG_member
   11361                            .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$32)
   11362                            .dwattr $C$DW$852, DW_AT_name("sec")
   11363                            .dwattr $C$DW$852, DW_AT_TI_symbol_name("sec")
   11364                            .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11365                            .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
   11366                            .dwattr $C$DW$852, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11367                            .dwattr $C$DW$852, DW_AT_decl_line(0x483)
   11368                            .dwattr $C$DW$852, DW_AT_decl_column(0x17)
   11369                    
   11370                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11371                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x47f)
   11372                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
   11373                            .dwendtag $C$DW$T$33
   11374                    
   11375                    $C$DW$T$201     .dwtag  DW_TAG_typedef
   11376                            .dwattr $C$DW$T$201, DW_AT_name("macMlmeAssociateInd_t")
   11377                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$33)
   11378                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
   11379                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11380                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x484)
   11381                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
   11382                    
   11383                    
   11384                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
   11385                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
   11386                    $C$DW$853       .dwtag  DW_TAG_member
   11387                            .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$29)
   11388                            .dwattr $C$DW$853, DW_AT_name("hdr")
   11389                            .dwattr $C$DW$853, DW_AT_TI_symbol_name("hdr")
   11390                            .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11391                            .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
   11392                            .dwattr $C$DW$853, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11393                            .dwattr $C$DW$853, DW_AT_decl_line(0x489)
   11394                            .dwattr $C$DW$853, DW_AT_decl_column(0x17)
   11395                    
   11396                    $C$DW$854       .dwtag  DW_TAG_member
   11397                            .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$34)
   11398                            .dwattr $C$DW$854, DW_AT_name("assocShortAddress")
   11399                            .dwattr $C$DW$854, DW_AT_TI_symbol_name("assocShortAddress")
   11400                            .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11401                            .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
   11402                            .dwattr $C$DW$854, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11403                            .dwattr $C$DW$854, DW_AT_decl_line(0x48a)
   11404                            .dwattr $C$DW$854, DW_AT_decl_column(0x17)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  209

   11405                    
   11406                    $C$DW$855       .dwtag  DW_TAG_member
   11407                            .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$32)
   11408                            .dwattr $C$DW$855, DW_AT_name("sec")
   11409                            .dwattr $C$DW$855, DW_AT_TI_symbol_name("sec")
   11410                            .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11411                            .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
   11412                            .dwattr $C$DW$855, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11413                            .dwattr $C$DW$855, DW_AT_decl_line(0x48b)
   11414                            .dwattr $C$DW$855, DW_AT_decl_column(0x17)
   11415                    
   11416                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11417                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x488)
   11418                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
   11419                            .dwendtag $C$DW$T$35
   11420                    
   11421                    $C$DW$T$202     .dwtag  DW_TAG_typedef
   11422                            .dwattr $C$DW$T$202, DW_AT_name("macMlmeAssociateCnf_t")
   11423                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$35)
   11424                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
   11425                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11426                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x48c)
   11427                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
   11428                    
   11429                    
   11430                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
   11431                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
   11432                    $C$DW$856       .dwtag  DW_TAG_member
   11433                            .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$29)
   11434                            .dwattr $C$DW$856, DW_AT_name("hdr")
   11435                            .dwattr $C$DW$856, DW_AT_TI_symbol_name("hdr")
   11436                            .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11437                            .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
   11438                            .dwattr $C$DW$856, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11439                            .dwattr $C$DW$856, DW_AT_decl_line(0x491)
   11440                            .dwattr $C$DW$856, DW_AT_decl_column(0x17)
   11441                    
   11442                    $C$DW$857       .dwtag  DW_TAG_member
   11443                            .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$31)
   11444                            .dwattr $C$DW$857, DW_AT_name("deviceAddress")
   11445                            .dwattr $C$DW$857, DW_AT_TI_symbol_name("deviceAddress")
   11446                            .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11447                            .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
   11448                            .dwattr $C$DW$857, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11449                            .dwattr $C$DW$857, DW_AT_decl_line(0x492)
   11450                            .dwattr $C$DW$857, DW_AT_decl_column(0x17)
   11451                    
   11452                    $C$DW$858       .dwtag  DW_TAG_member
   11453                            .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$27)
   11454                            .dwattr $C$DW$858, DW_AT_name("disassociateReason")
   11455                            .dwattr $C$DW$858, DW_AT_TI_symbol_name("disassociateReason")
   11456                            .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11457                            .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
   11458                            .dwattr $C$DW$858, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11459                            .dwattr $C$DW$858, DW_AT_decl_line(0x493)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  210

   11460                            .dwattr $C$DW$858, DW_AT_decl_column(0x17)
   11461                    
   11462                    $C$DW$859       .dwtag  DW_TAG_member
   11463                            .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$32)
   11464                            .dwattr $C$DW$859, DW_AT_name("sec")
   11465                            .dwattr $C$DW$859, DW_AT_TI_symbol_name("sec")
   11466                            .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11467                            .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
   11468                            .dwattr $C$DW$859, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11469                            .dwattr $C$DW$859, DW_AT_decl_line(0x494)
   11470                            .dwattr $C$DW$859, DW_AT_decl_column(0x17)
   11471                    
   11472                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11473                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x490)
   11474                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
   11475                            .dwendtag $C$DW$T$36
   11476                    
   11477                    $C$DW$T$203     .dwtag  DW_TAG_typedef
   11478                            .dwattr $C$DW$T$203, DW_AT_name("macMlmeDisassociateInd_t")
   11479                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$36)
   11480                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
   11481                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11482                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x495)
   11483                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x03)
   11484                    
   11485                    
   11486                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
   11487                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
   11488                    $C$DW$860       .dwtag  DW_TAG_member
   11489                            .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$193)
   11490                            .dwattr $C$DW$860, DW_AT_name("addr")
   11491                            .dwattr $C$DW$860, DW_AT_TI_symbol_name("addr")
   11492                            .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11493                            .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
   11494                            .dwattr $C$DW$860, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Serv
   11495                            .dwattr $C$DW$860, DW_AT_decl_line(0x55)
   11496                            .dwattr $C$DW$860, DW_AT_decl_column(0x05)
   11497                    
   11498                    $C$DW$861       .dwtag  DW_TAG_member
   11499                            .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$24)
   11500                            .dwattr $C$DW$861, DW_AT_name("addrMode")
   11501                            .dwattr $C$DW$861, DW_AT_TI_symbol_name("addrMode")
   11502                            .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11503                            .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
   11504                            .dwattr $C$DW$861, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Serv
   11505                            .dwattr $C$DW$861, DW_AT_decl_line(0x56)
   11506                            .dwattr $C$DW$861, DW_AT_decl_column(0x13)
   11507                    
   11508                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Ser
   11509                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x50)
   11510                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
   11511                            .dwendtag $C$DW$T$37
   11512                    
   11513                    $C$DW$T$38      .dwtag  DW_TAG_typedef
   11514                            .dwattr $C$DW$T$38, DW_AT_name("sAddr_t")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  211

   11515                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
   11516                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
   11517                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Ser
   11518                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x57)
   11519                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
   11520                    
   11521                    $C$DW$T$143     .dwtag  DW_TAG_pointer_type
   11522                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$38)
   11523                            .dwattr $C$DW$T$143, DW_AT_address_class(0x20)
   11524                    
   11525                    $C$DW$T$735     .dwtag  DW_TAG_const_type
   11526                            .dwattr $C$DW$T$735, DW_AT_type(*$C$DW$T$143)
   11527                    
   11528                    
   11529                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
   11530                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
   11531                    $C$DW$862       .dwtag  DW_TAG_member
   11532                            .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$29)
   11533                            .dwattr $C$DW$862, DW_AT_name("hdr")
   11534                            .dwattr $C$DW$862, DW_AT_TI_symbol_name("hdr")
   11535                            .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11536                            .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
   11537                            .dwattr $C$DW$862, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11538                            .dwattr $C$DW$862, DW_AT_decl_line(0x49a)
   11539                            .dwattr $C$DW$862, DW_AT_decl_column(0x13)
   11540                    
   11541                    $C$DW$863       .dwtag  DW_TAG_member
   11542                            .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$38)
   11543                            .dwattr $C$DW$863, DW_AT_name("deviceAddress")
   11544                            .dwattr $C$DW$863, DW_AT_TI_symbol_name("deviceAddress")
   11545                            .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11546                            .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
   11547                            .dwattr $C$DW$863, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11548                            .dwattr $C$DW$863, DW_AT_decl_line(0x49b)
   11549                            .dwattr $C$DW$863, DW_AT_decl_column(0x13)
   11550                    
   11551                    $C$DW$864       .dwtag  DW_TAG_member
   11552                            .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$34)
   11553                            .dwattr $C$DW$864, DW_AT_name("panId")
   11554                            .dwattr $C$DW$864, DW_AT_TI_symbol_name("panId")
   11555                            .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11556                            .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
   11557                            .dwattr $C$DW$864, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11558                            .dwattr $C$DW$864, DW_AT_decl_line(0x49d)
   11559                            .dwattr $C$DW$864, DW_AT_decl_column(0x13)
   11560                    
   11561                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11562                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x499)
   11563                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
   11564                            .dwendtag $C$DW$T$39
   11565                    
   11566                    $C$DW$T$204     .dwtag  DW_TAG_typedef
   11567                            .dwattr $C$DW$T$204, DW_AT_name("macMlmeDisassociateCnf_t")
   11568                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$39)
   11569                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  212

   11570                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11571                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x49f)
   11572                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x03)
   11573                    
   11574                    
   11575                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
   11576                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x24)
   11577                    $C$DW$865       .dwtag  DW_TAG_member
   11578                            .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$38)
   11579                            .dwattr $C$DW$865, DW_AT_name("coordAddress")
   11580                            .dwattr $C$DW$865, DW_AT_TI_symbol_name("coordAddress")
   11581                            .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11582                            .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
   11583                            .dwattr $C$DW$865, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11584                            .dwattr $C$DW$865, DW_AT_decl_line(0x3e1)
   11585                            .dwattr $C$DW$865, DW_AT_decl_column(0x11)
   11586                    
   11587                    $C$DW$866       .dwtag  DW_TAG_member
   11588                            .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$34)
   11589                            .dwattr $C$DW$866, DW_AT_name("coordPanId")
   11590                            .dwattr $C$DW$866, DW_AT_TI_symbol_name("coordPanId")
   11591                            .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11592                            .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
   11593                            .dwattr $C$DW$866, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11594                            .dwattr $C$DW$866, DW_AT_decl_line(0x3e2)
   11595                            .dwattr $C$DW$866, DW_AT_decl_column(0x11)
   11596                    
   11597                    $C$DW$867       .dwtag  DW_TAG_member
   11598                            .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$34)
   11599                            .dwattr $C$DW$867, DW_AT_name("superframeSpec")
   11600                            .dwattr $C$DW$867, DW_AT_TI_symbol_name("superframeSpec")
   11601                            .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11602                            .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
   11603                            .dwattr $C$DW$867, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11604                            .dwattr $C$DW$867, DW_AT_decl_line(0x3e3)
   11605                            .dwattr $C$DW$867, DW_AT_decl_column(0x11)
   11606                    
   11607                    $C$DW$868       .dwtag  DW_TAG_member
   11608                            .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$27)
   11609                            .dwattr $C$DW$868, DW_AT_name("logicalChannel")
   11610                            .dwattr $C$DW$868, DW_AT_TI_symbol_name("logicalChannel")
   11611                            .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11612                            .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
   11613                            .dwattr $C$DW$868, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11614                            .dwattr $C$DW$868, DW_AT_decl_line(0x3e4)
   11615                            .dwattr $C$DW$868, DW_AT_decl_column(0x11)
   11616                    
   11617                    $C$DW$869       .dwtag  DW_TAG_member
   11618                            .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$27)
   11619                            .dwattr $C$DW$869, DW_AT_name("channelPage")
   11620                            .dwattr $C$DW$869, DW_AT_TI_symbol_name("channelPage")
   11621                            .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   11622                            .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
   11623                            .dwattr $C$DW$869, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11624                            .dwattr $C$DW$869, DW_AT_decl_line(0x3e5)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  213

   11625                            .dwattr $C$DW$869, DW_AT_decl_column(0x11)
   11626                    
   11627                    $C$DW$870       .dwtag  DW_TAG_member
   11628                            .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$40)
   11629                            .dwattr $C$DW$870, DW_AT_name("gtsPermit")
   11630                            .dwattr $C$DW$870, DW_AT_TI_symbol_name("gtsPermit")
   11631                            .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11632                            .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
   11633                            .dwattr $C$DW$870, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11634                            .dwattr $C$DW$870, DW_AT_decl_line(0x3e6)
   11635                            .dwattr $C$DW$870, DW_AT_decl_column(0x11)
   11636                    
   11637                    $C$DW$871       .dwtag  DW_TAG_member
   11638                            .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$27)
   11639                            .dwattr $C$DW$871, DW_AT_name("linkQuality")
   11640                            .dwattr $C$DW$871, DW_AT_TI_symbol_name("linkQuality")
   11641                            .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   11642                            .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
   11643                            .dwattr $C$DW$871, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11644                            .dwattr $C$DW$871, DW_AT_decl_line(0x3e7)
   11645                            .dwattr $C$DW$871, DW_AT_decl_column(0x11)
   11646                    
   11647                    $C$DW$872       .dwtag  DW_TAG_member
   11648                            .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$41)
   11649                            .dwattr $C$DW$872, DW_AT_name("timestamp")
   11650                            .dwattr $C$DW$872, DW_AT_TI_symbol_name("timestamp")
   11651                            .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11652                            .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
   11653                            .dwattr $C$DW$872, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11654                            .dwattr $C$DW$872, DW_AT_decl_line(0x3e8)
   11655                            .dwattr $C$DW$872, DW_AT_decl_column(0x11)
   11656                    
   11657                    $C$DW$873       .dwtag  DW_TAG_member
   11658                            .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$40)
   11659                            .dwattr $C$DW$873, DW_AT_name("securityFailure")
   11660                            .dwattr $C$DW$873, DW_AT_TI_symbol_name("securityFailure")
   11661                            .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11662                            .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
   11663                            .dwattr $C$DW$873, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11664                            .dwattr $C$DW$873, DW_AT_decl_line(0x3e9)
   11665                            .dwattr $C$DW$873, DW_AT_decl_column(0x11)
   11666                    
   11667                    $C$DW$874       .dwtag  DW_TAG_member
   11668                            .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$32)
   11669                            .dwattr $C$DW$874, DW_AT_name("sec")
   11670                            .dwattr $C$DW$874, DW_AT_TI_symbol_name("sec")
   11671                            .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   11672                            .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
   11673                            .dwattr $C$DW$874, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11674                            .dwattr $C$DW$874, DW_AT_decl_line(0x3ea)
   11675                            .dwattr $C$DW$874, DW_AT_decl_column(0x11)
   11676                    
   11677                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11678                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x3e0)
   11679                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  214

   11680                            .dwendtag $C$DW$T$42
   11681                    
   11682                    $C$DW$T$43      .dwtag  DW_TAG_typedef
   11683                            .dwattr $C$DW$T$43, DW_AT_name("macPanDesc_t")
   11684                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
   11685                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   11686                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11687                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x3eb)
   11688                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
   11689                    
   11690                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
   11691                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
   11692                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
   11693                    
   11694                    $C$DW$T$739     .dwtag  DW_TAG_const_type
   11695                            .dwattr $C$DW$T$739, DW_AT_type(*$C$DW$T$44)
   11696                    
   11697                    
   11698                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
   11699                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
   11700                    $C$DW$875       .dwtag  DW_TAG_member
   11701                            .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$44)
   11702                            .dwattr $C$DW$875, DW_AT_name("pPanDesc")
   11703                            .dwattr $C$DW$875, DW_AT_TI_symbol_name("pPanDesc")
   11704                            .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11705                            .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
   11706                            .dwattr $C$DW$875, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11707                            .dwattr $C$DW$875, DW_AT_decl_line(0x4a4)
   11708                            .dwattr $C$DW$875, DW_AT_decl_column(0x13)
   11709                    
   11710                    $C$DW$876       .dwtag  DW_TAG_member
   11711                            .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$27)
   11712                            .dwattr $C$DW$876, DW_AT_name("pendAddrSpec")
   11713                            .dwattr $C$DW$876, DW_AT_TI_symbol_name("pendAddrSpec")
   11714                            .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11715                            .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
   11716                            .dwattr $C$DW$876, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11717                            .dwattr $C$DW$876, DW_AT_decl_line(0x4a5)
   11718                            .dwattr $C$DW$876, DW_AT_decl_column(0x12)
   11719                    
   11720                    $C$DW$877       .dwtag  DW_TAG_member
   11721                            .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$45)
   11722                            .dwattr $C$DW$877, DW_AT_name("pAddrList")
   11723                            .dwattr $C$DW$877, DW_AT_TI_symbol_name("pAddrList")
   11724                            .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11725                            .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
   11726                            .dwattr $C$DW$877, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11727                            .dwattr $C$DW$877, DW_AT_decl_line(0x4a6)
   11728                            .dwattr $C$DW$877, DW_AT_decl_column(0x13)
   11729                    
   11730                    $C$DW$878       .dwtag  DW_TAG_member
   11731                            .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$27)
   11732                            .dwattr $C$DW$878, DW_AT_name("sduLength")
   11733                            .dwattr $C$DW$878, DW_AT_TI_symbol_name("sduLength")
   11734                            .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  215

   11735                            .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
   11736                            .dwattr $C$DW$878, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11737                            .dwattr $C$DW$878, DW_AT_decl_line(0x4a7)
   11738                            .dwattr $C$DW$878, DW_AT_decl_column(0x12)
   11739                    
   11740                    $C$DW$879       .dwtag  DW_TAG_member
   11741                            .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$45)
   11742                            .dwattr $C$DW$879, DW_AT_name("pSdu")
   11743                            .dwattr $C$DW$879, DW_AT_TI_symbol_name("pSdu")
   11744                            .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11745                            .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
   11746                            .dwattr $C$DW$879, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11747                            .dwattr $C$DW$879, DW_AT_decl_line(0x4a8)
   11748                            .dwattr $C$DW$879, DW_AT_decl_column(0x13)
   11749                    
   11750                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11751                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x4a3)
   11752                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
   11753                            .dwendtag $C$DW$T$46
   11754                    
   11755                    $C$DW$T$194     .dwtag  DW_TAG_typedef
   11756                            .dwattr $C$DW$T$194, DW_AT_name("macBeaconData_t")
   11757                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$46)
   11758                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
   11759                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11760                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x4a9)
   11761                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x03)
   11762                    
   11763                    
   11764                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
   11765                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
   11766                    $C$DW$880       .dwtag  DW_TAG_member
   11767                            .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$27)
   11768                            .dwattr $C$DW$880, DW_AT_name("beaconOrder")
   11769                            .dwattr $C$DW$880, DW_AT_TI_symbol_name("beaconOrder")
   11770                            .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11771                            .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
   11772                            .dwattr $C$DW$880, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11773                            .dwattr $C$DW$880, DW_AT_decl_line(0x4ae)
   11774                            .dwattr $C$DW$880, DW_AT_decl_column(0x11)
   11775                    
   11776                    $C$DW$881       .dwtag  DW_TAG_member
   11777                            .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$27)
   11778                            .dwattr $C$DW$881, DW_AT_name("superFrameOrder")
   11779                            .dwattr $C$DW$881, DW_AT_TI_symbol_name("superFrameOrder")
   11780                            .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11781                            .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
   11782                            .dwattr $C$DW$881, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11783                            .dwattr $C$DW$881, DW_AT_decl_line(0x4af)
   11784                            .dwattr $C$DW$881, DW_AT_decl_column(0x11)
   11785                    
   11786                    $C$DW$882       .dwtag  DW_TAG_member
   11787                            .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$27)
   11788                            .dwattr $C$DW$882, DW_AT_name("finalCapSlot")
   11789                            .dwattr $C$DW$882, DW_AT_TI_symbol_name("finalCapSlot")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  216

   11790                            .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11791                            .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
   11792                            .dwattr $C$DW$882, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11793                            .dwattr $C$DW$882, DW_AT_decl_line(0x4b1)
   11794                            .dwattr $C$DW$882, DW_AT_decl_column(0x11)
   11795                    
   11796                    $C$DW$883       .dwtag  DW_TAG_member
   11797                            .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$27)
   11798                            .dwattr $C$DW$883, DW_AT_name("eBeaconOrder")
   11799                            .dwattr $C$DW$883, DW_AT_TI_symbol_name("eBeaconOrder")
   11800                            .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11801                            .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
   11802                            .dwattr $C$DW$883, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11803                            .dwattr $C$DW$883, DW_AT_decl_line(0x4b2)
   11804                            .dwattr $C$DW$883, DW_AT_decl_column(0x11)
   11805                    
   11806                    $C$DW$884       .dwtag  DW_TAG_member
   11807                            .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$27)
   11808                            .dwattr $C$DW$884, DW_AT_name("offsetTimeSlot")
   11809                            .dwattr $C$DW$884, DW_AT_TI_symbol_name("offsetTimeSlot")
   11810                            .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11811                            .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
   11812                            .dwattr $C$DW$884, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11813                            .dwattr $C$DW$884, DW_AT_decl_line(0x4b4)
   11814                            .dwattr $C$DW$884, DW_AT_decl_column(0x11)
   11815                    
   11816                    $C$DW$885       .dwtag  DW_TAG_member
   11817                            .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$27)
   11818                            .dwattr $C$DW$885, DW_AT_name("capBackOff")
   11819                            .dwattr $C$DW$885, DW_AT_TI_symbol_name("capBackOff")
   11820                            .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11821                            .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
   11822                            .dwattr $C$DW$885, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11823                            .dwattr $C$DW$885, DW_AT_decl_line(0x4b5)
   11824                            .dwattr $C$DW$885, DW_AT_decl_column(0x11)
   11825                    
   11826                    $C$DW$886       .dwtag  DW_TAG_member
   11827                            .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$34)
   11828                            .dwattr $C$DW$886, DW_AT_name("eBeaconOrderNBPAN")
   11829                            .dwattr $C$DW$886, DW_AT_TI_symbol_name("eBeaconOrderNBPAN")
   11830                            .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11831                            .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
   11832                            .dwattr $C$DW$886, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11833                            .dwattr $C$DW$886, DW_AT_decl_line(0x4b7)
   11834                            .dwattr $C$DW$886, DW_AT_decl_column(0x11)
   11835                    
   11836                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11837                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x4ad)
   11838                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
   11839                            .dwendtag $C$DW$T$47
   11840                    
   11841                    $C$DW$T$48      .dwtag  DW_TAG_typedef
   11842                            .dwattr $C$DW$T$48, DW_AT_name("macCoexist_t")
   11843                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
   11844                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  217

   11845                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11846                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x4b9)
   11847                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
   11848                    
   11849                    
   11850                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
   11851                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x0c)
   11852                    $C$DW$887       .dwtag  DW_TAG_member
   11853                            .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$44)
   11854                            .dwattr $C$DW$887, DW_AT_name("pPanDesc")
   11855                            .dwattr $C$DW$887, DW_AT_TI_symbol_name("pPanDesc")
   11856                            .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11857                            .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
   11858                            .dwattr $C$DW$887, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11859                            .dwattr $C$DW$887, DW_AT_decl_line(0x4be)
   11860                            .dwattr $C$DW$887, DW_AT_decl_column(0x13)
   11861                    
   11862                    $C$DW$888       .dwtag  DW_TAG_member
   11863                            .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$48)
   11864                            .dwattr $C$DW$888, DW_AT_name("coexist")
   11865                            .dwattr $C$DW$888, DW_AT_TI_symbol_name("coexist")
   11866                            .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11867                            .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
   11868                            .dwattr $C$DW$888, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11869                            .dwattr $C$DW$888, DW_AT_decl_line(0x4bf)
   11870                            .dwattr $C$DW$888, DW_AT_decl_column(0x12)
   11871                    
   11872                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11873                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x4bd)
   11874                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
   11875                            .dwendtag $C$DW$T$49
   11876                    
   11877                    $C$DW$T$195     .dwtag  DW_TAG_typedef
   11878                            .dwattr $C$DW$T$195, DW_AT_name("macEBeaconData_t")
   11879                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$49)
   11880                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
   11881                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11882                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x4c1)
   11883                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
   11884                    
   11885                    
   11886                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
   11887                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x18)
   11888                    $C$DW$889       .dwtag  DW_TAG_member
   11889                            .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$29)
   11890                            .dwattr $C$DW$889, DW_AT_name("hdr")
   11891                            .dwattr $C$DW$889, DW_AT_TI_symbol_name("hdr")
   11892                            .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11893                            .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
   11894                            .dwattr $C$DW$889, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11895                            .dwattr $C$DW$889, DW_AT_decl_line(0x4c6)
   11896                            .dwattr $C$DW$889, DW_AT_decl_column(0x12)
   11897                    
   11898                    $C$DW$890       .dwtag  DW_TAG_member
   11899                            .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  218

   11900                            .dwattr $C$DW$890, DW_AT_name("beaconType")
   11901                            .dwattr $C$DW$890, DW_AT_TI_symbol_name("beaconType")
   11902                            .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11903                            .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
   11904                            .dwattr $C$DW$890, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11905                            .dwattr $C$DW$890, DW_AT_decl_line(0x4c7)
   11906                            .dwattr $C$DW$890, DW_AT_decl_column(0x12)
   11907                    
   11908                    $C$DW$891       .dwtag  DW_TAG_member
   11909                            .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$27)
   11910                            .dwattr $C$DW$891, DW_AT_name("bsn")
   11911                            .dwattr $C$DW$891, DW_AT_TI_symbol_name("bsn")
   11912                            .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11913                            .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
   11914                            .dwattr $C$DW$891, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11915                            .dwattr $C$DW$891, DW_AT_decl_line(0x4c8)
   11916                            .dwattr $C$DW$891, DW_AT_decl_column(0x12)
   11917                    
   11918                    $C$DW$892       .dwtag  DW_TAG_member
   11919                            .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$196)
   11920                            .dwattr $C$DW$892, DW_AT_name("info")
   11921                            .dwattr $C$DW$892, DW_AT_TI_symbol_name("info")
   11922                            .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11923                            .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
   11924                            .dwattr $C$DW$892, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11925                            .dwattr $C$DW$892, DW_AT_decl_line(0x4cd)
   11926                            .dwattr $C$DW$892, DW_AT_decl_column(0x05)
   11927                    
   11928                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11929                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x4c5)
   11930                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
   11931                            .dwendtag $C$DW$T$50
   11932                    
   11933                    $C$DW$T$205     .dwtag  DW_TAG_typedef
   11934                            .dwattr $C$DW$T$205, DW_AT_name("macMlmeBeaconNotifyInd_t")
   11935                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$50)
   11936                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
   11937                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11938                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x4ce)
   11939                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x03)
   11940                    
   11941                    $C$DW$T$745     .dwtag  DW_TAG_pointer_type
   11942                            .dwattr $C$DW$T$745, DW_AT_type(*$C$DW$T$205)
   11943                            .dwattr $C$DW$T$745, DW_AT_address_class(0x20)
   11944                    
   11945                    $C$DW$T$746     .dwtag  DW_TAG_const_type
   11946                            .dwattr $C$DW$T$746, DW_AT_type(*$C$DW$T$745)
   11947                    
   11948                    
   11949                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
   11950                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x15)
   11951                    $C$DW$893       .dwtag  DW_TAG_member
   11952                            .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$29)
   11953                            .dwattr $C$DW$893, DW_AT_name("hdr")
   11954                            .dwattr $C$DW$893, DW_AT_TI_symbol_name("hdr")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  219

   11955                            .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11956                            .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
   11957                            .dwattr $C$DW$893, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11958                            .dwattr $C$DW$893, DW_AT_decl_line(0x4d4)
   11959                            .dwattr $C$DW$893, DW_AT_decl_column(0x17)
   11960                    
   11961                    $C$DW$894       .dwtag  DW_TAG_member
   11962                            .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$31)
   11963                            .dwattr $C$DW$894, DW_AT_name("orphanAddress")
   11964                            .dwattr $C$DW$894, DW_AT_TI_symbol_name("orphanAddress")
   11965                            .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11966                            .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
   11967                            .dwattr $C$DW$894, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11968                            .dwattr $C$DW$894, DW_AT_decl_line(0x4d5)
   11969                            .dwattr $C$DW$894, DW_AT_decl_column(0x17)
   11970                    
   11971                    $C$DW$895       .dwtag  DW_TAG_member
   11972                            .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$32)
   11973                            .dwattr $C$DW$895, DW_AT_name("sec")
   11974                            .dwattr $C$DW$895, DW_AT_TI_symbol_name("sec")
   11975                            .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11976                            .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
   11977                            .dwattr $C$DW$895, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   11978                            .dwattr $C$DW$895, DW_AT_decl_line(0x4d6)
   11979                            .dwattr $C$DW$895, DW_AT_decl_column(0x17)
   11980                    
   11981                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   11982                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x4d3)
   11983                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
   11984                            .dwendtag $C$DW$T$51
   11985                    
   11986                    $C$DW$T$206     .dwtag  DW_TAG_typedef
   11987                            .dwattr $C$DW$T$206, DW_AT_name("macMlmeOrphanInd_t")
   11988                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$51)
   11989                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
   11990                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   11991                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x4d7)
   11992                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x03)
   11993                    
   11994                    
   11995                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
   11996                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x1c)
   11997                    $C$DW$896       .dwtag  DW_TAG_member
   11998                            .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$29)
   11999                            .dwattr $C$DW$896, DW_AT_name("hdr")
   12000                            .dwattr $C$DW$896, DW_AT_TI_symbol_name("hdr")
   12001                            .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12002                            .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
   12003                            .dwattr $C$DW$896, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12004                            .dwattr $C$DW$896, DW_AT_decl_line(0x4dc)
   12005                            .dwattr $C$DW$896, DW_AT_decl_column(0x13)
   12006                    
   12007                    $C$DW$897       .dwtag  DW_TAG_member
   12008                            .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$27)
   12009                            .dwattr $C$DW$897, DW_AT_name("scanType")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  220

   12010                            .dwattr $C$DW$897, DW_AT_TI_symbol_name("scanType")
   12011                            .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12012                            .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
   12013                            .dwattr $C$DW$897, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12014                            .dwattr $C$DW$897, DW_AT_decl_line(0x4dd)
   12015                            .dwattr $C$DW$897, DW_AT_decl_column(0x13)
   12016                    
   12017                    $C$DW$898       .dwtag  DW_TAG_member
   12018                            .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$27)
   12019                            .dwattr $C$DW$898, DW_AT_name("channelPage")
   12020                            .dwattr $C$DW$898, DW_AT_TI_symbol_name("channelPage")
   12021                            .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12022                            .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
   12023                            .dwattr $C$DW$898, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12024                            .dwattr $C$DW$898, DW_AT_decl_line(0x4de)
   12025                            .dwattr $C$DW$898, DW_AT_decl_column(0x13)
   12026                    
   12027                    $C$DW$899       .dwtag  DW_TAG_member
   12028                            .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$27)
   12029                            .dwattr $C$DW$899, DW_AT_name("phyID")
   12030                            .dwattr $C$DW$899, DW_AT_TI_symbol_name("phyID")
   12031                            .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12032                            .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
   12033                            .dwattr $C$DW$899, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12034                            .dwattr $C$DW$899, DW_AT_decl_line(0x4df)
   12035                            .dwattr $C$DW$899, DW_AT_decl_column(0x13)
   12036                    
   12037                    $C$DW$900       .dwtag  DW_TAG_member
   12038                            .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$52)
   12039                            .dwattr $C$DW$900, DW_AT_name("unscannedChannels")
   12040                            .dwattr $C$DW$900, DW_AT_TI_symbol_name("unscannedChannels")
   12041                            .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12042                            .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
   12043                            .dwattr $C$DW$900, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12044                            .dwattr $C$DW$900, DW_AT_decl_line(0x4e0)
   12045                            .dwattr $C$DW$900, DW_AT_decl_column(0x13)
   12046                    
   12047                    $C$DW$901       .dwtag  DW_TAG_member
   12048                            .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$27)
   12049                            .dwattr $C$DW$901, DW_AT_name("resultListSize")
   12050                            .dwattr $C$DW$901, DW_AT_TI_symbol_name("resultListSize")
   12051                            .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12052                            .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
   12053                            .dwattr $C$DW$901, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12054                            .dwattr $C$DW$901, DW_AT_decl_line(0x4e1)
   12055                            .dwattr $C$DW$901, DW_AT_decl_column(0x13)
   12056                    
   12057                    $C$DW$902       .dwtag  DW_TAG_member
   12058                            .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$197)
   12059                            .dwattr $C$DW$902, DW_AT_name("result")
   12060                            .dwattr $C$DW$902, DW_AT_TI_symbol_name("result")
   12061                            .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12062                            .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
   12063                            .dwattr $C$DW$902, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12064                            .dwattr $C$DW$902, DW_AT_decl_line(0x4e6)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  221

   12065                            .dwattr $C$DW$902, DW_AT_decl_column(0x05)
   12066                    
   12067                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12068                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x4db)
   12069                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
   12070                            .dwendtag $C$DW$T$53
   12071                    
   12072                    $C$DW$T$207     .dwtag  DW_TAG_typedef
   12073                            .dwattr $C$DW$T$207, DW_AT_name("macMlmeScanCnf_t")
   12074                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$53)
   12075                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
   12076                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12077                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x4e7)
   12078                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x03)
   12079                    
   12080                    $C$DW$T$749     .dwtag  DW_TAG_pointer_type
   12081                            .dwattr $C$DW$T$749, DW_AT_type(*$C$DW$T$207)
   12082                            .dwattr $C$DW$T$749, DW_AT_address_class(0x20)
   12083                    
   12084                    $C$DW$T$750     .dwtag  DW_TAG_const_type
   12085                            .dwattr $C$DW$T$750, DW_AT_type(*$C$DW$T$749)
   12086                    
   12087                    
   12088                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
   12089                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
   12090                    $C$DW$903       .dwtag  DW_TAG_member
   12091                            .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$29)
   12092                            .dwattr $C$DW$903, DW_AT_name("hdr")
   12093                            .dwattr $C$DW$903, DW_AT_TI_symbol_name("hdr")
   12094                            .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12095                            .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
   12096                            .dwattr $C$DW$903, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12097                            .dwattr $C$DW$903, DW_AT_decl_line(0x4ec)
   12098                            .dwattr $C$DW$903, DW_AT_decl_column(0x13)
   12099                    
   12100                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12101                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x4eb)
   12102                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
   12103                            .dwendtag $C$DW$T$54
   12104                    
   12105                    $C$DW$T$208     .dwtag  DW_TAG_typedef
   12106                            .dwattr $C$DW$T$208, DW_AT_name("macMlmeStartCnf_t")
   12107                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$54)
   12108                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
   12109                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12110                            .dwattr $C$DW$T$208, DW_AT_decl_line(0x4ed)
   12111                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x03)
   12112                    
   12113                    
   12114                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
   12115                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x12)
   12116                    $C$DW$904       .dwtag  DW_TAG_member
   12117                            .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$29)
   12118                            .dwattr $C$DW$904, DW_AT_name("hdr")
   12119                            .dwattr $C$DW$904, DW_AT_TI_symbol_name("hdr")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  222

   12120                            .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12121                            .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
   12122                            .dwattr $C$DW$904, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12123                            .dwattr $C$DW$904, DW_AT_decl_line(0x4f2)
   12124                            .dwattr $C$DW$904, DW_AT_decl_column(0x13)
   12125                    
   12126                    $C$DW$905       .dwtag  DW_TAG_member
   12127                            .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$34)
   12128                            .dwattr $C$DW$905, DW_AT_name("panId")
   12129                            .dwattr $C$DW$905, DW_AT_TI_symbol_name("panId")
   12130                            .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12131                            .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
   12132                            .dwattr $C$DW$905, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12133                            .dwattr $C$DW$905, DW_AT_decl_line(0x4f3)
   12134                            .dwattr $C$DW$905, DW_AT_decl_column(0x13)
   12135                    
   12136                    $C$DW$906       .dwtag  DW_TAG_member
   12137                            .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$27)
   12138                            .dwattr $C$DW$906, DW_AT_name("logicalChannel")
   12139                            .dwattr $C$DW$906, DW_AT_TI_symbol_name("logicalChannel")
   12140                            .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12141                            .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
   12142                            .dwattr $C$DW$906, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12143                            .dwattr $C$DW$906, DW_AT_decl_line(0x4f4)
   12144                            .dwattr $C$DW$906, DW_AT_decl_column(0x13)
   12145                    
   12146                    $C$DW$907       .dwtag  DW_TAG_member
   12147                            .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$27)
   12148                            .dwattr $C$DW$907, DW_AT_name("channelPage")
   12149                            .dwattr $C$DW$907, DW_AT_TI_symbol_name("channelPage")
   12150                            .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12151                            .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
   12152                            .dwattr $C$DW$907, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12153                            .dwattr $C$DW$907, DW_AT_decl_line(0x4f5)
   12154                            .dwattr $C$DW$907, DW_AT_decl_column(0x13)
   12155                    
   12156                    $C$DW$908       .dwtag  DW_TAG_member
   12157                            .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$27)
   12158                            .dwattr $C$DW$908, DW_AT_name("phyID")
   12159                            .dwattr $C$DW$908, DW_AT_TI_symbol_name("phyID")
   12160                            .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12161                            .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
   12162                            .dwattr $C$DW$908, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12163                            .dwattr $C$DW$908, DW_AT_decl_line(0x4f6)
   12164                            .dwattr $C$DW$908, DW_AT_decl_column(0x13)
   12165                    
   12166                    $C$DW$909       .dwtag  DW_TAG_member
   12167                            .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$32)
   12168                            .dwattr $C$DW$909, DW_AT_name("sec")
   12169                            .dwattr $C$DW$909, DW_AT_TI_symbol_name("sec")
   12170                            .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12171                            .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
   12172                            .dwattr $C$DW$909, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12173                            .dwattr $C$DW$909, DW_AT_decl_line(0x4f7)
   12174                            .dwattr $C$DW$909, DW_AT_decl_column(0x13)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  223

   12175                    
   12176                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12177                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x4f1)
   12178                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
   12179                            .dwendtag $C$DW$T$55
   12180                    
   12181                    $C$DW$T$209     .dwtag  DW_TAG_typedef
   12182                            .dwattr $C$DW$T$209, DW_AT_name("macMlmeSyncLossInd_t")
   12183                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$55)
   12184                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
   12185                            .dwattr $C$DW$T$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12186                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x4f8)
   12187                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x03)
   12188                    
   12189                    
   12190                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
   12191                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x03)
   12192                    $C$DW$910       .dwtag  DW_TAG_member
   12193                            .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$29)
   12194                            .dwattr $C$DW$910, DW_AT_name("hdr")
   12195                            .dwattr $C$DW$910, DW_AT_TI_symbol_name("hdr")
   12196                            .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12197                            .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
   12198                            .dwattr $C$DW$910, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12199                            .dwattr $C$DW$910, DW_AT_decl_line(0x4fd)
   12200                            .dwattr $C$DW$910, DW_AT_decl_column(0x13)
   12201                    
   12202                    $C$DW$911       .dwtag  DW_TAG_member
   12203                            .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$27)
   12204                            .dwattr $C$DW$911, DW_AT_name("framePending")
   12205                            .dwattr $C$DW$911, DW_AT_TI_symbol_name("framePending")
   12206                            .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12207                            .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
   12208                            .dwattr $C$DW$911, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12209                            .dwattr $C$DW$911, DW_AT_decl_line(0x4fe)
   12210                            .dwattr $C$DW$911, DW_AT_decl_column(0x13)
   12211                    
   12212                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12213                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x4fc)
   12214                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
   12215                            .dwendtag $C$DW$T$56
   12216                    
   12217                    $C$DW$T$210     .dwtag  DW_TAG_typedef
   12218                            .dwattr $C$DW$T$210, DW_AT_name("macMlmePollCnf_t")
   12219                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$56)
   12220                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
   12221                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12222                            .dwattr $C$DW$T$210, DW_AT_decl_line(0x4ff)
   12223                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x03)
   12224                    
   12225                    
   12226                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
   12227                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x24)
   12228                    $C$DW$912       .dwtag  DW_TAG_member
   12229                            .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$29)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  224

   12230                            .dwattr $C$DW$912, DW_AT_name("hdr")
   12231                            .dwattr $C$DW$912, DW_AT_TI_symbol_name("hdr")
   12232                            .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12233                            .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
   12234                            .dwattr $C$DW$912, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12235                            .dwattr $C$DW$912, DW_AT_decl_line(0x504)
   12236                            .dwattr $C$DW$912, DW_AT_decl_column(0x13)
   12237                    
   12238                    $C$DW$913       .dwtag  DW_TAG_member
   12239                            .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$38)
   12240                            .dwattr $C$DW$913, DW_AT_name("srcAddr")
   12241                            .dwattr $C$DW$913, DW_AT_TI_symbol_name("srcAddr")
   12242                            .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12243                            .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
   12244                            .dwattr $C$DW$913, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12245                            .dwattr $C$DW$913, DW_AT_decl_line(0x505)
   12246                            .dwattr $C$DW$913, DW_AT_decl_column(0x13)
   12247                    
   12248                    $C$DW$914       .dwtag  DW_TAG_member
   12249                            .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$38)
   12250                            .dwattr $C$DW$914, DW_AT_name("dstAddr")
   12251                            .dwattr $C$DW$914, DW_AT_TI_symbol_name("dstAddr")
   12252                            .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12253                            .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
   12254                            .dwattr $C$DW$914, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12255                            .dwattr $C$DW$914, DW_AT_decl_line(0x506)
   12256                            .dwattr $C$DW$914, DW_AT_decl_column(0x13)
   12257                    
   12258                    $C$DW$915       .dwtag  DW_TAG_member
   12259                            .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$34)
   12260                            .dwattr $C$DW$915, DW_AT_name("panId")
   12261                            .dwattr $C$DW$915, DW_AT_TI_symbol_name("panId")
   12262                            .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12263                            .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
   12264                            .dwattr $C$DW$915, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12265                            .dwattr $C$DW$915, DW_AT_decl_line(0x507)
   12266                            .dwattr $C$DW$915, DW_AT_decl_column(0x13)
   12267                    
   12268                    $C$DW$916       .dwtag  DW_TAG_member
   12269                            .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
   12270                            .dwattr $C$DW$916, DW_AT_name("reason")
   12271                            .dwattr $C$DW$916, DW_AT_TI_symbol_name("reason")
   12272                            .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12273                            .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
   12274                            .dwattr $C$DW$916, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
   12275                            .dwattr $C$DW$916, DW_AT_decl_line(0x508)
   12276                            .dwattr $C$DW$916, DW_AT_decl_column(0x13)
   12277                    
   12278                    $C$DW$917       .dwtag  DW_TAG_member
   12279                            .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$32)
   12280                            .dwattr $C$DW$917, DW_AT_name("sec")
   12281                            .dwattr $C$DW$917, DW_AT_TI_symbol_name("sec")
   12282                            .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12283                            .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
   12284                            .dwattr $C$DW$917, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:50 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{9A419F3E-CE2D-47E3-ABE5-0EE6D6901F8C} PAGE  225

   12285                            .dwattr $C$DW$917, DW_AT_decl_line(0x509)
   12286                            .dwattr $C$DW$917, DW_AT_decl_column(0x13)
   12287                    
   12288                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
   12289                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x503)
   12290                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
   12291                            .dwendtag $C$DW$T$57
   12292                    
   12293                    $C$DW$T$211     .dwtag  DW_TAG_typedef
   12294                            .dwattr $C$DW$T$211, DW_AT_name("macMlmeCommStatusInd_t")
   12295                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$57)
   12296                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
   12297                            .dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
   12298                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x50a)
   12299                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x03)
   12300                    
   12301                    
   12302                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
