TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 16:40:45 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    2996                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2997                            .dwattr $C$DW$193, DW_AT_decl_line(0x5ed)
    2998                            .dwattr $C$DW$193, DW_AT_decl_column(0x05)
    2999                    
    3000                    $C$DW$194       .dwtag  DW_TAG_enumerator
    3001                            .dwattr $C$DW$194, DW_AT_name("RF_AllowDelayAny")
    3002                            .dwattr $C$DW$194, DW_AT_const_value(-1)
    3003                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3004                            .dwattr $C$DW$194, DW_AT_decl_line(0x5ee)
    3005                            .dwattr $C$DW$194, DW_AT_decl_column(0x05)
    3006                    
    3007                            .dwattr $C$DW$T$1042, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3008                            .dwattr $C$DW$T$1042, DW_AT_decl_line(0x5ec)
    3009                            .dwattr $C$DW$T$1042, DW_AT_decl_column(0x0e)
    3010                            .dwendtag $C$DW$T$1042
    3011                    
    3012                    $C$DW$T$1043    .dwtag  DW_TAG_typedef
    3013                            .dwattr $C$DW$T$1043, DW_AT_name("RF_AllowDelay")
    3014                            .dwattr $C$DW$T$1043, DW_AT_type(*$C$DW$T$1042)
    3015                            .dwattr $C$DW$T$1043, DW_AT_language(DW_LANG_C)
    3016                            .dwattr $C$DW$T$1043, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3017                            .dwattr $C$DW$T$1043, DW_AT_decl_line(0x5ef)
    3018                            .dwattr $C$DW$T$1043, DW_AT_decl_column(0x03)
    3019                    
    3020                    
    3021                    $C$DW$T$1044    .dwtag  DW_TAG_enumeration_type
    3022                            .dwattr $C$DW$T$1044, DW_AT_byte_size(0x01)
    3023                    $C$DW$195       .dwtag  DW_TAG_enumerator
    3024                            .dwattr $C$DW$195, DW_AT_name("RF_RatChannelAny")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   56

    3025                            .dwattr $C$DW$195, DW_AT_const_value(-1)
    3026                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3027                            .dwattr $C$DW$195, DW_AT_decl_line(0x60f)
    3028                            .dwattr $C$DW$195, DW_AT_decl_column(0x05)
    3029                    
    3030                    $C$DW$196       .dwtag  DW_TAG_enumerator
    3031                            .dwattr $C$DW$196, DW_AT_name("RF_RatChannel0")
    3032                            .dwattr $C$DW$196, DW_AT_const_value(0x00)
    3033                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3034                            .dwattr $C$DW$196, DW_AT_decl_line(0x610)
    3035                            .dwattr $C$DW$196, DW_AT_decl_column(0x05)
    3036                    
    3037                    $C$DW$197       .dwtag  DW_TAG_enumerator
    3038                            .dwattr $C$DW$197, DW_AT_name("RF_RatChannel1")
    3039                            .dwattr $C$DW$197, DW_AT_const_value(0x01)
    3040                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3041                            .dwattr $C$DW$197, DW_AT_decl_line(0x611)
    3042                            .dwattr $C$DW$197, DW_AT_decl_column(0x05)
    3043                    
    3044                    $C$DW$198       .dwtag  DW_TAG_enumerator
    3045                            .dwattr $C$DW$198, DW_AT_name("RF_RatChannel2")
    3046                            .dwattr $C$DW$198, DW_AT_const_value(0x02)
    3047                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3048                            .dwattr $C$DW$198, DW_AT_decl_line(0x612)
    3049                            .dwattr $C$DW$198, DW_AT_decl_column(0x05)
    3050                    
    3051                            .dwattr $C$DW$T$1044, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3052                            .dwattr $C$DW$T$1044, DW_AT_decl_line(0x60e)
    3053                            .dwattr $C$DW$T$1044, DW_AT_decl_column(0x0e)
    3054                            .dwendtag $C$DW$T$1044
    3055                    
    3056                    $C$DW$T$1045    .dwtag  DW_TAG_typedef
    3057                            .dwattr $C$DW$T$1045, DW_AT_name("RF_RatSelectChannel")
    3058                            .dwattr $C$DW$T$1045, DW_AT_type(*$C$DW$T$1044)
    3059                            .dwattr $C$DW$T$1045, DW_AT_language(DW_LANG_C)
    3060                            .dwattr $C$DW$T$1045, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3061                            .dwattr $C$DW$T$1045, DW_AT_decl_line(0x613)
    3062                            .dwattr $C$DW$T$1045, DW_AT_decl_column(0x03)
    3063                    
    3064                    
    3065                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3066                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3067                    $C$DW$199       .dwtag  DW_TAG_member
    3068                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3069                            .dwattr $C$DW$199, DW_AT_name("rfMode")
    3070                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("rfMode")
    3071                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3072                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3073                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3074                            .dwattr $C$DW$199, DW_AT_decl_line(0x421)
    3075                            .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    3076                    
    3077                    $C$DW$200       .dwtag  DW_TAG_member
    3078                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    3079                            .dwattr $C$DW$200, DW_AT_name("cpePatchFxn")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   57

    3080                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("cpePatchFxn")
    3081                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3082                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3083                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3084                            .dwattr $C$DW$200, DW_AT_decl_line(0x422)
    3085                            .dwattr $C$DW$200, DW_AT_decl_column(0x0c)
    3086                    
    3087                    $C$DW$201       .dwtag  DW_TAG_member
    3088                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    3089                            .dwattr $C$DW$201, DW_AT_name("mcePatchFxn")
    3090                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("mcePatchFxn")
    3091                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3092                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3093                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3094                            .dwattr $C$DW$201, DW_AT_decl_line(0x423)
    3095                            .dwattr $C$DW$201, DW_AT_decl_column(0x0c)
    3096                    
    3097                    $C$DW$202       .dwtag  DW_TAG_member
    3098                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    3099                            .dwattr $C$DW$202, DW_AT_name("rfePatchFxn")
    3100                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("rfePatchFxn")
    3101                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3102                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3103                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3104                            .dwattr $C$DW$202, DW_AT_decl_line(0x424)
    3105                            .dwattr $C$DW$202, DW_AT_decl_column(0x0c)
    3106                    
    3107                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3108                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    3109                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3110                            .dwendtag $C$DW$T$22
    3111                    
    3112                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    3113                            .dwattr $C$DW$T$44, DW_AT_name("RF_Mode")
    3114                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
    3115                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3116                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3117                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x425)
    3118                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    3119                    
    3120                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3121                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3122                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3123                    
    3124                    
    3125                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3126                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3127                    $C$DW$203       .dwtag  DW_TAG_member
    3128                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3129                            .dwattr $C$DW$203, DW_AT_name("triggerType")
    3130                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("triggerType")
    3131                            .dwattr $C$DW$203, DW_AT_bit_offset(0x04)
    3132                            .dwattr $C$DW$203, DW_AT_bit_size(0x04)
    3133                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   58

    3135                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3136                            .dwattr $C$DW$203, DW_AT_decl_line(0x7d)
    3137                            .dwattr $C$DW$203, DW_AT_decl_column(0x0f)
    3138                    
    3139                    $C$DW$204       .dwtag  DW_TAG_member
    3140                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3141                            .dwattr $C$DW$204, DW_AT_name("bEnaCmd")
    3142                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("bEnaCmd")
    3143                            .dwattr $C$DW$204, DW_AT_bit_offset(0x03)
    3144                            .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3145                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3146                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3148                            .dwattr $C$DW$204, DW_AT_decl_line(0x7e)
    3149                            .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
    3150                    
    3151                    $C$DW$205       .dwtag  DW_TAG_member
    3152                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3153                            .dwattr $C$DW$205, DW_AT_name("triggerNo")
    3154                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("triggerNo")
    3155                            .dwattr $C$DW$205, DW_AT_bit_offset(0x01)
    3156                            .dwattr $C$DW$205, DW_AT_bit_size(0x02)
    3157                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3159                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3160                            .dwattr $C$DW$205, DW_AT_decl_line(0x80)
    3161                            .dwattr $C$DW$205, DW_AT_decl_column(0x0f)
    3162                    
    3163                    $C$DW$206       .dwtag  DW_TAG_member
    3164                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3165                            .dwattr $C$DW$206, DW_AT_name("pastTrig")
    3166                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pastTrig")
    3167                            .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    3168                            .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    3169                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3170                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3171                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3172                            .dwattr $C$DW$206, DW_AT_decl_line(0x81)
    3173                            .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    3174                    
    3175                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3176                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x7c)
    3177                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    3178                            .dwendtag $C$DW$T$23
    3179                    
    3180                    
    3181                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3182                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3183                    $C$DW$207       .dwtag  DW_TAG_member
    3184                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3185                            .dwattr $C$DW$207, DW_AT_name("rule")
    3186                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("rule")
    3187                            .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    3188                            .dwattr $C$DW$207, DW_AT_bit_size(0x04)
    3189                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   59

    3190                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3191                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3192                            .dwattr $C$DW$207, DW_AT_decl_line(0x85)
    3193                            .dwattr $C$DW$207, DW_AT_decl_column(0x0f)
    3194                    
    3195                    $C$DW$208       .dwtag  DW_TAG_member
    3196                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3197                            .dwattr $C$DW$208, DW_AT_name("nSkip")
    3198                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("nSkip")
    3199                            .dwattr $C$DW$208, DW_AT_bit_offset(0x00)
    3200                            .dwattr $C$DW$208, DW_AT_bit_size(0x04)
    3201                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3202                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3203                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3204                            .dwattr $C$DW$208, DW_AT_decl_line(0x86)
    3205                            .dwattr $C$DW$208, DW_AT_decl_column(0x0f)
    3206                    
    3207                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3208                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x84)
    3209                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    3210                            .dwendtag $C$DW$T$24
    3211                    
    3212                    
    3213                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3214                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3215                    $C$DW$209       .dwtag  DW_TAG_member
    3216                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3217                            .dwattr $C$DW$209, DW_AT_name("triggerType")
    3218                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("triggerType")
    3219                            .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    3220                            .dwattr $C$DW$209, DW_AT_bit_size(0x04)
    3221                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3222                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3223                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3224                            .dwattr $C$DW$209, DW_AT_decl_line(0xb3)
    3225                            .dwattr $C$DW$209, DW_AT_decl_column(0x0f)
    3226                    
    3227                    $C$DW$210       .dwtag  DW_TAG_member
    3228                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3229                            .dwattr $C$DW$210, DW_AT_name("bEnaCmd")
    3230                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("bEnaCmd")
    3231                            .dwattr $C$DW$210, DW_AT_bit_offset(0x03)
    3232                            .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    3233                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3234                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3235                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3236                            .dwattr $C$DW$210, DW_AT_decl_line(0xb4)
    3237                            .dwattr $C$DW$210, DW_AT_decl_column(0x0f)
    3238                    
    3239                    $C$DW$211       .dwtag  DW_TAG_member
    3240                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3241                            .dwattr $C$DW$211, DW_AT_name("triggerNo")
    3242                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("triggerNo")
    3243                            .dwattr $C$DW$211, DW_AT_bit_offset(0x01)
    3244                            .dwattr $C$DW$211, DW_AT_bit_size(0x02)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   60

    3245                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3246                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3247                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3248                            .dwattr $C$DW$211, DW_AT_decl_line(0xb6)
    3249                            .dwattr $C$DW$211, DW_AT_decl_column(0x0f)
    3250                    
    3251                    $C$DW$212       .dwtag  DW_TAG_member
    3252                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3253                            .dwattr $C$DW$212, DW_AT_name("pastTrig")
    3254                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pastTrig")
    3255                            .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    3256                            .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    3257                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3258                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3259                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3260                            .dwattr $C$DW$212, DW_AT_decl_line(0xb7)
    3261                            .dwattr $C$DW$212, DW_AT_decl_column(0x0f)
    3262                    
    3263                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3264                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xb2)
    3265                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    3266                            .dwendtag $C$DW$T$25
    3267                    
    3268                    
    3269                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3270                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3271                    $C$DW$213       .dwtag  DW_TAG_member
    3272                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3273                            .dwattr $C$DW$213, DW_AT_name("rule")
    3274                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("rule")
    3275                            .dwattr $C$DW$213, DW_AT_bit_offset(0x04)
    3276                            .dwattr $C$DW$213, DW_AT_bit_size(0x04)
    3277                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3278                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3279                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3280                            .dwattr $C$DW$213, DW_AT_decl_line(0xbb)
    3281                            .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    3282                    
    3283                    $C$DW$214       .dwtag  DW_TAG_member
    3284                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3285                            .dwattr $C$DW$214, DW_AT_name("nSkip")
    3286                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("nSkip")
    3287                            .dwattr $C$DW$214, DW_AT_bit_offset(0x00)
    3288                            .dwattr $C$DW$214, DW_AT_bit_size(0x04)
    3289                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3290                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3291                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3292                            .dwattr $C$DW$214, DW_AT_decl_line(0xbc)
    3293                            .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    3294                    
    3295                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3296                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xba)
    3297                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3298                            .dwendtag $C$DW$T$26
    3299                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   61

    3300                    
    3301                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3302                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    3303                    $C$DW$215       .dwtag  DW_TAG_member
    3304                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3305                            .dwattr $C$DW$215, DW_AT_name("frontEndMode")
    3306                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("frontEndMode")
    3307                            .dwattr $C$DW$215, DW_AT_bit_offset(0x0d)
    3308                            .dwattr $C$DW$215, DW_AT_bit_size(0x03)
    3309                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3310                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3311                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3312                            .dwattr $C$DW$215, DW_AT_decl_line(0xc9)
    3313                            .dwattr $C$DW$215, DW_AT_decl_column(0x10)
    3314                    
    3315                    $C$DW$216       .dwtag  DW_TAG_member
    3316                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
    3317                            .dwattr $C$DW$216, DW_AT_name("biasMode")
    3318                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("biasMode")
    3319                            .dwattr $C$DW$216, DW_AT_bit_offset(0x0c)
    3320                            .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3321                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3322                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3324                            .dwattr $C$DW$216, DW_AT_decl_line(0xcf)
    3325                            .dwattr $C$DW$216, DW_AT_decl_column(0x10)
    3326                    
    3327                    $C$DW$217       .dwtag  DW_TAG_member
    3328                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3329                            .dwattr $C$DW$217, DW_AT_name("analogCfgMode")
    3330                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("analogCfgMode")
    3331                            .dwattr $C$DW$217, DW_AT_bit_offset(0x06)
    3332                            .dwattr $C$DW$217, DW_AT_bit_size(0x06)
    3333                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3334                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3335                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3336                            .dwattr $C$DW$217, DW_AT_decl_line(0xd1)
    3337                            .dwattr $C$DW$217, DW_AT_decl_column(0x10)
    3338                    
    3339                    $C$DW$218       .dwtag  DW_TAG_member
    3340                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    3341                            .dwattr $C$DW$218, DW_AT_name("bNoFsPowerUp")
    3342                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3343                            .dwattr $C$DW$218, DW_AT_bit_offset(0x05)
    3344                            .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3345                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3346                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3347                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3348                            .dwattr $C$DW$218, DW_AT_decl_line(0xd8)
    3349                            .dwattr $C$DW$218, DW_AT_decl_column(0x10)
    3350                    
    3351                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3352                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xc8)
    3353                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    3354                            .dwendtag $C$DW$T$28
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   62

    3355                    
    3356                    
    3357                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3358                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3359                    $C$DW$219       .dwtag  DW_TAG_member
    3360                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3361                            .dwattr $C$DW$219, DW_AT_name("triggerType")
    3362                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("triggerType")
    3363                            .dwattr $C$DW$219, DW_AT_bit_offset(0x04)
    3364                            .dwattr $C$DW$219, DW_AT_bit_size(0x04)
    3365                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3367                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3368                            .dwattr $C$DW$219, DW_AT_decl_line(0x1cf)
    3369                            .dwattr $C$DW$219, DW_AT_decl_column(0x0f)
    3370                    
    3371                    $C$DW$220       .dwtag  DW_TAG_member
    3372                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3373                            .dwattr $C$DW$220, DW_AT_name("bEnaCmd")
    3374                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("bEnaCmd")
    3375                            .dwattr $C$DW$220, DW_AT_bit_offset(0x03)
    3376                            .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3377                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3378                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3380                            .dwattr $C$DW$220, DW_AT_decl_line(0x1d0)
    3381                            .dwattr $C$DW$220, DW_AT_decl_column(0x0f)
    3382                    
    3383                    $C$DW$221       .dwtag  DW_TAG_member
    3384                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3385                            .dwattr $C$DW$221, DW_AT_name("triggerNo")
    3386                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("triggerNo")
    3387                            .dwattr $C$DW$221, DW_AT_bit_offset(0x01)
    3388                            .dwattr $C$DW$221, DW_AT_bit_size(0x02)
    3389                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3390                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3391                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3392                            .dwattr $C$DW$221, DW_AT_decl_line(0x1d2)
    3393                            .dwattr $C$DW$221, DW_AT_decl_column(0x0f)
    3394                    
    3395                    $C$DW$222       .dwtag  DW_TAG_member
    3396                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3397                            .dwattr $C$DW$222, DW_AT_name("pastTrig")
    3398                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pastTrig")
    3399                            .dwattr $C$DW$222, DW_AT_bit_offset(0x00)
    3400                            .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3401                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3403                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3404                            .dwattr $C$DW$222, DW_AT_decl_line(0x1d3)
    3405                            .dwattr $C$DW$222, DW_AT_decl_column(0x0f)
    3406                    
    3407                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3408                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1ce)
    3409                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   63

    3410                            .dwendtag $C$DW$T$29
    3411                    
    3412                    
    3413                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3414                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3415                    $C$DW$223       .dwtag  DW_TAG_member
    3416                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3417                            .dwattr $C$DW$223, DW_AT_name("rule")
    3418                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("rule")
    3419                            .dwattr $C$DW$223, DW_AT_bit_offset(0x04)
    3420                            .dwattr $C$DW$223, DW_AT_bit_size(0x04)
    3421                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3422                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3423                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3424                            .dwattr $C$DW$223, DW_AT_decl_line(0x1d7)
    3425                            .dwattr $C$DW$223, DW_AT_decl_column(0x0f)
    3426                    
    3427                    $C$DW$224       .dwtag  DW_TAG_member
    3428                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3429                            .dwattr $C$DW$224, DW_AT_name("nSkip")
    3430                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("nSkip")
    3431                            .dwattr $C$DW$224, DW_AT_bit_offset(0x00)
    3432                            .dwattr $C$DW$224, DW_AT_bit_size(0x04)
    3433                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3434                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3435                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3436                            .dwattr $C$DW$224, DW_AT_decl_line(0x1d8)
    3437                            .dwattr $C$DW$224, DW_AT_decl_column(0x0f)
    3438                    
    3439                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3440                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x1d6)
    3441                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    3442                            .dwendtag $C$DW$T$30
    3443                    
    3444                    
    3445                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3446                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3447                    $C$DW$225       .dwtag  DW_TAG_member
    3448                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    3449                            .dwattr $C$DW$225, DW_AT_name("modType")
    3450                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("modType")
    3451                            .dwattr $C$DW$225, DW_AT_bit_offset(0x0d)
    3452                            .dwattr $C$DW$225, DW_AT_bit_size(0x03)
    3453                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3454                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3455                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3456                            .dwattr $C$DW$225, DW_AT_decl_line(0x1db)
    3457                            .dwattr $C$DW$225, DW_AT_decl_column(0x10)
    3458                    
    3459                    $C$DW$226       .dwtag  DW_TAG_member
    3460                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    3461                            .dwattr $C$DW$226, DW_AT_name("deviation")
    3462                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("deviation")
    3463                            .dwattr $C$DW$226, DW_AT_bit_offset(0x00)
    3464                            .dwattr $C$DW$226, DW_AT_bit_size(0x0d)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   64

    3465                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3467                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3468                            .dwattr $C$DW$226, DW_AT_decl_line(0x1de)
    3469                            .dwattr $C$DW$226, DW_AT_decl_column(0x10)
    3470                    
    3471                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3472                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x1da)
    3473                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    3474                            .dwendtag $C$DW$T$31
    3475                    
    3476                    
    3477                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3478                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    3479                    $C$DW$227       .dwtag  DW_TAG_member
    3480                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$32)
    3481                            .dwattr $C$DW$227, DW_AT_name("preScale")
    3482                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("preScale")
    3483                            .dwattr $C$DW$227, DW_AT_bit_offset(0x1c)
    3484                            .dwattr $C$DW$227, DW_AT_bit_size(0x04)
    3485                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3486                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3487                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3488                            .dwattr $C$DW$227, DW_AT_decl_line(0x1e1)
    3489                            .dwattr $C$DW$227, DW_AT_decl_column(0x10)
    3490                    
    3491                    $C$DW$228       .dwtag  DW_TAG_member
    3492                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$32)
    3493                            .dwattr $C$DW$228, DW_AT_name("rateWord")
    3494                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("rateWord")
    3495                            .dwattr $C$DW$228, DW_AT_bit_offset(0x03)
    3496                            .dwattr $C$DW$228, DW_AT_bit_size(0x15)
    3497                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3498                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3500                            .dwattr $C$DW$228, DW_AT_decl_line(0x1e3)
    3501                            .dwattr $C$DW$228, DW_AT_decl_column(0x10)
    3502                    
    3503                    $C$DW$229       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$32)
    3505                            .dwattr $C$DW$229, DW_AT_name("decimMode")
    3506                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("decimMode")
    3507                            .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    3508                            .dwattr $C$DW$229, DW_AT_bit_size(0x03)
    3509                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3510                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3511                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3512                            .dwattr $C$DW$229, DW_AT_decl_line(0x1e4)
    3513                            .dwattr $C$DW$229, DW_AT_decl_column(0x10)
    3514                    
    3515                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3516                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1e0)
    3517                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    3518                            .dwendtag $C$DW$T$33
    3519                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   65

    3520                    
    3521                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3522                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3523                    $C$DW$230       .dwtag  DW_TAG_member
    3524                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3525                            .dwattr $C$DW$230, DW_AT_name("nPreamBytes")
    3526                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("nPreamBytes")
    3527                            .dwattr $C$DW$230, DW_AT_bit_offset(0x02)
    3528                            .dwattr $C$DW$230, DW_AT_bit_size(0x06)
    3529                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3530                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3531                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3532                            .dwattr $C$DW$230, DW_AT_decl_line(0x1ec)
    3533                            .dwattr $C$DW$230, DW_AT_decl_column(0x0f)
    3534                    
    3535                    $C$DW$231       .dwtag  DW_TAG_member
    3536                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3537                            .dwattr $C$DW$231, DW_AT_name("preamMode")
    3538                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("preamMode")
    3539                            .dwattr $C$DW$231, DW_AT_bit_offset(0x00)
    3540                            .dwattr $C$DW$231, DW_AT_bit_size(0x02)
    3541                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3542                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3543                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3544                            .dwattr $C$DW$231, DW_AT_decl_line(0x1f2)
    3545                            .dwattr $C$DW$231, DW_AT_decl_column(0x0f)
    3546                    
    3547                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3548                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1eb)
    3549                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3550                            .dwendtag $C$DW$T$34
    3551                    
    3552                    
    3553                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3554                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3555                    $C$DW$232       .dwtag  DW_TAG_member
    3556                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    3557                            .dwattr $C$DW$232, DW_AT_name("nSwBits")
    3558                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("nSwBits")
    3559                            .dwattr $C$DW$232, DW_AT_bit_offset(0x0a)
    3560                            .dwattr $C$DW$232, DW_AT_bit_size(0x06)
    3561                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3562                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3563                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3564                            .dwattr $C$DW$232, DW_AT_decl_line(0x1f8)
    3565                            .dwattr $C$DW$232, DW_AT_decl_column(0x10)
    3566                    
    3567                    $C$DW$233       .dwtag  DW_TAG_member
    3568                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    3569                            .dwattr $C$DW$233, DW_AT_name("bBitReversal")
    3570                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("bBitReversal")
    3571                            .dwattr $C$DW$233, DW_AT_bit_offset(0x09)
    3572                            .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    3573                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3574                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   66

    3575                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3576                            .dwattr $C$DW$233, DW_AT_decl_line(0x1f9)
    3577                            .dwattr $C$DW$233, DW_AT_decl_column(0x10)
    3578                    
    3579                    $C$DW$234       .dwtag  DW_TAG_member
    3580                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    3581                            .dwattr $C$DW$234, DW_AT_name("bMsbFirst")
    3582                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("bMsbFirst")
    3583                            .dwattr $C$DW$234, DW_AT_bit_offset(0x08)
    3584                            .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    3585                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3586                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3587                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3588                            .dwattr $C$DW$234, DW_AT_decl_line(0x1fb)
    3589                            .dwattr $C$DW$234, DW_AT_decl_column(0x10)
    3590                    
    3591                    $C$DW$235       .dwtag  DW_TAG_member
    3592                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    3593                            .dwattr $C$DW$235, DW_AT_name("fecMode")
    3594                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("fecMode")
    3595                            .dwattr $C$DW$235, DW_AT_bit_offset(0x04)
    3596                            .dwattr $C$DW$235, DW_AT_bit_size(0x04)
    3597                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3598                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3599                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3600                            .dwattr $C$DW$235, DW_AT_decl_line(0x1fd)
    3601                            .dwattr $C$DW$235, DW_AT_decl_column(0x10)
    3602                    
    3603                    $C$DW$236       .dwtag  DW_TAG_member
    3604                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    3605                            .dwattr $C$DW$236, DW_AT_name("whitenMode")
    3606                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("whitenMode")
    3607                            .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    3608                            .dwattr $C$DW$236, DW_AT_bit_size(0x03)
    3609                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3610                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3611                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3612                            .dwattr $C$DW$236, DW_AT_decl_line(0x203)
    3613                            .dwattr $C$DW$236, DW_AT_decl_column(0x10)
    3614                    
    3615                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3616                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1f7)
    3617                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3618                            .dwendtag $C$DW$T$35
    3619                    
    3620                    
    3621                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3622                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3623                    $C$DW$237       .dwtag  DW_TAG_member
    3624                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    3625                            .dwattr $C$DW$237, DW_AT_name("frontEndMode")
    3626                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("frontEndMode")
    3627                            .dwattr $C$DW$237, DW_AT_bit_offset(0x0d)
    3628                            .dwattr $C$DW$237, DW_AT_bit_size(0x03)
    3629                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   67

    3630                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3631                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3632                            .dwattr $C$DW$237, DW_AT_decl_line(0x20d)
    3633                            .dwattr $C$DW$237, DW_AT_decl_column(0x10)
    3634                    
    3635                    $C$DW$238       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    3637                            .dwattr $C$DW$238, DW_AT_name("biasMode")
    3638                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("biasMode")
    3639                            .dwattr $C$DW$238, DW_AT_bit_offset(0x0c)
    3640                            .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    3641                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3642                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3643                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3644                            .dwattr $C$DW$238, DW_AT_decl_line(0x213)
    3645                            .dwattr $C$DW$238, DW_AT_decl_column(0x10)
    3646                    
    3647                    $C$DW$239       .dwtag  DW_TAG_member
    3648                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    3649                            .dwattr $C$DW$239, DW_AT_name("analogCfgMode")
    3650                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("analogCfgMode")
    3651                            .dwattr $C$DW$239, DW_AT_bit_offset(0x06)
    3652                            .dwattr $C$DW$239, DW_AT_bit_size(0x06)
    3653                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3654                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3655                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3656                            .dwattr $C$DW$239, DW_AT_decl_line(0x215)
    3657                            .dwattr $C$DW$239, DW_AT_decl_column(0x10)
    3658                    
    3659                    $C$DW$240       .dwtag  DW_TAG_member
    3660                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    3661                            .dwattr $C$DW$240, DW_AT_name("bNoFsPowerUp")
    3662                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3663                            .dwattr $C$DW$240, DW_AT_bit_offset(0x05)
    3664                            .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3665                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3666                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3667                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3668                            .dwattr $C$DW$240, DW_AT_decl_line(0x21c)
    3669                            .dwattr $C$DW$240, DW_AT_decl_column(0x10)
    3670                    
    3671                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3672                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x20c)
    3673                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    3674                            .dwendtag $C$DW$T$36
    3675                    
    3676                    
    3677                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3678                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3679                    $C$DW$241       .dwtag  DW_TAG_member
    3680                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3681                            .dwattr $C$DW$241, DW_AT_name("triggerType")
    3682                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("triggerType")
    3683                            .dwattr $C$DW$241, DW_AT_bit_offset(0x04)
    3684                            .dwattr $C$DW$241, DW_AT_bit_size(0x04)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   68

    3685                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3686                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3687                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3688                            .dwattr $C$DW$241, DW_AT_decl_line(0x232)
    3689                            .dwattr $C$DW$241, DW_AT_decl_column(0x0f)
    3690                    
    3691                    $C$DW$242       .dwtag  DW_TAG_member
    3692                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3693                            .dwattr $C$DW$242, DW_AT_name("bEnaCmd")
    3694                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("bEnaCmd")
    3695                            .dwattr $C$DW$242, DW_AT_bit_offset(0x03)
    3696                            .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    3697                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3698                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3699                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3700                            .dwattr $C$DW$242, DW_AT_decl_line(0x233)
    3701                            .dwattr $C$DW$242, DW_AT_decl_column(0x0f)
    3702                    
    3703                    $C$DW$243       .dwtag  DW_TAG_member
    3704                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3705                            .dwattr $C$DW$243, DW_AT_name("triggerNo")
    3706                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("triggerNo")
    3707                            .dwattr $C$DW$243, DW_AT_bit_offset(0x01)
    3708                            .dwattr $C$DW$243, DW_AT_bit_size(0x02)
    3709                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3710                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3712                            .dwattr $C$DW$243, DW_AT_decl_line(0x235)
    3713                            .dwattr $C$DW$243, DW_AT_decl_column(0x0f)
    3714                    
    3715                    $C$DW$244       .dwtag  DW_TAG_member
    3716                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3717                            .dwattr $C$DW$244, DW_AT_name("pastTrig")
    3718                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("pastTrig")
    3719                            .dwattr $C$DW$244, DW_AT_bit_offset(0x00)
    3720                            .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    3721                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3722                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3723                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3724                            .dwattr $C$DW$244, DW_AT_decl_line(0x236)
    3725                            .dwattr $C$DW$244, DW_AT_decl_column(0x0f)
    3726                    
    3727                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3728                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x231)
    3729                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    3730                            .dwendtag $C$DW$T$37
    3731                    
    3732                    
    3733                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3734                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3735                    $C$DW$245       .dwtag  DW_TAG_member
    3736                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3737                            .dwattr $C$DW$245, DW_AT_name("rule")
    3738                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("rule")
    3739                            .dwattr $C$DW$245, DW_AT_bit_offset(0x04)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   69

    3740                            .dwattr $C$DW$245, DW_AT_bit_size(0x04)
    3741                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3742                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3743                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3744                            .dwattr $C$DW$245, DW_AT_decl_line(0x23a)
    3745                            .dwattr $C$DW$245, DW_AT_decl_column(0x0f)
    3746                    
    3747                    $C$DW$246       .dwtag  DW_TAG_member
    3748                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3749                            .dwattr $C$DW$246, DW_AT_name("nSkip")
    3750                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("nSkip")
    3751                            .dwattr $C$DW$246, DW_AT_bit_offset(0x00)
    3752                            .dwattr $C$DW$246, DW_AT_bit_size(0x04)
    3753                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3754                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3755                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3756                            .dwattr $C$DW$246, DW_AT_decl_line(0x23b)
    3757                            .dwattr $C$DW$246, DW_AT_decl_column(0x0f)
    3758                    
    3759                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3760                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x239)
    3761                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    3762                            .dwendtag $C$DW$T$38
    3763                    
    3764                    
    3765                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3766                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    3767                    $C$DW$247       .dwtag  DW_TAG_member
    3768                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    3769                            .dwattr $C$DW$247, DW_AT_name("modType")
    3770                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("modType")
    3771                            .dwattr $C$DW$247, DW_AT_bit_offset(0x0d)
    3772                            .dwattr $C$DW$247, DW_AT_bit_size(0x03)
    3773                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3774                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3775                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3776                            .dwattr $C$DW$247, DW_AT_decl_line(0x23e)
    3777                            .dwattr $C$DW$247, DW_AT_decl_column(0x10)
    3778                    
    3779                    $C$DW$248       .dwtag  DW_TAG_member
    3780                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    3781                            .dwattr $C$DW$248, DW_AT_name("deviation")
    3782                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("deviation")
    3783                            .dwattr $C$DW$248, DW_AT_bit_offset(0x00)
    3784                            .dwattr $C$DW$248, DW_AT_bit_size(0x0d)
    3785                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3786                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3787                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3788                            .dwattr $C$DW$248, DW_AT_decl_line(0x241)
    3789                            .dwattr $C$DW$248, DW_AT_decl_column(0x10)
    3790                    
    3791                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3792                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x23d)
    3793                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    3794                            .dwendtag $C$DW$T$39
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   70

    3795                    
    3796                    
    3797                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3798                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    3799                    $C$DW$249       .dwtag  DW_TAG_member
    3800                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$32)
    3801                            .dwattr $C$DW$249, DW_AT_name("preScale")
    3802                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("preScale")
    3803                            .dwattr $C$DW$249, DW_AT_bit_offset(0x1c)
    3804                            .dwattr $C$DW$249, DW_AT_bit_size(0x04)
    3805                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3806                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3807                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3808                            .dwattr $C$DW$249, DW_AT_decl_line(0x244)
    3809                            .dwattr $C$DW$249, DW_AT_decl_column(0x10)
    3810                    
    3811                    $C$DW$250       .dwtag  DW_TAG_member
    3812                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$32)
    3813                            .dwattr $C$DW$250, DW_AT_name("rateWord")
    3814                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("rateWord")
    3815                            .dwattr $C$DW$250, DW_AT_bit_offset(0x03)
    3816                            .dwattr $C$DW$250, DW_AT_bit_size(0x15)
    3817                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3818                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3819                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3820                            .dwattr $C$DW$250, DW_AT_decl_line(0x246)
    3821                            .dwattr $C$DW$250, DW_AT_decl_column(0x10)
    3822                    
    3823                    $C$DW$251       .dwtag  DW_TAG_member
    3824                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$32)
    3825                            .dwattr $C$DW$251, DW_AT_name("decimMode")
    3826                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("decimMode")
    3827                            .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3828                            .dwattr $C$DW$251, DW_AT_bit_size(0x03)
    3829                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3830                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3831                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3832                            .dwattr $C$DW$251, DW_AT_decl_line(0x247)
    3833                            .dwattr $C$DW$251, DW_AT_decl_column(0x10)
    3834                    
    3835                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3836                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x243)
    3837                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    3838                            .dwendtag $C$DW$T$40
    3839                    
    3840                    
    3841                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3842                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3843                    $C$DW$252       .dwtag  DW_TAG_member
    3844                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3845                            .dwattr $C$DW$252, DW_AT_name("nPreamBytes")
    3846                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("nPreamBytes")
    3847                            .dwattr $C$DW$252, DW_AT_bit_offset(0x02)
    3848                            .dwattr $C$DW$252, DW_AT_bit_size(0x06)
    3849                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   71

    3850                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3851                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3852                            .dwattr $C$DW$252, DW_AT_decl_line(0x24f)
    3853                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    3854                    
    3855                    $C$DW$253       .dwtag  DW_TAG_member
    3856                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3857                            .dwattr $C$DW$253, DW_AT_name("preamMode")
    3858                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("preamMode")
    3859                            .dwattr $C$DW$253, DW_AT_bit_offset(0x00)
    3860                            .dwattr $C$DW$253, DW_AT_bit_size(0x02)
    3861                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3862                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3863                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3864                            .dwattr $C$DW$253, DW_AT_decl_line(0x255)
    3865                            .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    3866                    
    3867                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3868                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x24e)
    3869                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    3870                            .dwendtag $C$DW$T$41
    3871                    
    3872                    
    3873                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3874                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3875                    $C$DW$254       .dwtag  DW_TAG_member
    3876                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    3877                            .dwattr $C$DW$254, DW_AT_name("nSwBits")
    3878                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("nSwBits")
    3879                            .dwattr $C$DW$254, DW_AT_bit_offset(0x0a)
    3880                            .dwattr $C$DW$254, DW_AT_bit_size(0x06)
    3881                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3882                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3883                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3884                            .dwattr $C$DW$254, DW_AT_decl_line(0x25b)
    3885                            .dwattr $C$DW$254, DW_AT_decl_column(0x10)
    3886                    
    3887                    $C$DW$255       .dwtag  DW_TAG_member
    3888                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    3889                            .dwattr $C$DW$255, DW_AT_name("bBitReversal")
    3890                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("bBitReversal")
    3891                            .dwattr $C$DW$255, DW_AT_bit_offset(0x09)
    3892                            .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    3893                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3894                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3895                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3896                            .dwattr $C$DW$255, DW_AT_decl_line(0x25c)
    3897                            .dwattr $C$DW$255, DW_AT_decl_column(0x10)
    3898                    
    3899                    $C$DW$256       .dwtag  DW_TAG_member
    3900                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    3901                            .dwattr $C$DW$256, DW_AT_name("bMsbFirst")
    3902                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("bMsbFirst")
    3903                            .dwattr $C$DW$256, DW_AT_bit_offset(0x08)
    3904                            .dwattr $C$DW$256, DW_AT_bit_size(0x01)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   72

    3905                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3906                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3907                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3908                            .dwattr $C$DW$256, DW_AT_decl_line(0x25e)
    3909                            .dwattr $C$DW$256, DW_AT_decl_column(0x10)
    3910                    
    3911                    $C$DW$257       .dwtag  DW_TAG_member
    3912                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    3913                            .dwattr $C$DW$257, DW_AT_name("fecMode")
    3914                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("fecMode")
    3915                            .dwattr $C$DW$257, DW_AT_bit_offset(0x04)
    3916                            .dwattr $C$DW$257, DW_AT_bit_size(0x04)
    3917                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3918                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3919                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3920                            .dwattr $C$DW$257, DW_AT_decl_line(0x260)
    3921                            .dwattr $C$DW$257, DW_AT_decl_column(0x10)
    3922                    
    3923                    $C$DW$258       .dwtag  DW_TAG_member
    3924                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    3925                            .dwattr $C$DW$258, DW_AT_name("whitenMode")
    3926                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("whitenMode")
    3927                            .dwattr $C$DW$258, DW_AT_bit_offset(0x00)
    3928                            .dwattr $C$DW$258, DW_AT_bit_size(0x03)
    3929                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3930                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3931                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3932                            .dwattr $C$DW$258, DW_AT_decl_line(0x266)
    3933                            .dwattr $C$DW$258, DW_AT_decl_column(0x10)
    3934                    
    3935                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3936                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x25a)
    3937                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3938                            .dwendtag $C$DW$T$42
    3939                    
    3940                    
    3941                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3942                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3943                    $C$DW$259       .dwtag  DW_TAG_member
    3944                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    3945                            .dwattr $C$DW$259, DW_AT_name("frontEndMode")
    3946                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("frontEndMode")
    3947                            .dwattr $C$DW$259, DW_AT_bit_offset(0x0d)
    3948                            .dwattr $C$DW$259, DW_AT_bit_size(0x03)
    3949                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3950                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3951                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3952                            .dwattr $C$DW$259, DW_AT_decl_line(0x270)
    3953                            .dwattr $C$DW$259, DW_AT_decl_column(0x10)
    3954                    
    3955                    $C$DW$260       .dwtag  DW_TAG_member
    3956                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    3957                            .dwattr $C$DW$260, DW_AT_name("biasMode")
    3958                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("biasMode")
    3959                            .dwattr $C$DW$260, DW_AT_bit_offset(0x0c)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   73

    3960                            .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    3961                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3962                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3963                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3964                            .dwattr $C$DW$260, DW_AT_decl_line(0x276)
    3965                            .dwattr $C$DW$260, DW_AT_decl_column(0x10)
    3966                    
    3967                    $C$DW$261       .dwtag  DW_TAG_member
    3968                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    3969                            .dwattr $C$DW$261, DW_AT_name("analogCfgMode")
    3970                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("analogCfgMode")
    3971                            .dwattr $C$DW$261, DW_AT_bit_offset(0x06)
    3972                            .dwattr $C$DW$261, DW_AT_bit_size(0x06)
    3973                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3974                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3976                            .dwattr $C$DW$261, DW_AT_decl_line(0x278)
    3977                            .dwattr $C$DW$261, DW_AT_decl_column(0x10)
    3978                    
    3979                    $C$DW$262       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    3981                            .dwattr $C$DW$262, DW_AT_name("bNoFsPowerUp")
    3982                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3983                            .dwattr $C$DW$262, DW_AT_bit_offset(0x05)
    3984                            .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    3985                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3986                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3987                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3988                            .dwattr $C$DW$262, DW_AT_decl_line(0x27f)
    3989                            .dwattr $C$DW$262, DW_AT_decl_column(0x10)
    3990                    
    3991                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3992                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x26f)
    3993                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    3994                            .dwendtag $C$DW$T$43
    3995                    
    3996                    
    3997                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3998                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    3999                    $C$DW$263       .dwtag  DW_TAG_member
    4000                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$32)
    4001                            .dwattr $C$DW$263, DW_AT_name("nInactivityTimeout")
    4002                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("nInactivityTimeout")
    4003                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4004                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4005                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4006                            .dwattr $C$DW$263, DW_AT_decl_line(0x515)
    4007                            .dwattr $C$DW$263, DW_AT_decl_column(0x1d)
    4008                    
    4009                    $C$DW$264       .dwtag  DW_TAG_member
    4010                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$45)
    4011                            .dwattr $C$DW$264, DW_AT_name("pRfMode")
    4012                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("pRfMode")
    4013                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4014                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   74

    4015                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4016                            .dwattr $C$DW$264, DW_AT_decl_line(0x516)
    4017                            .dwattr $C$DW$264, DW_AT_decl_column(0x1d)
    4018                    
    4019                    $C$DW$265       .dwtag  DW_TAG_member
    4020                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$47)
    4021                            .dwattr $C$DW$265, DW_AT_name("pRadioSetup")
    4022                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("pRadioSetup")
    4023                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4024                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4025                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4026                            .dwattr $C$DW$265, DW_AT_decl_line(0x517)
    4027                            .dwattr $C$DW$265, DW_AT_decl_column(0x1d)
    4028                    
    4029                    $C$DW$266       .dwtag  DW_TAG_member
    4030                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$32)
    4031                            .dwattr $C$DW$266, DW_AT_name("nPowerUpDuration")
    4032                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("nPowerUpDuration")
    4033                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4034                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4036                            .dwattr $C$DW$266, DW_AT_decl_line(0x518)
    4037                            .dwattr $C$DW$266, DW_AT_decl_column(0x1d)
    4038                    
    4039                    $C$DW$267       .dwtag  DW_TAG_member
    4040                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$48)
    4041                            .dwattr $C$DW$267, DW_AT_name("bMeasurePowerUpDuration")
    4042                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    4043                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4044                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4045                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4046                            .dwattr $C$DW$267, DW_AT_decl_line(0x519)
    4047                            .dwattr $C$DW$267, DW_AT_decl_column(0x1d)
    4048                    
    4049                    $C$DW$268       .dwtag  DW_TAG_member
    4050                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$48)
    4051                            .dwattr $C$DW$268, DW_AT_name("bUpdateSetup")
    4052                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("bUpdateSetup")
    4053                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4054                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4055                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4056                            .dwattr $C$DW$268, DW_AT_decl_line(0x51a)
    4057                            .dwattr $C$DW$268, DW_AT_decl_column(0x1d)
    4058                    
    4059                    $C$DW$269       .dwtag  DW_TAG_member
    4060                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4061                            .dwattr $C$DW$269, DW_AT_name("nPowerUpDurationMargin")
    4062                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    4063                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4064                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4065                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4066                            .dwattr $C$DW$269, DW_AT_decl_line(0x51b)
    4067                            .dwattr $C$DW$269, DW_AT_decl_column(0x1d)
    4068                    
    4069                    $C$DW$270       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   75

    4070                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$3)
    4071                            .dwattr $C$DW$270, DW_AT_name("pPowerCb")
    4072                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("pPowerCb")
    4073                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4074                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4075                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4076                            .dwattr $C$DW$270, DW_AT_decl_line(0x51c)
    4077                            .dwattr $C$DW$270, DW_AT_decl_column(0x1d)
    4078                    
    4079                    $C$DW$271       .dwtag  DW_TAG_member
    4080                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$3)
    4081                            .dwattr $C$DW$271, DW_AT_name("pErrCb")
    4082                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("pErrCb")
    4083                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4084                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4085                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4086                            .dwattr $C$DW$271, DW_AT_decl_line(0x51d)
    4087                            .dwattr $C$DW$271, DW_AT_decl_column(0x1d)
    4088                    
    4089                    $C$DW$272       .dwtag  DW_TAG_member
    4090                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$3)
    4091                            .dwattr $C$DW$272, DW_AT_name("pClientEventCb")
    4092                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("pClientEventCb")
    4093                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4094                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4095                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4096                            .dwattr $C$DW$272, DW_AT_decl_line(0x51e)
    4097                            .dwattr $C$DW$272, DW_AT_decl_column(0x1d)
    4098                    
    4099                    $C$DW$273       .dwtag  DW_TAG_member
    4100                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$49)
    4101                            .dwattr $C$DW$273, DW_AT_name("nClientEventMask")
    4102                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("nClientEventMask")
    4103                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4104                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4105                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4106                            .dwattr $C$DW$273, DW_AT_decl_line(0x51f)
    4107                            .dwattr $C$DW$273, DW_AT_decl_column(0x1d)
    4108                    
    4109                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4110                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x514)
    4111                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0c)
    4112                            .dwendtag $C$DW$T$50
    4113                    
    4114                    
    4115                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4116                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    4117                    $C$DW$274       .dwtag  DW_TAG_member
    4118                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    4119                            .dwattr $C$DW$274, DW_AT_name("triggerType")
    4120                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("triggerType")
    4121                            .dwattr $C$DW$274, DW_AT_bit_offset(0x04)
    4122                            .dwattr $C$DW$274, DW_AT_bit_size(0x04)
    4123                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4124                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:46 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{C748BFA0-C7CE-432C-BD19-98343D91BE3F} PAGE   76

    4125                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4126                            .dwattr $C$DW$274, DW_AT_decl_line(0xee)
    4127                            .dwattr $C$DW$274, DW_AT_decl_column(0x0f)
    4128                    
    4129                    $C$DW$275       .dwtag  DW_TAG_member
    4130                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    4131                            .dwattr $C$DW$275, DW_AT_name("bEnaCmd")
    4132                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("bEnaCmd")
    4133                            .dwattr $C$DW$275, DW_AT_bit_offset(0x03)
    4134                            .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    4135                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4136                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4137                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4138                            .dwattr $C$DW$275, DW_AT_decl_line(0xef)
    4139                            .dwattr $C$DW$275, DW_AT_decl_column(0x0f)
    4140                    
    4141                    $C$DW$276       .dwtag  DW_TAG_member
    4142                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    4143                            .dwattr $C$DW$276, DW_AT_name("triggerNo")
    4144                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("triggerNo")
    4145                            .dwattr $C$DW$276, DW_AT_bit_offset(0x01)
    4146                            .dwattr $C$DW$276, DW_AT_bit_size(0x02)
    4147                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4148                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4149                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4150                            .dwattr $C$DW$276, DW_AT_decl_line(0xf1)
    4151                            .dwattr $C$DW$276, DW_AT_decl_column(0x0f)
    4152                    
    4153                    $C$DW$277       .dwtag  DW_TAG_member
    4154                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    4155                            .dwattr $C$DW$277, DW_AT_name("pastTrig")
    4156                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pastTrig")
    4157                            .dwattr $C$DW$277, DW_AT_bit_offset(0x00)
    4158                            .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    4159                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4160                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4161                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4162                            .dwattr $C$DW$277, DW_AT_decl_line(0xf2)
    4163                            .dwattr $C$DW$277, DW_AT_decl_column(0x0f)
    4164                    
    4165                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4166                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xed)
    4167                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    4168                            .dwendtag $C$DW$T$51
    4169                    
    4170                    
    4171                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4172                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    4173                    $C$DW$278       .dwtag  DW_TAG_member
    4174                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    4175                            .dwattr $C$DW$278, DW_AT_name("rule")
    4176                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("rule")
