TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 16:40:45 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/ICall/icall_cc2650.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1671                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1672                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1673                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1674                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1675                    
    1676                    ;******************************************************************************
    1677                    ;* TYPE INFORMATION                                                           *
    1678                    ;******************************************************************************
    1679                    
    1680                    $C$DW$T$152     .dwtag  DW_TAG_enumeration_type
    1681                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x01)
    1682                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1683                            .dwattr $C$DW$113, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1684                            .dwattr $C$DW$113, DW_AT_const_value(0xe0)
    1685                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1686                            .dwattr $C$DW$113, DW_AT_decl_line(0x3de)
    1687                            .dwattr $C$DW$113, DW_AT_decl_column(0x04)
    1688                    
    1689                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1690                            .dwattr $C$DW$114, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1691                            .dwattr $C$DW$114, DW_AT_const_value(0xe1)
    1692                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1693                            .dwattr $C$DW$114, DW_AT_decl_line(0x3e0)
    1694                            .dwattr $C$DW$114, DW_AT_decl_column(0x04)
    1695                    
    1696                    $C$DW$115       .dwtag  DW_TAG_enumerator
    1697                            .dwattr $C$DW$115, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1698                            .dwattr $C$DW$115, DW_AT_const_value(0xe2)
    1699                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1700                            .dwattr $C$DW$115, DW_AT_decl_line(0x3e2)
    1701                            .dwattr $C$DW$115, DW_AT_decl_column(0x04)
    1702                    
    1703                    $C$DW$116       .dwtag  DW_TAG_enumerator
    1704                            .dwattr $C$DW$116, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1705                            .dwattr $C$DW$116, DW_AT_const_value(0xe3)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   32

    1706                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1707                            .dwattr $C$DW$116, DW_AT_decl_line(0x3e4)
    1708                            .dwattr $C$DW$116, DW_AT_decl_column(0x04)
    1709                    
    1710                    $C$DW$117       .dwtag  DW_TAG_enumerator
    1711                            .dwattr $C$DW$117, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1712                            .dwattr $C$DW$117, DW_AT_const_value(0xe4)
    1713                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1714                            .dwattr $C$DW$117, DW_AT_decl_line(0x3e6)
    1715                            .dwattr $C$DW$117, DW_AT_decl_column(0x04)
    1716                    
    1717                    $C$DW$118       .dwtag  DW_TAG_enumerator
    1718                            .dwattr $C$DW$118, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1719                            .dwattr $C$DW$118, DW_AT_const_value(0xe5)
    1720                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1721                            .dwattr $C$DW$118, DW_AT_decl_line(0x3e8)
    1722                            .dwattr $C$DW$118, DW_AT_decl_column(0x04)
    1723                    
    1724                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1725                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3dc)
    1726                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    1727                            .dwendtag $C$DW$T$152
    1728                    
    1729                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1730                            .dwattr $C$DW$T$153, DW_AT_name("ICall_RemotiCmdEvent_t")
    1731                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    1732                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1733                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1734                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x3e9)
    1735                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x02)
    1736                    
    1737                    
    1738                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1739                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    1740                    $C$DW$119       .dwtag  DW_TAG_member
    1741                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$10)
    1742                            .dwattr $C$DW$119, DW_AT_name("quot")
    1743                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("quot")
    1744                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1746                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    1747                            .dwattr $C$DW$119, DW_AT_decl_line(0x5c)
    1748                            .dwattr $C$DW$119, DW_AT_decl_column(0x16)
    1749                    
    1750                    $C$DW$120       .dwtag  DW_TAG_member
    1751                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$10)
    1752                            .dwattr $C$DW$120, DW_AT_name("rem")
    1753                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rem")
    1754                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1755                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1756                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    1757                            .dwattr $C$DW$120, DW_AT_decl_line(0x5c)
    1758                            .dwattr $C$DW$120, DW_AT_decl_column(0x1c)
    1759                    
    1760                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   33

    1761                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x5c)
    1762                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1763                            .dwendtag $C$DW$T$19
    1764                    
    1765                    $C$DW$T$154     .dwtag  DW_TAG_typedef
    1766                            .dwattr $C$DW$T$154, DW_AT_name("div_t")
    1767                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$19)
    1768                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    1769                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1770                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x5c)
    1771                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x23)
    1772                    
    1773                    
    1774                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1775                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    1776                    $C$DW$121       .dwtag  DW_TAG_member
    1777                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$10)
    1778                            .dwattr $C$DW$121, DW_AT_name("quot")
    1779                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("quot")
    1780                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1782                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    1783                            .dwattr $C$DW$121, DW_AT_decl_line(0x5e)
    1784                            .dwattr $C$DW$121, DW_AT_decl_column(0x16)
    1785                    
    1786                    $C$DW$122       .dwtag  DW_TAG_member
    1787                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$10)
    1788                            .dwattr $C$DW$122, DW_AT_name("rem")
    1789                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rem")
    1790                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1791                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1792                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    1793                            .dwattr $C$DW$122, DW_AT_decl_line(0x5e)
    1794                            .dwattr $C$DW$122, DW_AT_decl_column(0x1c)
    1795                    
    1796                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    1797                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5e)
    1798                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1799                            .dwendtag $C$DW$T$20
    1800                    
    1801                    $C$DW$T$155     .dwtag  DW_TAG_typedef
    1802                            .dwattr $C$DW$T$155, DW_AT_name("ldiv_t")
    1803                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$20)
    1804                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    1805                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1806                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x5e)
    1807                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x23)
    1808                    
    1809                    
    1810                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1811                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1812                    $C$DW$123       .dwtag  DW_TAG_member
    1813                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$14)
    1814                            .dwattr $C$DW$123, DW_AT_name("quot")
    1815                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("quot")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   34

    1816                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1818                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    1819                            .dwattr $C$DW$123, DW_AT_decl_line(0x61)
    1820                            .dwattr $C$DW$123, DW_AT_decl_column(0x1c)
    1821                    
    1822                    $C$DW$124       .dwtag  DW_TAG_member
    1823                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$14)
    1824                            .dwattr $C$DW$124, DW_AT_name("rem")
    1825                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rem")
    1826                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1827                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1828                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    1829                            .dwattr $C$DW$124, DW_AT_decl_line(0x61)
    1830                            .dwattr $C$DW$124, DW_AT_decl_column(0x22)
    1831                    
    1832                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    1833                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x61)
    1834                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1835                            .dwendtag $C$DW$T$21
    1836                    
    1837                    $C$DW$T$156     .dwtag  DW_TAG_typedef
    1838                            .dwattr $C$DW$T$156, DW_AT_name("lldiv_t")
    1839                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$21)
    1840                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    1841                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1842                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x61)
    1843                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x29)
    1844                    
    1845                    
    1846                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1847                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1848                    $C$DW$125       .dwtag  DW_TAG_member
    1849                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$24)
    1850                            .dwattr $C$DW$125, DW_AT_name("pointerStack")
    1851                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pointerStack")
    1852                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1854                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1855                            .dwattr $C$DW$125, DW_AT_decl_line(0x3f5)
    1856                            .dwattr $C$DW$125, DW_AT_decl_column(0x16)
    1857                    
    1858                    $C$DW$126       .dwtag  DW_TAG_member
    1859                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1860                            .dwattr $C$DW$126, DW_AT_name("directAPI")
    1861                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("directAPI")
    1862                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1863                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1864                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1865                            .dwattr $C$DW$126, DW_AT_decl_line(0x3f6)
    1866                            .dwattr $C$DW$126, DW_AT_decl_column(0x15)
    1867                    
    1868                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1869                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3f4)
    1870                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   35

    1871                            .dwendtag $C$DW$T$26
    1872                    
    1873                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    1874                            .dwattr $C$DW$T$28, DW_AT_name("icall_directAPIMsg_t")
    1875                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    1876                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1877                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1878                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f7)
    1879                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1880                    
    1881                    
    1882                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1883                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
    1884                    $C$DW$127       .dwtag  DW_TAG_member
    1885                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    1886                            .dwattr $C$DW$127, DW_AT_name("hdr")
    1887                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("hdr")
    1888                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1890                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1891                            .dwattr $C$DW$127, DW_AT_decl_line(0x3fb)
    1892                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    1893                    
    1894                    $C$DW$128       .dwtag  DW_TAG_member
    1895                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
    1896                            .dwattr $C$DW$128, DW_AT_name("msg")
    1897                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("msg")
    1898                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1899                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1900                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1901                            .dwattr $C$DW$128, DW_AT_decl_line(0x3fc)
    1902                            .dwattr $C$DW$128, DW_AT_decl_column(0x1a)
    1903                    
    1904                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1905                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3fa)
    1906                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1907                            .dwendtag $C$DW$T$29
    1908                    
    1909                    $C$DW$T$157     .dwtag  DW_TAG_typedef
    1910                            .dwattr $C$DW$T$157, DW_AT_name("icallLiteMsg_t")
    1911                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$29)
    1912                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    1913                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1914                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3fd)
    1915                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x03)
    1916                    
    1917                    
    1918                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    1919                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1920                    $C$DW$129       .dwtag  DW_TAG_member
    1921                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1922                            .dwattr $C$DW$129, DW_AT_name("entityId")
    1923                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    1924                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   36

    1926                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1927                            .dwattr $C$DW$129, DW_AT_decl_line(0x1fe)
    1928                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    1929                    
    1930                    $C$DW$130       .dwtag  DW_TAG_member
    1931                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$35)
    1932                            .dwattr $C$DW$130, DW_AT_name("servId")
    1933                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("servId")
    1934                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1936                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1937                            .dwattr $C$DW$130, DW_AT_decl_line(0x200)
    1938                            .dwattr $C$DW$130, DW_AT_decl_column(0x17)
    1939                    
    1940                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1941                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1fc)
    1942                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1943                            .dwendtag $C$DW$T$36
    1944                    
    1945                    
    1946                    $C$DW$T$37      .dwtag  DW_TAG_union_type
    1947                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1948                    $C$DW$131       .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$35)
    1950                            .dwattr $C$DW$131, DW_AT_name("servId")
    1951                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("servId")
    1952                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1955                            .dwattr $C$DW$131, DW_AT_decl_line(0x211)
    1956                            .dwattr $C$DW$131, DW_AT_decl_column(0x17)
    1957                    
    1958                    $C$DW$132       .dwtag  DW_TAG_member
    1959                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1960                            .dwattr $C$DW$132, DW_AT_name("entityId")
    1961                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("entityId")
    1962                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1964                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1965                            .dwattr $C$DW$132, DW_AT_decl_line(0x213)
    1966                            .dwattr $C$DW$132, DW_AT_decl_column(0x14)
    1967                    
    1968                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1969                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x20f)
    1970                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1971                            .dwendtag $C$DW$T$37
    1972                    
    1973                    
    1974                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1975                            .dwattr $C$DW$T$38, DW_AT_name(".ggroup1")
    1976                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    1977                    $C$DW$133       .dwtag  DW_TAG_member
    1978                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$6)
    1979                            .dwattr $C$DW$133, DW_AT_name("ICallPlatform_pwrActivityCount")
    1980                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ICallPlatform_pwrActivityCount")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   37

    1981                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1983                    
    1984                    $C$DW$134       .dwtag  DW_TAG_member
    1985                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1986                            .dwattr $C$DW$134, DW_AT_name("ICallPlatform_pwrCfgACAction")
    1987                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ICallPlatform_pwrCfgACAction")
    1988                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1989                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1990                    
    1991                            .dwendtag $C$DW$T$38
    1992                    
    1993                    
    1994                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1995                            .dwattr $C$DW$T$39, DW_AT_name("ClockP_FreqHz")
    1996                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1997                    $C$DW$135       .dwtag  DW_TAG_member
    1998                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
    1999                            .dwattr $C$DW$135, DW_AT_name("hi")
    2000                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("hi")
    2001                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2003                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2004                            .dwattr $C$DW$135, DW_AT_decl_line(0x5c)
    2005                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2006                    
    2007                    $C$DW$136       .dwtag  DW_TAG_member
    2008                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2009                            .dwattr $C$DW$136, DW_AT_name("lo")
    2010                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("lo")
    2011                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2012                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2013                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2014                            .dwattr $C$DW$136, DW_AT_decl_line(0x5d)
    2015                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2016                    
    2017                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2018                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x5b)
    2019                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    2020                            .dwendtag $C$DW$T$39
    2021                    
    2022                    $C$DW$T$159     .dwtag  DW_TAG_typedef
    2023                            .dwattr $C$DW$T$159, DW_AT_name("ClockP_FreqHz")
    2024                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$39)
    2025                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    2026                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2027                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x5e)
    2028                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x03)
    2029                    
    2030                    
    2031                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2032                            .dwattr $C$DW$T$42, DW_AT_name("ClockP_Params")
    2033                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    2034                    $C$DW$137       .dwtag  DW_TAG_member
    2035                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$40)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   38

    2036                            .dwattr $C$DW$137, DW_AT_name("startFlag")
    2037                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("startFlag")
    2038                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2040                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2041                            .dwattr $C$DW$137, DW_AT_decl_line(0x8d)
    2042                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2043                    
    2044                    $C$DW$138       .dwtag  DW_TAG_member
    2045                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    2046                            .dwattr $C$DW$138, DW_AT_name("period")
    2047                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("period")
    2048                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2049                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2050                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2051                            .dwattr $C$DW$138, DW_AT_decl_line(0x8e)
    2052                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2053                    
    2054                    $C$DW$139       .dwtag  DW_TAG_member
    2055                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$41)
    2056                            .dwattr $C$DW$139, DW_AT_name("arg")
    2057                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("arg")
    2058                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2059                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2060                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2061                            .dwattr $C$DW$139, DW_AT_decl_line(0x8f)
    2062                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2063                    
    2064                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2065                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x8c)
    2066                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2067                            .dwendtag $C$DW$T$42
    2068                    
    2069                    $C$DW$T$160     .dwtag  DW_TAG_typedef
    2070                            .dwattr $C$DW$T$160, DW_AT_name("ClockP_Params")
    2071                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$42)
    2072                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    2073                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2074                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x90)
    2075                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x03)
    2076                    
    2077                    
    2078                    $C$DW$T$161     .dwtag  DW_TAG_enumeration_type
    2079                            .dwattr $C$DW$T$161, DW_AT_name("ClockP_Status")
    2080                            .dwattr $C$DW$T$161, DW_AT_byte_size(0x01)
    2081                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2082                            .dwattr $C$DW$140, DW_AT_name("ClockP_OK")
    2083                            .dwattr $C$DW$140, DW_AT_const_value(0x00)
    2084                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2085                            .dwattr $C$DW$140, DW_AT_decl_line(0x64)
    2086                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2087                    
    2088                    $C$DW$141       .dwtag  DW_TAG_enumerator
    2089                            .dwattr $C$DW$141, DW_AT_name("ClockP_FAILURE")
    2090                            .dwattr $C$DW$141, DW_AT_const_value(-1)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   39

    2091                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2092                            .dwattr $C$DW$141, DW_AT_decl_line(0x65)
    2093                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2094                    
    2095                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2096                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x63)
    2097                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x0e)
    2098                            .dwendtag $C$DW$T$161
    2099                    
    2100                    $C$DW$T$162     .dwtag  DW_TAG_typedef
    2101                            .dwattr $C$DW$T$162, DW_AT_name("ClockP_Status")
    2102                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    2103                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    2104                            .dwattr $C$DW$T$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2105                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x66)
    2106                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x03)
    2107                    
    2108                    
    2109                    $C$DW$T$45      .dwtag  DW_TAG_union_type
    2110                            .dwattr $C$DW$T$45, DW_AT_name("ClockP_Struct")
    2111                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x24)
    2112                    $C$DW$142       .dwtag  DW_TAG_member
    2113                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    2114                            .dwattr $C$DW$142, DW_AT_name("dummy")
    2115                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("dummy")
    2116                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2118                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2119                            .dwattr $C$DW$142, DW_AT_decl_line(0x54)
    2120                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2121                    
    2122                    $C$DW$143       .dwtag  DW_TAG_member
    2123                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$44)
    2124                            .dwattr $C$DW$143, DW_AT_name("data")
    2125                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("data")
    2126                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2128                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2129                            .dwattr $C$DW$143, DW_AT_decl_line(0x55)
    2130                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2131                    
    2132                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2133                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x53)
    2134                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0f)
    2135                            .dwendtag $C$DW$T$45
    2136                    
    2137                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2138                            .dwattr $C$DW$T$62, DW_AT_name("ClockP_Struct")
    2139                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$45)
    2140                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2141                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2142                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x56)
    2143                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2144                    
    2145                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   40

    2146                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2147                            .dwattr $C$DW$T$46, DW_AT_name("HwiP_Params")
    2148                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    2149                    $C$DW$144       .dwtag  DW_TAG_member
    2150                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$41)
    2151                            .dwattr $C$DW$144, DW_AT_name("arg")
    2152                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("arg")
    2153                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2155                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2156                            .dwattr $C$DW$144, DW_AT_decl_line(0x72)
    2157                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    2158                    
    2159                    $C$DW$145       .dwtag  DW_TAG_member
    2160                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2161                            .dwattr $C$DW$145, DW_AT_name("priority")
    2162                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("priority")
    2163                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2164                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2165                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2166                            .dwattr $C$DW$145, DW_AT_decl_line(0x73)
    2167                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    2168                    
    2169                    $C$DW$146       .dwtag  DW_TAG_member
    2170                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$40)
    2171                            .dwattr $C$DW$146, DW_AT_name("enableInt")
    2172                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("enableInt")
    2173                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2174                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2175                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2176                            .dwattr $C$DW$146, DW_AT_decl_line(0x74)
    2177                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2178                    
    2179                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2180                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x71)
    2181                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2182                            .dwendtag $C$DW$T$46
    2183                    
    2184                    $C$DW$T$163     .dwtag  DW_TAG_typedef
    2185                            .dwattr $C$DW$T$163, DW_AT_name("HwiP_Params")
    2186                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$46)
    2187                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    2188                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2189                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x75)
    2190                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x03)
    2191                    
    2192                    
    2193                    $C$DW$T$164     .dwtag  DW_TAG_enumeration_type
    2194                            .dwattr $C$DW$T$164, DW_AT_name("HwiP_Status")
    2195                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x01)
    2196                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2197                            .dwattr $C$DW$147, DW_AT_name("HwiP_OK")
    2198                            .dwattr $C$DW$147, DW_AT_const_value(0x00)
    2199                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2200                            .dwattr $C$DW$147, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   41

    2201                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2202                    
    2203                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2204                            .dwattr $C$DW$148, DW_AT_name("HwiP_FAILURE")
    2205                            .dwattr $C$DW$148, DW_AT_const_value(-1)
    2206                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2207                            .dwattr $C$DW$148, DW_AT_decl_line(0x5d)
    2208                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2209                    
    2210                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2211                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x5b)
    2212                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x0e)
    2213                            .dwendtag $C$DW$T$164
    2214                    
    2215                    $C$DW$T$165     .dwtag  DW_TAG_typedef
    2216                            .dwattr $C$DW$T$165, DW_AT_name("HwiP_Status")
    2217                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    2218                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    2219                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2220                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x5e)
    2221                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x03)
    2222                    
    2223                    
    2224                    $C$DW$T$48      .dwtag  DW_TAG_union_type
    2225                            .dwattr $C$DW$T$48, DW_AT_name("HwiP_Struct")
    2226                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x1c)
    2227                    $C$DW$149       .dwtag  DW_TAG_member
    2228                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$22)
    2229                            .dwattr $C$DW$149, DW_AT_name("dummy")
    2230                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("dummy")
    2231                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2232                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2233                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2234                            .dwattr $C$DW$149, DW_AT_decl_line(0x4d)
    2235                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2236                    
    2237                    $C$DW$150       .dwtag  DW_TAG_member
    2238                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$47)
    2239                            .dwattr $C$DW$150, DW_AT_name("data")
    2240                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("data")
    2241                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2243                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2244                            .dwattr $C$DW$150, DW_AT_decl_line(0x4e)
    2245                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2246                    
    2247                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2248                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x4c)
    2249                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0f)
    2250                            .dwendtag $C$DW$T$48
    2251                    
    2252                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    2253                            .dwattr $C$DW$T$63, DW_AT_name("HwiP_Struct")
    2254                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$48)
    2255                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   42

    2256                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2257                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x4f)
    2258                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2259                    
    2260                    
    2261                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2262                            .dwattr $C$DW$T$50, DW_AT_name("List_Elem")
    2263                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    2264                    $C$DW$151       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$49)
    2266                            .dwattr $C$DW$151, DW_AT_name("next")
    2267                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("next")
    2268                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2271                            .dwattr $C$DW$151, DW_AT_decl_line(0x7f)
    2272                            .dwattr $C$DW$151, DW_AT_decl_column(0x17)
    2273                    
    2274                    $C$DW$152       .dwtag  DW_TAG_member
    2275                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$49)
    2276                            .dwattr $C$DW$152, DW_AT_name("prev")
    2277                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("prev")
    2278                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2279                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2280                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2281                            .dwattr $C$DW$152, DW_AT_decl_line(0x80)
    2282                            .dwattr $C$DW$152, DW_AT_decl_column(0x17)
    2283                    
    2284                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2285                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x7e)
    2286                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    2287                            .dwendtag $C$DW$T$50
    2288                    
    2289                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    2290                            .dwattr $C$DW$T$51, DW_AT_name("List_Elem")
    2291                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2292                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2293                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2294                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x81)
    2295                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2296                    
    2297                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2298                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2299                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2300                    
    2301                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    2302                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$50)
    2303                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    2304                    
    2305                    
    2306                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2307                            .dwattr $C$DW$T$53, DW_AT_name("List_List")
    2308                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    2309                    $C$DW$153       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$52)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   43

    2311                            .dwattr $C$DW$153, DW_AT_name("head")
    2312                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("head")
    2313                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2316                            .dwattr $C$DW$153, DW_AT_decl_line(0x84)
    2317                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    2318                    
    2319                    $C$DW$154       .dwtag  DW_TAG_member
    2320                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$52)
    2321                            .dwattr $C$DW$154, DW_AT_name("tail")
    2322                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("tail")
    2323                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2324                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2325                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2326                            .dwattr $C$DW$154, DW_AT_decl_line(0x85)
    2327                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2328                    
    2329                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2330                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x83)
    2331                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    2332                            .dwendtag $C$DW$T$53
    2333                    
    2334                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2335                            .dwattr $C$DW$T$61, DW_AT_name("List_List")
    2336                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$53)
    2337                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2338                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2339                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x86)
    2340                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2341                    
    2342                    
    2343                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2344                            .dwattr $C$DW$T$60, DW_AT_name("PowerCC26XX_Config")
    2345                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x18)
    2346                    $C$DW$155       .dwtag  DW_TAG_member
    2347                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$56)
    2348                            .dwattr $C$DW$155, DW_AT_name("policyInitFxn")
    2349                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("policyInitFxn")
    2350                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2352                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2353                            .dwattr $C$DW$155, DW_AT_decl_line(0x150)
    2354                            .dwattr $C$DW$155, DW_AT_decl_column(0x19)
    2355                    
    2356                    $C$DW$156       .dwtag  DW_TAG_member
    2357                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$57)
    2358                            .dwattr $C$DW$156, DW_AT_name("policyFxn")
    2359                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("policyFxn")
    2360                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2361                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2362                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2363                            .dwattr $C$DW$156, DW_AT_decl_line(0x166)
    2364                            .dwattr $C$DW$156, DW_AT_decl_column(0x15)
    2365                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   44

    2366                    $C$DW$157       .dwtag  DW_TAG_member
    2367                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$59)
    2368                            .dwattr $C$DW$157, DW_AT_name("calibrateFxn")
    2369                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("calibrateFxn")
    2370                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2371                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2372                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2373                            .dwattr $C$DW$157, DW_AT_decl_line(0x172)
    2374                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2375                    
    2376                    $C$DW$158       .dwtag  DW_TAG_member
    2377                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    2378                            .dwattr $C$DW$158, DW_AT_name("maxStandbyDuration")
    2379                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("maxStandbyDuration")
    2380                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2381                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2382                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2383                            .dwattr $C$DW$158, DW_AT_decl_line(0x18d)
    2384                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2385                    
    2386                    $C$DW$159       .dwtag  DW_TAG_member
    2387                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$33)
    2388                            .dwattr $C$DW$159, DW_AT_name("vddrRechargeMargin")
    2389                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("vddrRechargeMargin")
    2390                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2391                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2392                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2393                            .dwattr $C$DW$159, DW_AT_decl_line(0x19e)
    2394                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2395                    
    2396                    $C$DW$160       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    2398                            .dwattr $C$DW$160, DW_AT_name("enableMaxStandbyDuration")
    2399                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("enableMaxStandbyDuration")
    2400                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2401                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2402                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2403                            .dwattr $C$DW$160, DW_AT_decl_line(0x1ab)
    2404                            .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2405                    
    2406                    $C$DW$161       .dwtag  DW_TAG_member
    2407                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$40)
    2408                            .dwattr $C$DW$161, DW_AT_name("enablePolicy")
    2409                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("enablePolicy")
    2410                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2411                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2412                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2413                            .dwattr $C$DW$161, DW_AT_decl_line(0x1b8)
    2414                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2415                    
    2416                    $C$DW$162       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    2418                            .dwattr $C$DW$162, DW_AT_name("calibrateRCOSC_LF")
    2419                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("calibrateRCOSC_LF")
    2420                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   45

    2421                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2423                            .dwattr $C$DW$162, DW_AT_decl_line(0x1c1)
    2424                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2425                    
    2426                    $C$DW$163       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    2428                            .dwattr $C$DW$163, DW_AT_name("calibrateRCOSC_HF")
    2429                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("calibrateRCOSC_HF")
    2430                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2431                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2433                            .dwattr $C$DW$163, DW_AT_decl_line(0x1ca)
    2434                            .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2435                    
    2436                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2437                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x149)
    2438                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x10)
    2439                            .dwendtag $C$DW$T$60
    2440                    
    2441                    $C$DW$T$166     .dwtag  DW_TAG_typedef
    2442                            .dwattr $C$DW$T$166, DW_AT_name("PowerCC26XX_Config")
    2443                            .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$60)
    2444                            .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    2445                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2446                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x1cb)
    2447                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x03)
    2448                    
    2449                    
    2450                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    2451                            .dwattr $C$DW$T$70, DW_AT_name("PowerCC26XX_ModuleState")
    2452                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x114)
    2453                    $C$DW$164       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$61)
    2455                            .dwattr $C$DW$164, DW_AT_name("notifyList")
    2456                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("notifyList")
    2457                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2458                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2460                            .dwattr $C$DW$164, DW_AT_decl_line(0x1d4)
    2461                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2462                    
    2463                    $C$DW$165       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    2465                            .dwattr $C$DW$165, DW_AT_name("constraintMask")
    2466                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("constraintMask")
    2467                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2468                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2470                            .dwattr $C$DW$165, DW_AT_decl_line(0x1d5)
    2471                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2472                    
    2473                    $C$DW$166       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$62)
    2475                            .dwattr $C$DW$166, DW_AT_name("clockObj")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   46

    2476                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockObj")
    2477                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2478                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2480                            .dwattr $C$DW$166, DW_AT_decl_line(0x1d6)
    2481                            .dwattr $C$DW$166, DW_AT_decl_column(0x13)
    2482                    
    2483                    $C$DW$167       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$62)
    2485                            .dwattr $C$DW$167, DW_AT_name("xoscClockObj")
    2486                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xoscClockObj")
    2487                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2488                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2490                            .dwattr $C$DW$167, DW_AT_decl_line(0x1d7)
    2491                            .dwattr $C$DW$167, DW_AT_decl_column(0x13)
    2492                    
    2493                    $C$DW$168       .dwtag  DW_TAG_member
    2494                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$62)
    2495                            .dwattr $C$DW$168, DW_AT_name("lfClockObj")
    2496                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("lfClockObj")
    2497                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2498                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2499                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2500                            .dwattr $C$DW$168, DW_AT_decl_line(0x1d8)
    2501                            .dwattr $C$DW$168, DW_AT_decl_column(0x13)
    2502                    
    2503                    $C$DW$169       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$62)
    2505                            .dwattr $C$DW$169, DW_AT_name("calClockStruct")
    2506                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("calClockStruct")
    2507                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2508                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2510                            .dwattr $C$DW$169, DW_AT_decl_line(0x1d9)
    2511                            .dwattr $C$DW$169, DW_AT_decl_column(0x13)
    2512                    
    2513                    $C$DW$170       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$63)
    2515                            .dwattr $C$DW$170, DW_AT_name("hwiStruct")
    2516                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("hwiStruct")
    2517                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2518                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2520                            .dwattr $C$DW$170, DW_AT_decl_line(0x1da)
    2521                            .dwattr $C$DW$170, DW_AT_decl_column(0x11)
    2522                    
    2523                    $C$DW$171       .dwtag  DW_TAG_member
    2524                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$64)
    2525                            .dwattr $C$DW$171, DW_AT_name("nDeltaFreqCurr")
    2526                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nDeltaFreqCurr")
    2527                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2528                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2529                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2530                            .dwattr $C$DW$171, DW_AT_decl_line(0x1db)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   47

    2531                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2532                    
    2533                    $C$DW$172       .dwtag  DW_TAG_member
    2534                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$64)
    2535                            .dwattr $C$DW$172, DW_AT_name("nCtrimCurr")
    2536                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("nCtrimCurr")
    2537                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2538                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2539                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2540                            .dwattr $C$DW$172, DW_AT_decl_line(0x1dc)
    2541                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2542                    
    2543                    $C$DW$173       .dwtag  DW_TAG_member
    2544                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$64)
    2545                            .dwattr $C$DW$173, DW_AT_name("nCtrimFractCurr")
    2546                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("nCtrimFractCurr")
    2547                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2548                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2549                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2550                            .dwattr $C$DW$173, DW_AT_decl_line(0x1dd)
    2551                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2552                    
    2553                    $C$DW$174       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$64)
    2555                            .dwattr $C$DW$174, DW_AT_name("nCtrimNew")
    2556                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("nCtrimNew")
    2557                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2558                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2560                            .dwattr $C$DW$174, DW_AT_decl_line(0x1de)
    2561                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2562                    
    2563                    $C$DW$175       .dwtag  DW_TAG_member
    2564                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$64)
    2565                            .dwattr $C$DW$175, DW_AT_name("nCtrimFractNew")
    2566                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("nCtrimFractNew")
    2567                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2568                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2569                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2570                            .dwattr $C$DW$175, DW_AT_decl_line(0x1df)
    2571                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2572                    
    2573                    $C$DW$176       .dwtag  DW_TAG_member
    2574                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$64)
    2575                            .dwattr $C$DW$176, DW_AT_name("nRtrimNew")
    2576                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nRtrimNew")
    2577                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2578                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2579                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2580                            .dwattr $C$DW$176, DW_AT_decl_line(0x1e0)
    2581                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2582                    
    2583                    $C$DW$177       .dwtag  DW_TAG_member
    2584                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$64)
    2585                            .dwattr $C$DW$177, DW_AT_name("nRtrimCurr")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   48

    2586                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nRtrimCurr")
    2587                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2588                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2589                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2590                            .dwattr $C$DW$177, DW_AT_decl_line(0x1e1)
    2591                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2592                    
    2593                    $C$DW$178       .dwtag  DW_TAG_member
    2594                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$64)
    2595                            .dwattr $C$DW$178, DW_AT_name("nDeltaFreqNew")
    2596                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("nDeltaFreqNew")
    2597                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2598                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2599                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2600                            .dwattr $C$DW$178, DW_AT_decl_line(0x1e2)
    2601                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    2602                    
    2603                    $C$DW$179       .dwtag  DW_TAG_member
    2604                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    2605                            .dwattr $C$DW$179, DW_AT_name("bRefine")
    2606                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bRefine")
    2607                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2608                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2609                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2610                            .dwattr $C$DW$179, DW_AT_decl_line(0x1e3)
    2611                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2612                    
    2613                    $C$DW$180       .dwtag  DW_TAG_member
    2614                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    2615                            .dwattr $C$DW$180, DW_AT_name("state")
    2616                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("state")
    2617                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2618                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2619                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2620                            .dwattr $C$DW$180, DW_AT_decl_line(0x1e4)
    2621                            .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2622                    
    2623                    $C$DW$181       .dwtag  DW_TAG_member
    2624                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    2625                            .dwattr $C$DW$181, DW_AT_name("xoscPending")
    2626                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("xoscPending")
    2627                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2628                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2629                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2630                            .dwattr $C$DW$181, DW_AT_decl_line(0x1e5)
    2631                            .dwattr $C$DW$181, DW_AT_decl_column(0x0a)
    2632                    
    2633                    $C$DW$182       .dwtag  DW_TAG_member
    2634                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    2635                            .dwattr $C$DW$182, DW_AT_name("calLF")
    2636                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("calLF")
    2637                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe1]
    2638                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2639                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2640                            .dwattr $C$DW$182, DW_AT_decl_line(0x1e6)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   49

    2641                            .dwattr $C$DW$182, DW_AT_decl_column(0x0a)
    2642                    
    2643                    $C$DW$183       .dwtag  DW_TAG_member
    2644                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$30)
    2645                            .dwattr $C$DW$183, DW_AT_name("hwiState")
    2646                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("hwiState")
    2647                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2648                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2649                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2650                            .dwattr $C$DW$183, DW_AT_decl_line(0x1e7)
    2651                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2652                    
    2653                    $C$DW$184       .dwtag  DW_TAG_member
    2654                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    2655                            .dwattr $C$DW$184, DW_AT_name("busyCal")
    2656                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("busyCal")
    2657                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe3]
    2658                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2659                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2660                            .dwattr $C$DW$184, DW_AT_decl_line(0x1e8)
    2661                            .dwattr $C$DW$184, DW_AT_decl_column(0x0a)
    2662                    
    2663                    $C$DW$185       .dwtag  DW_TAG_member
    2664                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    2665                            .dwattr $C$DW$185, DW_AT_name("calStep")
    2666                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("calStep")
    2667                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2668                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2669                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2670                            .dwattr $C$DW$185, DW_AT_decl_line(0x1e9)
    2671                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    2672                    
    2673                    $C$DW$186       .dwtag  DW_TAG_member
    2674                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    2675                            .dwattr $C$DW$186, DW_AT_name("firstLF")
    2676                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("firstLF")
    2677                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe5]
    2678                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2679                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2680                            .dwattr $C$DW$186, DW_AT_decl_line(0x1ea)
    2681                            .dwattr $C$DW$186, DW_AT_decl_column(0x0a)
    2682                    
    2683                    $C$DW$187       .dwtag  DW_TAG_member
    2684                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    2685                            .dwattr $C$DW$187, DW_AT_name("enablePolicy")
    2686                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("enablePolicy")
    2687                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2688                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2689                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2690                            .dwattr $C$DW$187, DW_AT_decl_line(0x1eb)
    2691                            .dwattr $C$DW$187, DW_AT_decl_column(0x0a)
    2692                    
    2693                    $C$DW$188       .dwtag  DW_TAG_member
    2694                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    2695                            .dwattr $C$DW$188, DW_AT_name("initialized")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   50

    2696                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("initialized")
    2697                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe7]
    2698                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2699                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2700                            .dwattr $C$DW$188, DW_AT_decl_line(0x1ec)
    2701                            .dwattr $C$DW$188, DW_AT_decl_column(0x0a)
    2702                    
    2703                    $C$DW$189       .dwtag  DW_TAG_member
    2704                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$65)
    2705                            .dwattr $C$DW$189, DW_AT_name("constraintCounts")
    2706                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("constraintCounts")
    2707                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2708                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2709                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2710                            .dwattr $C$DW$189, DW_AT_decl_line(0x1f0)
    2711                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2712                    
    2713                    $C$DW$190       .dwtag  DW_TAG_member
    2714                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$66)
    2715                            .dwattr $C$DW$190, DW_AT_name("resourceCounts")
    2716                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("resourceCounts")
    2717                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2718                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2719                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2720                            .dwattr $C$DW$190, DW_AT_decl_line(0x1f2)
    2721                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2722                    
    2723                    $C$DW$191       .dwtag  DW_TAG_member
    2724                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$69)
    2725                            .dwattr $C$DW$191, DW_AT_name("resourceHandlers")
    2726                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("resourceHandlers")
    2727                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2728                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2729                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2730                            .dwattr $C$DW$191, DW_AT_decl_line(0x1f4)
    2731                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2732                    
    2733                    $C$DW$192       .dwtag  DW_TAG_member
    2734                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$57)
    2735                            .dwattr $C$DW$192, DW_AT_name("policyFxn")
    2736                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("policyFxn")
    2737                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2738                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2739                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2740                            .dwattr $C$DW$192, DW_AT_decl_line(0x1f6)
    2741                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2742                    
    2743                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2744                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x1d3)
    2745                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    2746                            .dwendtag $C$DW$T$70
    2747                    
    2748                    $C$DW$T$167     .dwtag  DW_TAG_typedef
    2749                            .dwattr $C$DW$T$167, DW_AT_name("PowerCC26XX_ModuleState")
    2750                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   51

    2751                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    2752                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2753                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1f7)
    2754                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x03)
    2755                    
    2756                    
    2757                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    2758                            .dwattr $C$DW$T$71, DW_AT_name("PowerCC26XX_ResourceRecord")
    2759                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    2760                    $C$DW$193       .dwtag  DW_TAG_member
    2761                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$30)
    2762                            .dwattr $C$DW$193, DW_AT_name("flags")
    2763                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flags")
    2764                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2765                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2766                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2767                            .dwattr $C$DW$193, DW_AT_decl_line(0x143)
    2768                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2769                    
    2770                    $C$DW$194       .dwtag  DW_TAG_member
    2771                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$33)
    2772                            .dwattr $C$DW$194, DW_AT_name("driverlibID")
    2773                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("driverlibID")
    2774                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2775                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2776                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2777                            .dwattr $C$DW$194, DW_AT_decl_line(0x144)
    2778                            .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2779                    
    2780                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2781                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x142)
    2782                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    2783                            .dwendtag $C$DW$T$71
    2784                    
    2785                    $C$DW$T$168     .dwtag  DW_TAG_typedef
    2786                            .dwattr $C$DW$T$168, DW_AT_name("PowerCC26XX_ResourceRecord")
    2787                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$71)
    2788                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    2789                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2790                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x145)
    2791                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x03)
    2792                    
    2793                    
    2794                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
    2795                            .dwattr $C$DW$T$77, DW_AT_name("Power_NotifyObj_")
    2796                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x14)
    2797                    $C$DW$195       .dwtag  DW_TAG_member
    2798                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$51)
    2799                            .dwattr $C$DW$195, DW_AT_name("link")
    2800                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("link")
    2801                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2802                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2803                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2804                            .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    2805                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:45 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{20FABBE7-6C1F-4BB7-B116-814D10534D3D} PAGE   52

    2806                    
    2807                    $C$DW$196       .dwtag  DW_TAG_member
    2808                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$72)
    2809                            .dwattr $C$DW$196, DW_AT_name("eventTypes")
    2810                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("eventTypes")
    2811                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2812                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2813                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2814                            .dwattr $C$DW$196, DW_AT_decl_line(0x7b)
    2815                            .dwattr $C$DW$196, DW_AT_decl_column(0x13)
    2816                    
    2817                    $C$DW$197       .dwtag  DW_TAG_member
    2818                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$76)
    2819                            .dwattr $C$DW$197, DW_AT_name("notifyFxn")
    2820                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("notifyFxn")
    2821                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2822                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2823                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2824                            .dwattr $C$DW$197, DW_AT_decl_line(0x7c)
    2825                            .dwattr $C$DW$197, DW_AT_decl_column(0x15)
    2826                    
    2827                    $C$DW$198       .dwtag  DW_TAG_member
    2828                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$41)
    2829                            .dwattr $C$DW$198, DW_AT_name("clientArg")
    2830                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("clientArg")
    2831                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2832                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2833                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2834                            .dwattr $C$DW$198, DW_AT_decl_line(0x7d)
    2835                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    2836                    
    2837                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2838                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x79)
    2839                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
    2840                            .dwendtag $C$DW$T$77
    2841                    
    2842                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    2843                            .dwattr $C$DW$T$169, DW_AT_name("Power_NotifyObj")
    2844                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$77)
    2845                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    2846                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2847                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x7e)
