TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 17:39:06 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5518                            .dwattr $C$DW$470, DW_AT_decl_file("..\Application\mac_user_config.h")
    5519                            .dwattr $C$DW$470, DW_AT_decl_line(0x11d)
    5520                            .dwattr $C$DW$470, DW_AT_decl_column(0x05)
    5521                    
    5522                    $C$DW$471       .dwtag  DW_TAG_enumerator
    5523                            .dwattr $C$DW$471, DW_AT_name("MAC_RADIO_CC1352P")
    5524                            .dwattr $C$DW$471, DW_AT_const_value(0x02)
    5525                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\mac_user_config.h")
    5526                            .dwattr $C$DW$471, DW_AT_decl_line(0x11e)
    5527                            .dwattr $C$DW$471, DW_AT_decl_column(0x05)
    5528                    
    5529                    $C$DW$472       .dwtag  DW_TAG_enumerator
    5530                            .dwattr $C$DW$472, DW_AT_name("MAC_RADIO_CCXXX2")
    5531                            .dwattr $C$DW$472, DW_AT_const_value(0x00)
    5532                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\mac_user_config.h")
    5533                            .dwattr $C$DW$472, DW_AT_decl_line(0x11f)
    5534                            .dwattr $C$DW$472, DW_AT_decl_column(0x05)
    5535                    
    5536                            .dwattr $C$DW$T$767, DW_AT_decl_file("..\Application\mac_user_config.h")
    5537                            .dwattr $C$DW$T$767, DW_AT_decl_line(0x118)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  103

    5538                            .dwattr $C$DW$T$767, DW_AT_decl_column(0x01)
    5539                            .dwendtag $C$DW$T$767
    5540                    
    5541                    $C$DW$T$768     .dwtag  DW_TAG_typedef
    5542                            .dwattr $C$DW$T$768, DW_AT_name("macChipType_t")
    5543                            .dwattr $C$DW$T$768, DW_AT_type(*$C$DW$T$767)
    5544                            .dwattr $C$DW$T$768, DW_AT_language(DW_LANG_C)
    5545                            .dwattr $C$DW$T$768, DW_AT_decl_file("..\Application\mac_user_config.h")
    5546                            .dwattr $C$DW$T$768, DW_AT_decl_line(0x120)
    5547                            .dwattr $C$DW$T$768, DW_AT_decl_column(0x03)
    5548                    
    5549                    
    5550                    $C$DW$T$769     .dwtag  DW_TAG_enumeration_type
    5551                            .dwattr $C$DW$T$769, DW_AT_byte_size(0x01)
    5552                    $C$DW$473       .dwtag  DW_TAG_enumerator
    5553                            .dwattr $C$DW$473, DW_AT_name("MAC_HW_REV_21")
    5554                            .dwattr $C$DW$473, DW_AT_const_value(0x00)
    5555                            .dwattr $C$DW$473, DW_AT_decl_file("..\Application\mac_user_config.h")
    5556                            .dwattr $C$DW$473, DW_AT_decl_line(0x125)
    5557                            .dwattr $C$DW$473, DW_AT_decl_column(0x05)
    5558                    
    5559                    $C$DW$474       .dwtag  DW_TAG_enumerator
    5560                            .dwattr $C$DW$474, DW_AT_name("MAC_HW_REV_20")
    5561                            .dwattr $C$DW$474, DW_AT_const_value(0x01)
    5562                            .dwattr $C$DW$474, DW_AT_decl_file("..\Application\mac_user_config.h")
    5563                            .dwattr $C$DW$474, DW_AT_decl_line(0x126)
    5564                            .dwattr $C$DW$474, DW_AT_decl_column(0x05)
    5565                    
    5566                    $C$DW$475       .dwtag  DW_TAG_enumerator
    5567                            .dwattr $C$DW$475, DW_AT_name("MAC_HW_MAX_REVS")
    5568                            .dwattr $C$DW$475, DW_AT_const_value(0x02)
    5569                            .dwattr $C$DW$475, DW_AT_decl_file("..\Application\mac_user_config.h")
    5570                            .dwattr $C$DW$475, DW_AT_decl_line(0x127)
    5571                            .dwattr $C$DW$475, DW_AT_decl_column(0x05)
    5572                    
    5573                            .dwattr $C$DW$T$769, DW_AT_decl_file("..\Application\mac_user_config.h")
    5574                            .dwattr $C$DW$T$769, DW_AT_decl_line(0x124)
    5575                            .dwattr $C$DW$T$769, DW_AT_decl_column(0x01)
    5576                            .dwendtag $C$DW$T$769
    5577                    
    5578                    $C$DW$T$770     .dwtag  DW_TAG_typedef
    5579                            .dwattr $C$DW$T$770, DW_AT_name("macHwRevision_t")
    5580                            .dwattr $C$DW$T$770, DW_AT_type(*$C$DW$T$769)
    5581                            .dwattr $C$DW$T$770, DW_AT_language(DW_LANG_C)
    5582                            .dwattr $C$DW$T$770, DW_AT_decl_file("..\Application\mac_user_config.h")
    5583                            .dwattr $C$DW$T$770, DW_AT_decl_line(0x128)
    5584                            .dwattr $C$DW$T$770, DW_AT_decl_column(0x03)
    5585                    
    5586                    
    5587                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5588                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    5589                    $C$DW$476       .dwtag  DW_TAG_member
    5590                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    5591                            .dwattr $C$DW$476, DW_AT_name("rfMode")
    5592                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("rfMode")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  104

    5593                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5594                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5595                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5596                            .dwattr $C$DW$476, DW_AT_decl_line(0x421)
    5597                            .dwattr $C$DW$476, DW_AT_decl_column(0x0d)
    5598                    
    5599                    $C$DW$477       .dwtag  DW_TAG_member
    5600                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$21)
    5601                            .dwattr $C$DW$477, DW_AT_name("cpePatchFxn")
    5602                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("cpePatchFxn")
    5603                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5604                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5605                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5606                            .dwattr $C$DW$477, DW_AT_decl_line(0x422)
    5607                            .dwattr $C$DW$477, DW_AT_decl_column(0x0c)
    5608                    
    5609                    $C$DW$478       .dwtag  DW_TAG_member
    5610                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$21)
    5611                            .dwattr $C$DW$478, DW_AT_name("mcePatchFxn")
    5612                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("mcePatchFxn")
    5613                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5614                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5615                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5616                            .dwattr $C$DW$478, DW_AT_decl_line(0x423)
    5617                            .dwattr $C$DW$478, DW_AT_decl_column(0x0c)
    5618                    
    5619                    $C$DW$479       .dwtag  DW_TAG_member
    5620                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$21)
    5621                            .dwattr $C$DW$479, DW_AT_name("rfePatchFxn")
    5622                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("rfePatchFxn")
    5623                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5624                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5625                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5626                            .dwattr $C$DW$479, DW_AT_decl_line(0x424)
    5627                            .dwattr $C$DW$479, DW_AT_decl_column(0x0c)
    5628                    
    5629                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5630                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    5631                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    5632                            .dwendtag $C$DW$T$22
    5633                    
    5634                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    5635                            .dwattr $C$DW$T$44, DW_AT_name("RF_Mode")
    5636                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
    5637                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5638                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5639                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x425)
    5640                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    5641                    
    5642                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5643                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5644                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5645                    
    5646                    
    5647                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  105

    5648                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    5649                    $C$DW$480       .dwtag  DW_TAG_member
    5650                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    5651                            .dwattr $C$DW$480, DW_AT_name("triggerType")
    5652                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("triggerType")
    5653                            .dwattr $C$DW$480, DW_AT_bit_offset(0x04)
    5654                            .dwattr $C$DW$480, DW_AT_bit_size(0x04)
    5655                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5656                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5657                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5658                            .dwattr $C$DW$480, DW_AT_decl_line(0x7d)
    5659                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    5660                    
    5661                    $C$DW$481       .dwtag  DW_TAG_member
    5662                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
    5663                            .dwattr $C$DW$481, DW_AT_name("bEnaCmd")
    5664                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("bEnaCmd")
    5665                            .dwattr $C$DW$481, DW_AT_bit_offset(0x03)
    5666                            .dwattr $C$DW$481, DW_AT_bit_size(0x01)
    5667                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5668                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5669                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5670                            .dwattr $C$DW$481, DW_AT_decl_line(0x7e)
    5671                            .dwattr $C$DW$481, DW_AT_decl_column(0x0f)
    5672                    
    5673                    $C$DW$482       .dwtag  DW_TAG_member
    5674                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    5675                            .dwattr $C$DW$482, DW_AT_name("triggerNo")
    5676                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("triggerNo")
    5677                            .dwattr $C$DW$482, DW_AT_bit_offset(0x01)
    5678                            .dwattr $C$DW$482, DW_AT_bit_size(0x02)
    5679                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5680                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5681                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5682                            .dwattr $C$DW$482, DW_AT_decl_line(0x80)
    5683                            .dwattr $C$DW$482, DW_AT_decl_column(0x0f)
    5684                    
    5685                    $C$DW$483       .dwtag  DW_TAG_member
    5686                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
    5687                            .dwattr $C$DW$483, DW_AT_name("pastTrig")
    5688                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("pastTrig")
    5689                            .dwattr $C$DW$483, DW_AT_bit_offset(0x00)
    5690                            .dwattr $C$DW$483, DW_AT_bit_size(0x01)
    5691                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5692                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5693                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5694                            .dwattr $C$DW$483, DW_AT_decl_line(0x81)
    5695                            .dwattr $C$DW$483, DW_AT_decl_column(0x0f)
    5696                    
    5697                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5698                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x7c)
    5699                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    5700                            .dwendtag $C$DW$T$23
    5701                    
    5702                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  106

    5703                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5704                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    5705                    $C$DW$484       .dwtag  DW_TAG_member
    5706                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    5707                            .dwattr $C$DW$484, DW_AT_name("rule")
    5708                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("rule")
    5709                            .dwattr $C$DW$484, DW_AT_bit_offset(0x04)
    5710                            .dwattr $C$DW$484, DW_AT_bit_size(0x04)
    5711                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5712                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5713                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5714                            .dwattr $C$DW$484, DW_AT_decl_line(0x85)
    5715                            .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    5716                    
    5717                    $C$DW$485       .dwtag  DW_TAG_member
    5718                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    5719                            .dwattr $C$DW$485, DW_AT_name("nSkip")
    5720                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("nSkip")
    5721                            .dwattr $C$DW$485, DW_AT_bit_offset(0x00)
    5722                            .dwattr $C$DW$485, DW_AT_bit_size(0x04)
    5723                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5724                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5725                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5726                            .dwattr $C$DW$485, DW_AT_decl_line(0x86)
    5727                            .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    5728                    
    5729                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5730                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x84)
    5731                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    5732                            .dwendtag $C$DW$T$24
    5733                    
    5734                    
    5735                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5736                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    5737                    $C$DW$486       .dwtag  DW_TAG_member
    5738                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    5739                            .dwattr $C$DW$486, DW_AT_name("triggerType")
    5740                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("triggerType")
    5741                            .dwattr $C$DW$486, DW_AT_bit_offset(0x04)
    5742                            .dwattr $C$DW$486, DW_AT_bit_size(0x04)
    5743                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5744                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5745                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5746                            .dwattr $C$DW$486, DW_AT_decl_line(0xb3)
    5747                            .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    5748                    
    5749                    $C$DW$487       .dwtag  DW_TAG_member
    5750                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    5751                            .dwattr $C$DW$487, DW_AT_name("bEnaCmd")
    5752                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("bEnaCmd")
    5753                            .dwattr $C$DW$487, DW_AT_bit_offset(0x03)
    5754                            .dwattr $C$DW$487, DW_AT_bit_size(0x01)
    5755                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5756                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5757                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  107

    5758                            .dwattr $C$DW$487, DW_AT_decl_line(0xb4)
    5759                            .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    5760                    
    5761                    $C$DW$488       .dwtag  DW_TAG_member
    5762                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
    5763                            .dwattr $C$DW$488, DW_AT_name("triggerNo")
    5764                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("triggerNo")
    5765                            .dwattr $C$DW$488, DW_AT_bit_offset(0x01)
    5766                            .dwattr $C$DW$488, DW_AT_bit_size(0x02)
    5767                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5768                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5769                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5770                            .dwattr $C$DW$488, DW_AT_decl_line(0xb6)
    5771                            .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    5772                    
    5773                    $C$DW$489       .dwtag  DW_TAG_member
    5774                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    5775                            .dwattr $C$DW$489, DW_AT_name("pastTrig")
    5776                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("pastTrig")
    5777                            .dwattr $C$DW$489, DW_AT_bit_offset(0x00)
    5778                            .dwattr $C$DW$489, DW_AT_bit_size(0x01)
    5779                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5780                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5781                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5782                            .dwattr $C$DW$489, DW_AT_decl_line(0xb7)
    5783                            .dwattr $C$DW$489, DW_AT_decl_column(0x0f)
    5784                    
    5785                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5786                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xb2)
    5787                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    5788                            .dwendtag $C$DW$T$25
    5789                    
    5790                    
    5791                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5792                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5793                    $C$DW$490       .dwtag  DW_TAG_member
    5794                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    5795                            .dwattr $C$DW$490, DW_AT_name("rule")
    5796                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("rule")
    5797                            .dwattr $C$DW$490, DW_AT_bit_offset(0x04)
    5798                            .dwattr $C$DW$490, DW_AT_bit_size(0x04)
    5799                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5800                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5801                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5802                            .dwattr $C$DW$490, DW_AT_decl_line(0xbb)
    5803                            .dwattr $C$DW$490, DW_AT_decl_column(0x0f)
    5804                    
    5805                    $C$DW$491       .dwtag  DW_TAG_member
    5806                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
    5807                            .dwattr $C$DW$491, DW_AT_name("nSkip")
    5808                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("nSkip")
    5809                            .dwattr $C$DW$491, DW_AT_bit_offset(0x00)
    5810                            .dwattr $C$DW$491, DW_AT_bit_size(0x04)
    5811                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5812                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  108

    5813                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5814                            .dwattr $C$DW$491, DW_AT_decl_line(0xbc)
    5815                            .dwattr $C$DW$491, DW_AT_decl_column(0x0f)
    5816                    
    5817                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5818                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xba)
    5819                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    5820                            .dwendtag $C$DW$T$26
    5821                    
    5822                    
    5823                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5824                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    5825                    $C$DW$492       .dwtag  DW_TAG_member
    5826                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$27)
    5827                            .dwattr $C$DW$492, DW_AT_name("frontEndMode")
    5828                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("frontEndMode")
    5829                            .dwattr $C$DW$492, DW_AT_bit_offset(0x0d)
    5830                            .dwattr $C$DW$492, DW_AT_bit_size(0x03)
    5831                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5832                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5833                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5834                            .dwattr $C$DW$492, DW_AT_decl_line(0xc9)
    5835                            .dwattr $C$DW$492, DW_AT_decl_column(0x10)
    5836                    
    5837                    $C$DW$493       .dwtag  DW_TAG_member
    5838                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$27)
    5839                            .dwattr $C$DW$493, DW_AT_name("biasMode")
    5840                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("biasMode")
    5841                            .dwattr $C$DW$493, DW_AT_bit_offset(0x0c)
    5842                            .dwattr $C$DW$493, DW_AT_bit_size(0x01)
    5843                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5844                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5845                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5846                            .dwattr $C$DW$493, DW_AT_decl_line(0xcf)
    5847                            .dwattr $C$DW$493, DW_AT_decl_column(0x10)
    5848                    
    5849                    $C$DW$494       .dwtag  DW_TAG_member
    5850                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$27)
    5851                            .dwattr $C$DW$494, DW_AT_name("analogCfgMode")
    5852                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("analogCfgMode")
    5853                            .dwattr $C$DW$494, DW_AT_bit_offset(0x06)
    5854                            .dwattr $C$DW$494, DW_AT_bit_size(0x06)
    5855                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5856                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5857                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5858                            .dwattr $C$DW$494, DW_AT_decl_line(0xd1)
    5859                            .dwattr $C$DW$494, DW_AT_decl_column(0x10)
    5860                    
    5861                    $C$DW$495       .dwtag  DW_TAG_member
    5862                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$27)
    5863                            .dwattr $C$DW$495, DW_AT_name("bNoFsPowerUp")
    5864                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5865                            .dwattr $C$DW$495, DW_AT_bit_offset(0x05)
    5866                            .dwattr $C$DW$495, DW_AT_bit_size(0x01)
    5867                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  109

    5868                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5869                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5870                            .dwattr $C$DW$495, DW_AT_decl_line(0xd8)
    5871                            .dwattr $C$DW$495, DW_AT_decl_column(0x10)
    5872                    
    5873                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5874                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xc8)
    5875                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    5876                            .dwendtag $C$DW$T$28
    5877                    
    5878                    
    5879                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5880                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5881                    $C$DW$496       .dwtag  DW_TAG_member
    5882                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5883                            .dwattr $C$DW$496, DW_AT_name("triggerType")
    5884                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("triggerType")
    5885                            .dwattr $C$DW$496, DW_AT_bit_offset(0x04)
    5886                            .dwattr $C$DW$496, DW_AT_bit_size(0x04)
    5887                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5888                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5889                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5890                            .dwattr $C$DW$496, DW_AT_decl_line(0x1cf)
    5891                            .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    5892                    
    5893                    $C$DW$497       .dwtag  DW_TAG_member
    5894                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    5895                            .dwattr $C$DW$497, DW_AT_name("bEnaCmd")
    5896                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("bEnaCmd")
    5897                            .dwattr $C$DW$497, DW_AT_bit_offset(0x03)
    5898                            .dwattr $C$DW$497, DW_AT_bit_size(0x01)
    5899                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5900                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5901                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5902                            .dwattr $C$DW$497, DW_AT_decl_line(0x1d0)
    5903                            .dwattr $C$DW$497, DW_AT_decl_column(0x0f)
    5904                    
    5905                    $C$DW$498       .dwtag  DW_TAG_member
    5906                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    5907                            .dwattr $C$DW$498, DW_AT_name("triggerNo")
    5908                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("triggerNo")
    5909                            .dwattr $C$DW$498, DW_AT_bit_offset(0x01)
    5910                            .dwattr $C$DW$498, DW_AT_bit_size(0x02)
    5911                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5912                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5913                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5914                            .dwattr $C$DW$498, DW_AT_decl_line(0x1d2)
    5915                            .dwattr $C$DW$498, DW_AT_decl_column(0x0f)
    5916                    
    5917                    $C$DW$499       .dwtag  DW_TAG_member
    5918                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    5919                            .dwattr $C$DW$499, DW_AT_name("pastTrig")
    5920                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("pastTrig")
    5921                            .dwattr $C$DW$499, DW_AT_bit_offset(0x00)
    5922                            .dwattr $C$DW$499, DW_AT_bit_size(0x01)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  110

    5923                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5924                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5925                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5926                            .dwattr $C$DW$499, DW_AT_decl_line(0x1d3)
    5927                            .dwattr $C$DW$499, DW_AT_decl_column(0x0f)
    5928                    
    5929                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5930                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1ce)
    5931                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    5932                            .dwendtag $C$DW$T$29
    5933                    
    5934                    
    5935                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5936                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    5937                    $C$DW$500       .dwtag  DW_TAG_member
    5938                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    5939                            .dwattr $C$DW$500, DW_AT_name("rule")
    5940                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("rule")
    5941                            .dwattr $C$DW$500, DW_AT_bit_offset(0x04)
    5942                            .dwattr $C$DW$500, DW_AT_bit_size(0x04)
    5943                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5944                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5945                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5946                            .dwattr $C$DW$500, DW_AT_decl_line(0x1d7)
    5947                            .dwattr $C$DW$500, DW_AT_decl_column(0x0f)
    5948                    
    5949                    $C$DW$501       .dwtag  DW_TAG_member
    5950                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    5951                            .dwattr $C$DW$501, DW_AT_name("nSkip")
    5952                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("nSkip")
    5953                            .dwattr $C$DW$501, DW_AT_bit_offset(0x00)
    5954                            .dwattr $C$DW$501, DW_AT_bit_size(0x04)
    5955                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5956                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5957                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5958                            .dwattr $C$DW$501, DW_AT_decl_line(0x1d8)
    5959                            .dwattr $C$DW$501, DW_AT_decl_column(0x0f)
    5960                    
    5961                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5962                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x1d6)
    5963                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    5964                            .dwendtag $C$DW$T$30
    5965                    
    5966                    
    5967                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5968                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    5969                    $C$DW$502       .dwtag  DW_TAG_member
    5970                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$27)
    5971                            .dwattr $C$DW$502, DW_AT_name("modType")
    5972                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("modType")
    5973                            .dwattr $C$DW$502, DW_AT_bit_offset(0x0d)
    5974                            .dwattr $C$DW$502, DW_AT_bit_size(0x03)
    5975                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5976                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5977                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  111

    5978                            .dwattr $C$DW$502, DW_AT_decl_line(0x1db)
    5979                            .dwattr $C$DW$502, DW_AT_decl_column(0x10)
    5980                    
    5981                    $C$DW$503       .dwtag  DW_TAG_member
    5982                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$27)
    5983                            .dwattr $C$DW$503, DW_AT_name("deviation")
    5984                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("deviation")
    5985                            .dwattr $C$DW$503, DW_AT_bit_offset(0x00)
    5986                            .dwattr $C$DW$503, DW_AT_bit_size(0x0d)
    5987                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5988                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5989                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5990                            .dwattr $C$DW$503, DW_AT_decl_line(0x1de)
    5991                            .dwattr $C$DW$503, DW_AT_decl_column(0x10)
    5992                    
    5993                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5994                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x1da)
    5995                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    5996                            .dwendtag $C$DW$T$31
    5997                    
    5998                    
    5999                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6000                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    6001                    $C$DW$504       .dwtag  DW_TAG_member
    6002                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$32)
    6003                            .dwattr $C$DW$504, DW_AT_name("preScale")
    6004                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("preScale")
    6005                            .dwattr $C$DW$504, DW_AT_bit_offset(0x1c)
    6006                            .dwattr $C$DW$504, DW_AT_bit_size(0x04)
    6007                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6008                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6009                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6010                            .dwattr $C$DW$504, DW_AT_decl_line(0x1e1)
    6011                            .dwattr $C$DW$504, DW_AT_decl_column(0x10)
    6012                    
    6013                    $C$DW$505       .dwtag  DW_TAG_member
    6014                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$32)
    6015                            .dwattr $C$DW$505, DW_AT_name("rateWord")
    6016                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("rateWord")
    6017                            .dwattr $C$DW$505, DW_AT_bit_offset(0x03)
    6018                            .dwattr $C$DW$505, DW_AT_bit_size(0x15)
    6019                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6020                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6021                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6022                            .dwattr $C$DW$505, DW_AT_decl_line(0x1e3)
    6023                            .dwattr $C$DW$505, DW_AT_decl_column(0x10)
    6024                    
    6025                    $C$DW$506       .dwtag  DW_TAG_member
    6026                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$32)
    6027                            .dwattr $C$DW$506, DW_AT_name("decimMode")
    6028                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("decimMode")
    6029                            .dwattr $C$DW$506, DW_AT_bit_offset(0x00)
    6030                            .dwattr $C$DW$506, DW_AT_bit_size(0x03)
    6031                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6032                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  112

    6033                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6034                            .dwattr $C$DW$506, DW_AT_decl_line(0x1e4)
    6035                            .dwattr $C$DW$506, DW_AT_decl_column(0x10)
    6036                    
    6037                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6038                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1e0)
    6039                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    6040                            .dwendtag $C$DW$T$33
    6041                    
    6042                    
    6043                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6044                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6045                    $C$DW$507       .dwtag  DW_TAG_member
    6046                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
    6047                            .dwattr $C$DW$507, DW_AT_name("nPreamBytes")
    6048                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("nPreamBytes")
    6049                            .dwattr $C$DW$507, DW_AT_bit_offset(0x02)
    6050                            .dwattr $C$DW$507, DW_AT_bit_size(0x06)
    6051                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6052                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6053                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6054                            .dwattr $C$DW$507, DW_AT_decl_line(0x1ec)
    6055                            .dwattr $C$DW$507, DW_AT_decl_column(0x0f)
    6056                    
    6057                    $C$DW$508       .dwtag  DW_TAG_member
    6058                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    6059                            .dwattr $C$DW$508, DW_AT_name("preamMode")
    6060                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("preamMode")
    6061                            .dwattr $C$DW$508, DW_AT_bit_offset(0x00)
    6062                            .dwattr $C$DW$508, DW_AT_bit_size(0x02)
    6063                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6064                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6065                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6066                            .dwattr $C$DW$508, DW_AT_decl_line(0x1f2)
    6067                            .dwattr $C$DW$508, DW_AT_decl_column(0x0f)
    6068                    
    6069                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6070                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1eb)
    6071                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    6072                            .dwendtag $C$DW$T$34
    6073                    
    6074                    
    6075                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6076                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    6077                    $C$DW$509       .dwtag  DW_TAG_member
    6078                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$27)
    6079                            .dwattr $C$DW$509, DW_AT_name("nSwBits")
    6080                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("nSwBits")
    6081                            .dwattr $C$DW$509, DW_AT_bit_offset(0x0a)
    6082                            .dwattr $C$DW$509, DW_AT_bit_size(0x06)
    6083                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6084                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6085                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6086                            .dwattr $C$DW$509, DW_AT_decl_line(0x1f8)
    6087                            .dwattr $C$DW$509, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  113

    6088                    
    6089                    $C$DW$510       .dwtag  DW_TAG_member
    6090                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    6091                            .dwattr $C$DW$510, DW_AT_name("bBitReversal")
    6092                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("bBitReversal")
    6093                            .dwattr $C$DW$510, DW_AT_bit_offset(0x09)
    6094                            .dwattr $C$DW$510, DW_AT_bit_size(0x01)
    6095                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6096                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6097                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6098                            .dwattr $C$DW$510, DW_AT_decl_line(0x1f9)
    6099                            .dwattr $C$DW$510, DW_AT_decl_column(0x10)
    6100                    
    6101                    $C$DW$511       .dwtag  DW_TAG_member
    6102                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$27)
    6103                            .dwattr $C$DW$511, DW_AT_name("bMsbFirst")
    6104                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("bMsbFirst")
    6105                            .dwattr $C$DW$511, DW_AT_bit_offset(0x08)
    6106                            .dwattr $C$DW$511, DW_AT_bit_size(0x01)
    6107                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6108                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6109                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6110                            .dwattr $C$DW$511, DW_AT_decl_line(0x1fb)
    6111                            .dwattr $C$DW$511, DW_AT_decl_column(0x10)
    6112                    
    6113                    $C$DW$512       .dwtag  DW_TAG_member
    6114                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$27)
    6115                            .dwattr $C$DW$512, DW_AT_name("fecMode")
    6116                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("fecMode")
    6117                            .dwattr $C$DW$512, DW_AT_bit_offset(0x04)
    6118                            .dwattr $C$DW$512, DW_AT_bit_size(0x04)
    6119                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6120                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6121                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6122                            .dwattr $C$DW$512, DW_AT_decl_line(0x1fd)
    6123                            .dwattr $C$DW$512, DW_AT_decl_column(0x10)
    6124                    
    6125                    $C$DW$513       .dwtag  DW_TAG_member
    6126                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$27)
    6127                            .dwattr $C$DW$513, DW_AT_name("whitenMode")
    6128                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("whitenMode")
    6129                            .dwattr $C$DW$513, DW_AT_bit_offset(0x00)
    6130                            .dwattr $C$DW$513, DW_AT_bit_size(0x03)
    6131                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6132                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6133                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6134                            .dwattr $C$DW$513, DW_AT_decl_line(0x203)
    6135                            .dwattr $C$DW$513, DW_AT_decl_column(0x10)
    6136                    
    6137                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6138                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1f7)
    6139                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    6140                            .dwendtag $C$DW$T$35
    6141                    
    6142                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  114

    6143                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6144                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    6145                    $C$DW$514       .dwtag  DW_TAG_member
    6146                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$27)
    6147                            .dwattr $C$DW$514, DW_AT_name("frontEndMode")
    6148                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("frontEndMode")
    6149                            .dwattr $C$DW$514, DW_AT_bit_offset(0x0d)
    6150                            .dwattr $C$DW$514, DW_AT_bit_size(0x03)
    6151                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6152                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6153                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6154                            .dwattr $C$DW$514, DW_AT_decl_line(0x20d)
    6155                            .dwattr $C$DW$514, DW_AT_decl_column(0x10)
    6156                    
    6157                    $C$DW$515       .dwtag  DW_TAG_member
    6158                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$27)
    6159                            .dwattr $C$DW$515, DW_AT_name("biasMode")
    6160                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("biasMode")
    6161                            .dwattr $C$DW$515, DW_AT_bit_offset(0x0c)
    6162                            .dwattr $C$DW$515, DW_AT_bit_size(0x01)
    6163                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6164                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6165                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6166                            .dwattr $C$DW$515, DW_AT_decl_line(0x213)
    6167                            .dwattr $C$DW$515, DW_AT_decl_column(0x10)
    6168                    
    6169                    $C$DW$516       .dwtag  DW_TAG_member
    6170                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$27)
    6171                            .dwattr $C$DW$516, DW_AT_name("analogCfgMode")
    6172                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("analogCfgMode")
    6173                            .dwattr $C$DW$516, DW_AT_bit_offset(0x06)
    6174                            .dwattr $C$DW$516, DW_AT_bit_size(0x06)
    6175                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6176                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6177                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6178                            .dwattr $C$DW$516, DW_AT_decl_line(0x215)
    6179                            .dwattr $C$DW$516, DW_AT_decl_column(0x10)
    6180                    
    6181                    $C$DW$517       .dwtag  DW_TAG_member
    6182                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$27)
    6183                            .dwattr $C$DW$517, DW_AT_name("bNoFsPowerUp")
    6184                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6185                            .dwattr $C$DW$517, DW_AT_bit_offset(0x05)
    6186                            .dwattr $C$DW$517, DW_AT_bit_size(0x01)
    6187                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6188                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6189                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6190                            .dwattr $C$DW$517, DW_AT_decl_line(0x21c)
    6191                            .dwattr $C$DW$517, DW_AT_decl_column(0x10)
    6192                    
    6193                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6194                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x20c)
    6195                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    6196                            .dwendtag $C$DW$T$36
    6197                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  115

    6198                    
    6199                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6200                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6201                    $C$DW$518       .dwtag  DW_TAG_member
    6202                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    6203                            .dwattr $C$DW$518, DW_AT_name("triggerType")
    6204                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("triggerType")
    6205                            .dwattr $C$DW$518, DW_AT_bit_offset(0x04)
    6206                            .dwattr $C$DW$518, DW_AT_bit_size(0x04)
    6207                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6208                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6209                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6210                            .dwattr $C$DW$518, DW_AT_decl_line(0x232)
    6211                            .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    6212                    
    6213                    $C$DW$519       .dwtag  DW_TAG_member
    6214                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
    6215                            .dwattr $C$DW$519, DW_AT_name("bEnaCmd")
    6216                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("bEnaCmd")
    6217                            .dwattr $C$DW$519, DW_AT_bit_offset(0x03)
    6218                            .dwattr $C$DW$519, DW_AT_bit_size(0x01)
    6219                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6220                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6221                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6222                            .dwattr $C$DW$519, DW_AT_decl_line(0x233)
    6223                            .dwattr $C$DW$519, DW_AT_decl_column(0x0f)
    6224                    
    6225                    $C$DW$520       .dwtag  DW_TAG_member
    6226                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
    6227                            .dwattr $C$DW$520, DW_AT_name("triggerNo")
    6228                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("triggerNo")
    6229                            .dwattr $C$DW$520, DW_AT_bit_offset(0x01)
    6230                            .dwattr $C$DW$520, DW_AT_bit_size(0x02)
    6231                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6232                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6233                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6234                            .dwattr $C$DW$520, DW_AT_decl_line(0x235)
    6235                            .dwattr $C$DW$520, DW_AT_decl_column(0x0f)
    6236                    
    6237                    $C$DW$521       .dwtag  DW_TAG_member
    6238                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    6239                            .dwattr $C$DW$521, DW_AT_name("pastTrig")
    6240                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("pastTrig")
    6241                            .dwattr $C$DW$521, DW_AT_bit_offset(0x00)
    6242                            .dwattr $C$DW$521, DW_AT_bit_size(0x01)
    6243                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6244                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6245                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6246                            .dwattr $C$DW$521, DW_AT_decl_line(0x236)
    6247                            .dwattr $C$DW$521, DW_AT_decl_column(0x0f)
    6248                    
    6249                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6250                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x231)
    6251                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    6252                            .dwendtag $C$DW$T$37
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  116

    6253                    
    6254                    
    6255                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6256                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    6257                    $C$DW$522       .dwtag  DW_TAG_member
    6258                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    6259                            .dwattr $C$DW$522, DW_AT_name("rule")
    6260                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("rule")
    6261                            .dwattr $C$DW$522, DW_AT_bit_offset(0x04)
    6262                            .dwattr $C$DW$522, DW_AT_bit_size(0x04)
    6263                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6264                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6265                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6266                            .dwattr $C$DW$522, DW_AT_decl_line(0x23a)
    6267                            .dwattr $C$DW$522, DW_AT_decl_column(0x0f)
    6268                    
    6269                    $C$DW$523       .dwtag  DW_TAG_member
    6270                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
    6271                            .dwattr $C$DW$523, DW_AT_name("nSkip")
    6272                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("nSkip")
    6273                            .dwattr $C$DW$523, DW_AT_bit_offset(0x00)
    6274                            .dwattr $C$DW$523, DW_AT_bit_size(0x04)
    6275                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6276                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6277                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6278                            .dwattr $C$DW$523, DW_AT_decl_line(0x23b)
    6279                            .dwattr $C$DW$523, DW_AT_decl_column(0x0f)
    6280                    
    6281                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6282                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x239)
    6283                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    6284                            .dwendtag $C$DW$T$38
    6285                    
    6286                    
    6287                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6288                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    6289                    $C$DW$524       .dwtag  DW_TAG_member
    6290                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$27)
    6291                            .dwattr $C$DW$524, DW_AT_name("modType")
    6292                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("modType")
    6293                            .dwattr $C$DW$524, DW_AT_bit_offset(0x0d)
    6294                            .dwattr $C$DW$524, DW_AT_bit_size(0x03)
    6295                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6296                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6297                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6298                            .dwattr $C$DW$524, DW_AT_decl_line(0x23e)
    6299                            .dwattr $C$DW$524, DW_AT_decl_column(0x10)
    6300                    
    6301                    $C$DW$525       .dwtag  DW_TAG_member
    6302                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$27)
    6303                            .dwattr $C$DW$525, DW_AT_name("deviation")
    6304                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("deviation")
    6305                            .dwattr $C$DW$525, DW_AT_bit_offset(0x00)
    6306                            .dwattr $C$DW$525, DW_AT_bit_size(0x0d)
    6307                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  117

    6308                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6309                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6310                            .dwattr $C$DW$525, DW_AT_decl_line(0x241)
    6311                            .dwattr $C$DW$525, DW_AT_decl_column(0x10)
    6312                    
    6313                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6314                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x23d)
    6315                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    6316                            .dwendtag $C$DW$T$39
    6317                    
    6318                    
    6319                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6320                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    6321                    $C$DW$526       .dwtag  DW_TAG_member
    6322                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$32)
    6323                            .dwattr $C$DW$526, DW_AT_name("preScale")
    6324                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("preScale")
    6325                            .dwattr $C$DW$526, DW_AT_bit_offset(0x1c)
    6326                            .dwattr $C$DW$526, DW_AT_bit_size(0x04)
    6327                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6328                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6329                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6330                            .dwattr $C$DW$526, DW_AT_decl_line(0x244)
    6331                            .dwattr $C$DW$526, DW_AT_decl_column(0x10)
    6332                    
    6333                    $C$DW$527       .dwtag  DW_TAG_member
    6334                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$32)
    6335                            .dwattr $C$DW$527, DW_AT_name("rateWord")
    6336                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("rateWord")
    6337                            .dwattr $C$DW$527, DW_AT_bit_offset(0x03)
    6338                            .dwattr $C$DW$527, DW_AT_bit_size(0x15)
    6339                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6340                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6341                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6342                            .dwattr $C$DW$527, DW_AT_decl_line(0x246)
    6343                            .dwattr $C$DW$527, DW_AT_decl_column(0x10)
    6344                    
    6345                    $C$DW$528       .dwtag  DW_TAG_member
    6346                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$32)
    6347                            .dwattr $C$DW$528, DW_AT_name("decimMode")
    6348                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("decimMode")
    6349                            .dwattr $C$DW$528, DW_AT_bit_offset(0x00)
    6350                            .dwattr $C$DW$528, DW_AT_bit_size(0x03)
    6351                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6352                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6353                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6354                            .dwattr $C$DW$528, DW_AT_decl_line(0x247)
    6355                            .dwattr $C$DW$528, DW_AT_decl_column(0x10)
    6356                    
    6357                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6358                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x243)
    6359                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    6360                            .dwendtag $C$DW$T$40
    6361                    
    6362                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  118

    6363                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6364                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    6365                    $C$DW$529       .dwtag  DW_TAG_member
    6366                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    6367                            .dwattr $C$DW$529, DW_AT_name("nPreamBytes")
    6368                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("nPreamBytes")
    6369                            .dwattr $C$DW$529, DW_AT_bit_offset(0x02)
    6370                            .dwattr $C$DW$529, DW_AT_bit_size(0x06)
    6371                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6372                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6373                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6374                            .dwattr $C$DW$529, DW_AT_decl_line(0x24f)
    6375                            .dwattr $C$DW$529, DW_AT_decl_column(0x0f)
    6376                    
    6377                    $C$DW$530       .dwtag  DW_TAG_member
    6378                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    6379                            .dwattr $C$DW$530, DW_AT_name("preamMode")
    6380                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("preamMode")
    6381                            .dwattr $C$DW$530, DW_AT_bit_offset(0x00)
    6382                            .dwattr $C$DW$530, DW_AT_bit_size(0x02)
    6383                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6384                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6385                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6386                            .dwattr $C$DW$530, DW_AT_decl_line(0x255)
    6387                            .dwattr $C$DW$530, DW_AT_decl_column(0x0f)
    6388                    
    6389                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6390                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x24e)
    6391                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    6392                            .dwendtag $C$DW$T$41
    6393                    
    6394                    
    6395                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6396                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    6397                    $C$DW$531       .dwtag  DW_TAG_member
    6398                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$27)
    6399                            .dwattr $C$DW$531, DW_AT_name("nSwBits")
    6400                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("nSwBits")
    6401                            .dwattr $C$DW$531, DW_AT_bit_offset(0x0a)
    6402                            .dwattr $C$DW$531, DW_AT_bit_size(0x06)
    6403                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6404                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6405                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6406                            .dwattr $C$DW$531, DW_AT_decl_line(0x25b)
    6407                            .dwattr $C$DW$531, DW_AT_decl_column(0x10)
    6408                    
    6409                    $C$DW$532       .dwtag  DW_TAG_member
    6410                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$27)
    6411                            .dwattr $C$DW$532, DW_AT_name("bBitReversal")
    6412                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("bBitReversal")
    6413                            .dwattr $C$DW$532, DW_AT_bit_offset(0x09)
    6414                            .dwattr $C$DW$532, DW_AT_bit_size(0x01)
    6415                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6416                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6417                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  119

    6418                            .dwattr $C$DW$532, DW_AT_decl_line(0x25c)
    6419                            .dwattr $C$DW$532, DW_AT_decl_column(0x10)
    6420                    
    6421                    $C$DW$533       .dwtag  DW_TAG_member
    6422                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$27)
    6423                            .dwattr $C$DW$533, DW_AT_name("bMsbFirst")
    6424                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("bMsbFirst")
    6425                            .dwattr $C$DW$533, DW_AT_bit_offset(0x08)
    6426                            .dwattr $C$DW$533, DW_AT_bit_size(0x01)
    6427                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6428                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6429                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6430                            .dwattr $C$DW$533, DW_AT_decl_line(0x25e)
    6431                            .dwattr $C$DW$533, DW_AT_decl_column(0x10)
    6432                    
    6433                    $C$DW$534       .dwtag  DW_TAG_member
    6434                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$27)
    6435                            .dwattr $C$DW$534, DW_AT_name("fecMode")
    6436                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("fecMode")
    6437                            .dwattr $C$DW$534, DW_AT_bit_offset(0x04)
    6438                            .dwattr $C$DW$534, DW_AT_bit_size(0x04)
    6439                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6440                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6441                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6442                            .dwattr $C$DW$534, DW_AT_decl_line(0x260)
    6443                            .dwattr $C$DW$534, DW_AT_decl_column(0x10)
    6444                    
    6445                    $C$DW$535       .dwtag  DW_TAG_member
    6446                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$27)
    6447                            .dwattr $C$DW$535, DW_AT_name("whitenMode")
    6448                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("whitenMode")
    6449                            .dwattr $C$DW$535, DW_AT_bit_offset(0x00)
    6450                            .dwattr $C$DW$535, DW_AT_bit_size(0x03)
    6451                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6452                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6453                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6454                            .dwattr $C$DW$535, DW_AT_decl_line(0x266)
    6455                            .dwattr $C$DW$535, DW_AT_decl_column(0x10)
    6456                    
    6457                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6458                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x25a)
    6459                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    6460                            .dwendtag $C$DW$T$42
    6461                    
    6462                    
    6463                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6464                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    6465                    $C$DW$536       .dwtag  DW_TAG_member
    6466                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$27)
    6467                            .dwattr $C$DW$536, DW_AT_name("frontEndMode")
    6468                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("frontEndMode")
    6469                            .dwattr $C$DW$536, DW_AT_bit_offset(0x0d)
    6470                            .dwattr $C$DW$536, DW_AT_bit_size(0x03)
    6471                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6472                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  120

    6473                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6474                            .dwattr $C$DW$536, DW_AT_decl_line(0x270)
    6475                            .dwattr $C$DW$536, DW_AT_decl_column(0x10)
    6476                    
    6477                    $C$DW$537       .dwtag  DW_TAG_member
    6478                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$27)
    6479                            .dwattr $C$DW$537, DW_AT_name("biasMode")
    6480                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("biasMode")
    6481                            .dwattr $C$DW$537, DW_AT_bit_offset(0x0c)
    6482                            .dwattr $C$DW$537, DW_AT_bit_size(0x01)
    6483                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6484                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6485                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6486                            .dwattr $C$DW$537, DW_AT_decl_line(0x276)
    6487                            .dwattr $C$DW$537, DW_AT_decl_column(0x10)
    6488                    
    6489                    $C$DW$538       .dwtag  DW_TAG_member
    6490                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$27)
    6491                            .dwattr $C$DW$538, DW_AT_name("analogCfgMode")
    6492                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("analogCfgMode")
    6493                            .dwattr $C$DW$538, DW_AT_bit_offset(0x06)
    6494                            .dwattr $C$DW$538, DW_AT_bit_size(0x06)
    6495                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6496                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6497                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6498                            .dwattr $C$DW$538, DW_AT_decl_line(0x278)
    6499                            .dwattr $C$DW$538, DW_AT_decl_column(0x10)
    6500                    
    6501                    $C$DW$539       .dwtag  DW_TAG_member
    6502                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$27)
    6503                            .dwattr $C$DW$539, DW_AT_name("bNoFsPowerUp")
    6504                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6505                            .dwattr $C$DW$539, DW_AT_bit_offset(0x05)
    6506                            .dwattr $C$DW$539, DW_AT_bit_size(0x01)
    6507                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6508                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6509                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6510                            .dwattr $C$DW$539, DW_AT_decl_line(0x27f)
    6511                            .dwattr $C$DW$539, DW_AT_decl_column(0x10)
    6512                    
    6513                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6514                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x26f)
    6515                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    6516                            .dwendtag $C$DW$T$43
    6517                    
    6518                    
    6519                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6520                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    6521                    $C$DW$540       .dwtag  DW_TAG_member
    6522                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    6523                            .dwattr $C$DW$540, DW_AT_name("nInactivityTimeout")
    6524                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("nInactivityTimeout")
    6525                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6526                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6527                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  121

    6528                            .dwattr $C$DW$540, DW_AT_decl_line(0x515)
    6529                            .dwattr $C$DW$540, DW_AT_decl_column(0x1d)
    6530                    
    6531                    $C$DW$541       .dwtag  DW_TAG_member
    6532                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$45)
    6533                            .dwattr $C$DW$541, DW_AT_name("pRfMode")
    6534                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("pRfMode")
    6535                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6536                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6537                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6538                            .dwattr $C$DW$541, DW_AT_decl_line(0x516)
    6539                            .dwattr $C$DW$541, DW_AT_decl_column(0x1d)
    6540                    
    6541                    $C$DW$542       .dwtag  DW_TAG_member
    6542                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$47)
    6543                            .dwattr $C$DW$542, DW_AT_name("pRadioSetup")
    6544                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("pRadioSetup")
    6545                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6546                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6547                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6548                            .dwattr $C$DW$542, DW_AT_decl_line(0x517)
    6549                            .dwattr $C$DW$542, DW_AT_decl_column(0x1d)
    6550                    
    6551                    $C$DW$543       .dwtag  DW_TAG_member
    6552                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    6553                            .dwattr $C$DW$543, DW_AT_name("nPowerUpDuration")
    6554                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("nPowerUpDuration")
    6555                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6556                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6557                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6558                            .dwattr $C$DW$543, DW_AT_decl_line(0x518)
    6559                            .dwattr $C$DW$543, DW_AT_decl_column(0x1d)
    6560                    
    6561                    $C$DW$544       .dwtag  DW_TAG_member
    6562                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$48)
    6563                            .dwattr $C$DW$544, DW_AT_name("bMeasurePowerUpDuration")
    6564                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    6565                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6566                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6567                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6568                            .dwattr $C$DW$544, DW_AT_decl_line(0x519)
    6569                            .dwattr $C$DW$544, DW_AT_decl_column(0x1d)
    6570                    
    6571                    $C$DW$545       .dwtag  DW_TAG_member
    6572                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$48)
    6573                            .dwattr $C$DW$545, DW_AT_name("bUpdateSetup")
    6574                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("bUpdateSetup")
    6575                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6576                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6577                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6578                            .dwattr $C$DW$545, DW_AT_decl_line(0x51a)
    6579                            .dwattr $C$DW$545, DW_AT_decl_column(0x1d)
    6580                    
    6581                    $C$DW$546       .dwtag  DW_TAG_member
    6582                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  122

    6583                            .dwattr $C$DW$546, DW_AT_name("nPowerUpDurationMargin")
    6584                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    6585                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6586                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6587                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6588                            .dwattr $C$DW$546, DW_AT_decl_line(0x51b)
    6589                            .dwattr $C$DW$546, DW_AT_decl_column(0x1d)
    6590                    
    6591                    $C$DW$547       .dwtag  DW_TAG_member
    6592                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$3)
    6593                            .dwattr $C$DW$547, DW_AT_name("pPowerCb")
    6594                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("pPowerCb")
    6595                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6596                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6597                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6598                            .dwattr $C$DW$547, DW_AT_decl_line(0x51c)
    6599                            .dwattr $C$DW$547, DW_AT_decl_column(0x1d)
    6600                    
    6601                    $C$DW$548       .dwtag  DW_TAG_member
    6602                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$3)
    6603                            .dwattr $C$DW$548, DW_AT_name("pErrCb")
    6604                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("pErrCb")
    6605                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6606                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6607                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6608                            .dwattr $C$DW$548, DW_AT_decl_line(0x51d)
    6609                            .dwattr $C$DW$548, DW_AT_decl_column(0x1d)
    6610                    
    6611                    $C$DW$549       .dwtag  DW_TAG_member
    6612                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$3)
    6613                            .dwattr $C$DW$549, DW_AT_name("pClientEventCb")
    6614                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("pClientEventCb")
    6615                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6616                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6617                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6618                            .dwattr $C$DW$549, DW_AT_decl_line(0x51e)
    6619                            .dwattr $C$DW$549, DW_AT_decl_column(0x1d)
    6620                    
    6621                    $C$DW$550       .dwtag  DW_TAG_member
    6622                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$49)
    6623                            .dwattr $C$DW$550, DW_AT_name("nClientEventMask")
    6624                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("nClientEventMask")
    6625                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6626                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6627                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6628                            .dwattr $C$DW$550, DW_AT_decl_line(0x51f)
    6629                            .dwattr $C$DW$550, DW_AT_decl_column(0x1d)
    6630                    
    6631                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    6632                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x514)
    6633                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0c)
    6634                            .dwendtag $C$DW$T$50
    6635                    
    6636                    
    6637                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  123

    6638                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    6639                    $C$DW$551       .dwtag  DW_TAG_member
    6640                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
    6641                            .dwattr $C$DW$551, DW_AT_name("triggerType")
    6642                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("triggerType")
    6643                            .dwattr $C$DW$551, DW_AT_bit_offset(0x04)
    6644                            .dwattr $C$DW$551, DW_AT_bit_size(0x04)
    6645                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6646                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6647                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6648                            .dwattr $C$DW$551, DW_AT_decl_line(0xee)
    6649                            .dwattr $C$DW$551, DW_AT_decl_column(0x0f)
    6650                    
    6651                    $C$DW$552       .dwtag  DW_TAG_member
    6652                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
    6653                            .dwattr $C$DW$552, DW_AT_name("bEnaCmd")
    6654                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("bEnaCmd")
    6655                            .dwattr $C$DW$552, DW_AT_bit_offset(0x03)
    6656                            .dwattr $C$DW$552, DW_AT_bit_size(0x01)
    6657                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6658                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6659                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6660                            .dwattr $C$DW$552, DW_AT_decl_line(0xef)
    6661                            .dwattr $C$DW$552, DW_AT_decl_column(0x0f)
    6662                    
    6663                    $C$DW$553       .dwtag  DW_TAG_member
    6664                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$19)
    6665                            .dwattr $C$DW$553, DW_AT_name("triggerNo")
    6666                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("triggerNo")
    6667                            .dwattr $C$DW$553, DW_AT_bit_offset(0x01)
    6668                            .dwattr $C$DW$553, DW_AT_bit_size(0x02)
    6669                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6670                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6671                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6672                            .dwattr $C$DW$553, DW_AT_decl_line(0xf1)
    6673                            .dwattr $C$DW$553, DW_AT_decl_column(0x0f)
    6674                    
    6675                    $C$DW$554       .dwtag  DW_TAG_member
    6676                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$19)
    6677                            .dwattr $C$DW$554, DW_AT_name("pastTrig")
    6678                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("pastTrig")
    6679                            .dwattr $C$DW$554, DW_AT_bit_offset(0x00)
    6680                            .dwattr $C$DW$554, DW_AT_bit_size(0x01)
    6681                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6682                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6683                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6684                            .dwattr $C$DW$554, DW_AT_decl_line(0xf2)
    6685                            .dwattr $C$DW$554, DW_AT_decl_column(0x0f)
    6686                    
    6687                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6688                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xed)
    6689                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    6690                            .dwendtag $C$DW$T$51
    6691                    
    6692                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:39:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{B7A6B052-728F-49F7-A66A-D70FD27D7BF5} PAGE  124

    6693                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    6694                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    6695                    $C$DW$555       .dwtag  DW_TAG_member
    6696                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$19)
    6697                            .dwattr $C$DW$555, DW_AT_name("rule")
    6698                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("rule")
    6699                            .dwattr $C$DW$555, DW_AT_bit_offset(0x04)
