TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 16:40:47 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_clock.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1175                            .dwendtag $C$DW$T$171
    1176                    
    1177                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1178                            .dwattr $C$DW$T$172, DW_AT_name("tFlashStateCommandsType")
    1179                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
    1180                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1181                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1182                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
    1183                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
    1184                    
    1185                    
    1186                    $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
    1187                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    1188                    $C$DW$60        .dwtag  DW_TAG_enumerator
    1189                            .dwattr $C$DW$60, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1190                            .dwattr $C$DW$60, DW_AT_const_value(0xe0)
    1191                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1192                            .dwattr $C$DW$60, DW_AT_decl_line(0x3de)
    1193                            .dwattr $C$DW$60, DW_AT_decl_column(0x04)
    1194                    
    1195                    $C$DW$61        .dwtag  DW_TAG_enumerator
    1196                            .dwattr $C$DW$61, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1197                            .dwattr $C$DW$61, DW_AT_const_value(0xe1)
    1198                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1199                            .dwattr $C$DW$61, DW_AT_decl_line(0x3e0)
    1200                            .dwattr $C$DW$61, DW_AT_decl_column(0x04)
    1201                    
    1202                    $C$DW$62        .dwtag  DW_TAG_enumerator
    1203                            .dwattr $C$DW$62, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1204                            .dwattr $C$DW$62, DW_AT_const_value(0xe2)
    1205                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   23

    1206                            .dwattr $C$DW$62, DW_AT_decl_line(0x3e2)
    1207                            .dwattr $C$DW$62, DW_AT_decl_column(0x04)
    1208                    
    1209                    $C$DW$63        .dwtag  DW_TAG_enumerator
    1210                            .dwattr $C$DW$63, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1211                            .dwattr $C$DW$63, DW_AT_const_value(0xe3)
    1212                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1213                            .dwattr $C$DW$63, DW_AT_decl_line(0x3e4)
    1214                            .dwattr $C$DW$63, DW_AT_decl_column(0x04)
    1215                    
    1216                    $C$DW$64        .dwtag  DW_TAG_enumerator
    1217                            .dwattr $C$DW$64, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1218                            .dwattr $C$DW$64, DW_AT_const_value(0xe4)
    1219                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1220                            .dwattr $C$DW$64, DW_AT_decl_line(0x3e6)
    1221                            .dwattr $C$DW$64, DW_AT_decl_column(0x04)
    1222                    
    1223                    $C$DW$65        .dwtag  DW_TAG_enumerator
    1224                            .dwattr $C$DW$65, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1225                            .dwattr $C$DW$65, DW_AT_const_value(0xe5)
    1226                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1227                            .dwattr $C$DW$65, DW_AT_decl_line(0x3e8)
    1228                            .dwattr $C$DW$65, DW_AT_decl_column(0x04)
    1229                    
    1230                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1231                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x3dc)
    1232                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x01)
    1233                            .dwendtag $C$DW$T$173
    1234                    
    1235                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1236                            .dwattr $C$DW$T$174, DW_AT_name("ICall_RemotiCmdEvent_t")
    1237                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    1238                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1239                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1240                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x3e9)
    1241                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x02)
    1242                    
    1243                    
    1244                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1245                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1246                    $C$DW$66        .dwtag  DW_TAG_member
    1247                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1248                            .dwattr $C$DW$66, DW_AT_name("seconds")
    1249                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("seconds")
    1250                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1252                            .dwattr $C$DW$66, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1253                            .dwattr $C$DW$66, DW_AT_decl_line(0x50)
    1254                            .dwattr $C$DW$66, DW_AT_decl_column(0x09)
    1255                    
    1256                    $C$DW$67        .dwtag  DW_TAG_member
    1257                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1258                            .dwattr $C$DW$67, DW_AT_name("minutes")
    1259                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("minutes")
    1260                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   24

    1261                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1262                            .dwattr $C$DW$67, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1263                            .dwattr $C$DW$67, DW_AT_decl_line(0x51)
    1264                            .dwattr $C$DW$67, DW_AT_decl_column(0x09)
    1265                    
    1266                    $C$DW$68        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1268                            .dwattr $C$DW$68, DW_AT_name("hour")
    1269                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("hour")
    1270                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1271                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1272                            .dwattr $C$DW$68, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1273                            .dwattr $C$DW$68, DW_AT_decl_line(0x52)
    1274                            .dwattr $C$DW$68, DW_AT_decl_column(0x09)
    1275                    
    1276                    $C$DW$69        .dwtag  DW_TAG_member
    1277                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1278                            .dwattr $C$DW$69, DW_AT_name("day")
    1279                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("day")
    1280                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1281                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1282                            .dwattr $C$DW$69, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1283                            .dwattr $C$DW$69, DW_AT_decl_line(0x53)
    1284                            .dwattr $C$DW$69, DW_AT_decl_column(0x09)
    1285                    
    1286                    $C$DW$70        .dwtag  DW_TAG_member
    1287                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1288                            .dwattr $C$DW$70, DW_AT_name("month")
    1289                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("month")
    1290                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1291                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1292                            .dwattr $C$DW$70, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1293                            .dwattr $C$DW$70, DW_AT_decl_line(0x54)
    1294                            .dwattr $C$DW$70, DW_AT_decl_column(0x09)
    1295                    
    1296                    $C$DW$71        .dwtag  DW_TAG_member
    1297                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1298                            .dwattr $C$DW$71, DW_AT_name("year")
    1299                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("year")
    1300                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1301                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1302                            .dwattr $C$DW$71, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1303                            .dwattr $C$DW$71, DW_AT_decl_line(0x55)
    1304                            .dwattr $C$DW$71, DW_AT_decl_column(0x0a)
    1305                    
    1306                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1307                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x4f)
    1308                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    1309                            .dwendtag $C$DW$T$21
    1310                    
    1311                    $C$DW$T$175     .dwtag  DW_TAG_typedef
    1312                            .dwattr $C$DW$T$175, DW_AT_name("UTCTimeStruct")
    1313                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$21)
    1314                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    1315                            .dwattr $C$DW$T$175, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   25

    1316                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x56)
    1317                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x03)
    1318                    
    1319                    $C$DW$T$176     .dwtag  DW_TAG_pointer_type
    1320                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    1321                            .dwattr $C$DW$T$176, DW_AT_address_class(0x20)
    1322                    
    1323                    $C$DW$T$177     .dwtag  DW_TAG_const_type
    1324                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    1325                    
    1326                    
    1327                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1328                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x4c)
    1329                    $C$DW$72        .dwtag  DW_TAG_member
    1330                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
    1331                            .dwattr $C$DW$72, DW_AT_name("Crc32")
    1332                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("Crc32")
    1333                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1335                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1336                            .dwattr $C$DW$72, DW_AT_decl_line(0x76)
    1337                            .dwattr $C$DW$72, DW_AT_decl_column(0x25)
    1338                    
    1339                    $C$DW$73        .dwtag  DW_TAG_member
    1340                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$30)
    1341                            .dwattr $C$DW$73, DW_AT_name("FlashGetSize")
    1342                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("FlashGetSize")
    1343                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1344                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1345                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1346                            .dwattr $C$DW$73, DW_AT_decl_line(0x77)
    1347                            .dwattr $C$DW$73, DW_AT_decl_column(0x25)
    1348                    
    1349                    $C$DW$74        .dwtag  DW_TAG_member
    1350                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$31)
    1351                            .dwattr $C$DW$74, DW_AT_name("GetChipId")
    1352                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("GetChipId")
    1353                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1354                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1355                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1356                            .dwattr $C$DW$74, DW_AT_decl_line(0x78)
    1357                            .dwattr $C$DW$74, DW_AT_decl_column(0x25)
    1358                    
    1359                    $C$DW$75        .dwtag  DW_TAG_member
    1360                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$34)
    1361                            .dwattr $C$DW$75, DW_AT_name("ReservedLocation1")
    1362                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("ReservedLocation1")
    1363                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1364                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1365                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1366                            .dwattr $C$DW$75, DW_AT_decl_line(0x79)
    1367                            .dwattr $C$DW$75, DW_AT_decl_column(0x25)
    1368                    
    1369                    $C$DW$76        .dwtag  DW_TAG_member
    1370                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$35)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   26

    1371                            .dwattr $C$DW$76, DW_AT_name("ReservedLocation2")
    1372                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("ReservedLocation2")
    1373                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1374                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1375                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1376                            .dwattr $C$DW$76, DW_AT_decl_line(0x7a)
    1377                            .dwattr $C$DW$76, DW_AT_decl_column(0x25)
    1378                    
    1379                    $C$DW$77        .dwtag  DW_TAG_member
    1380                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$36)
    1381                            .dwattr $C$DW$77, DW_AT_name("ReservedLocation3")
    1382                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("ReservedLocation3")
    1383                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1384                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1385                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1386                            .dwattr $C$DW$77, DW_AT_decl_line(0x7b)
    1387                            .dwattr $C$DW$77, DW_AT_decl_column(0x25)
    1388                    
    1389                    $C$DW$78        .dwtag  DW_TAG_member
    1390                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$39)
    1391                            .dwattr $C$DW$78, DW_AT_name("ResetDevice")
    1392                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("ResetDevice")
    1393                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1394                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1395                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1396                            .dwattr $C$DW$78, DW_AT_decl_line(0x7c)
    1397                            .dwattr $C$DW$78, DW_AT_decl_column(0x25)
    1398                    
    1399                    $C$DW$79        .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$44)
    1401                            .dwattr $C$DW$79, DW_AT_name("Fletcher32")
    1402                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("Fletcher32")
    1403                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1404                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1406                            .dwattr $C$DW$79, DW_AT_decl_line(0x7d)
    1407                            .dwattr $C$DW$79, DW_AT_decl_column(0x25)
    1408                    
    1409                    $C$DW$80        .dwtag  DW_TAG_member
    1410                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$48)
    1411                            .dwattr $C$DW$80, DW_AT_name("MinValue")
    1412                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("MinValue")
    1413                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1414                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1415                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1416                            .dwattr $C$DW$80, DW_AT_decl_line(0x7e)
    1417                            .dwattr $C$DW$80, DW_AT_decl_column(0x25)
    1418                    
    1419                    $C$DW$81        .dwtag  DW_TAG_member
    1420                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$49)
    1421                            .dwattr $C$DW$81, DW_AT_name("MaxValue")
    1422                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("MaxValue")
    1423                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1424                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1425                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   27

    1426                            .dwattr $C$DW$81, DW_AT_decl_line(0x7f)
    1427                            .dwattr $C$DW$81, DW_AT_decl_column(0x25)
    1428                    
    1429                    $C$DW$82        .dwtag  DW_TAG_member
    1430                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$50)
    1431                            .dwattr $C$DW$82, DW_AT_name("MeanValue")
    1432                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("MeanValue")
    1433                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1434                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1435                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1436                            .dwattr $C$DW$82, DW_AT_decl_line(0x80)
    1437                            .dwattr $C$DW$82, DW_AT_decl_column(0x25)
    1438                    
    1439                    $C$DW$83        .dwtag  DW_TAG_member
    1440                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$51)
    1441                            .dwattr $C$DW$83, DW_AT_name("StandDeviationValue")
    1442                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("StandDeviationValue")
    1443                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1444                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1445                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1446                            .dwattr $C$DW$83, DW_AT_decl_line(0x81)
    1447                            .dwattr $C$DW$83, DW_AT_decl_column(0x25)
    1448                    
    1449                    $C$DW$84        .dwtag  DW_TAG_member
    1450                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$54)
    1451                            .dwattr $C$DW$84, DW_AT_name("ReservedLocation4")
    1452                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("ReservedLocation4")
    1453                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1454                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1455                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1456                            .dwattr $C$DW$84, DW_AT_decl_line(0x82)
    1457                            .dwattr $C$DW$84, DW_AT_decl_column(0x25)
    1458                    
    1459                    $C$DW$85        .dwtag  DW_TAG_member
    1460                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$55)
    1461                            .dwattr $C$DW$85, DW_AT_name("ReservedLocation5")
    1462                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("ReservedLocation5")
    1463                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1464                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1465                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1466                            .dwattr $C$DW$85, DW_AT_decl_line(0x83)
    1467                            .dwattr $C$DW$85, DW_AT_decl_column(0x25)
    1468                    
    1469                    $C$DW$86        .dwtag  DW_TAG_member
    1470                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$56)
    1471                            .dwattr $C$DW$86, DW_AT_name("HFSourceSafeSwitch")
    1472                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1473                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1474                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1475                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1476                            .dwattr $C$DW$86, DW_AT_decl_line(0x84)
    1477                            .dwattr $C$DW$86, DW_AT_decl_column(0x25)
    1478                    
    1479                    $C$DW$87        .dwtag  DW_TAG_member
    1480                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$59)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   28

    1481                            .dwattr $C$DW$87, DW_AT_name("SelectCompAInput")
    1482                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("SelectCompAInput")
    1483                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1484                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1485                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1486                            .dwattr $C$DW$87, DW_AT_decl_line(0x85)
    1487                            .dwattr $C$DW$87, DW_AT_decl_column(0x25)
    1488                    
    1489                    $C$DW$88        .dwtag  DW_TAG_member
    1490                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$60)
    1491                            .dwattr $C$DW$88, DW_AT_name("SelectCompARef")
    1492                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("SelectCompARef")
    1493                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1494                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1495                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1496                            .dwattr $C$DW$88, DW_AT_decl_line(0x86)
    1497                            .dwattr $C$DW$88, DW_AT_decl_column(0x25)
    1498                    
    1499                    $C$DW$89        .dwtag  DW_TAG_member
    1500                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$61)
    1501                            .dwattr $C$DW$89, DW_AT_name("SelectADCCompBInput")
    1502                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1503                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1504                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1505                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1506                            .dwattr $C$DW$89, DW_AT_decl_line(0x87)
    1507                            .dwattr $C$DW$89, DW_AT_decl_column(0x25)
    1508                    
    1509                    $C$DW$90        .dwtag  DW_TAG_member
    1510                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$62)
    1511                            .dwattr $C$DW$90, DW_AT_name("SelectCompBRef")
    1512                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("SelectCompBRef")
    1513                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1514                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1515                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
    1516                            .dwattr $C$DW$90, DW_AT_decl_line(0x88)
    1517                            .dwattr $C$DW$90, DW_AT_decl_column(0x25)
    1518                    
    1519                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1520                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x75)
    1521                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    1522                            .dwendtag $C$DW$T$63
    1523                    
    1524                    $C$DW$T$180     .dwtag  DW_TAG_typedef
    1525                            .dwattr $C$DW$T$180, DW_AT_name("HARD_API_T")
    1526                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$63)
    1527                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    1528                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    1529                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x89)
    1530                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x03)
    1531                    
    1532                    
    1533                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    1534                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
    1535                    $C$DW$91        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   29

    1536                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$10)
    1537                            .dwattr $C$DW$91, DW_AT_name("quot")
    1538                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("quot")
    1539                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1541                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
    1542                            .dwattr $C$DW$91, DW_AT_decl_line(0x5c)
    1543                            .dwattr $C$DW$91, DW_AT_decl_column(0x16)
    1544                    
    1545                    $C$DW$92        .dwtag  DW_TAG_member
    1546                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$10)
    1547                            .dwattr $C$DW$92, DW_AT_name("rem")
    1548                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("rem")
    1549                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1550                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1551                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
    1552                            .dwattr $C$DW$92, DW_AT_decl_line(0x5c)
    1553                            .dwattr $C$DW$92, DW_AT_decl_column(0x1c)
    1554                    
    1555                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    1556                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5c)
    1557                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
    1558                            .dwendtag $C$DW$T$64
    1559                    
    1560                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1561                            .dwattr $C$DW$T$181, DW_AT_name("div_t")
    1562                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$64)
    1563                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1564                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1565                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x5c)
    1566                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x23)
    1567                    
    1568                    
    1569                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1570                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
    1571                    $C$DW$93        .dwtag  DW_TAG_member
    1572                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$10)
    1573                            .dwattr $C$DW$93, DW_AT_name("quot")
    1574                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("quot")
    1575                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1577                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
    1578                            .dwattr $C$DW$93, DW_AT_decl_line(0x5e)
    1579                            .dwattr $C$DW$93, DW_AT_decl_column(0x16)
    1580                    
    1581                    $C$DW$94        .dwtag  DW_TAG_member
    1582                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$10)
    1583                            .dwattr $C$DW$94, DW_AT_name("rem")
    1584                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("rem")
    1585                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1586                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1587                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
    1588                            .dwattr $C$DW$94, DW_AT_decl_line(0x5e)
    1589                            .dwattr $C$DW$94, DW_AT_decl_column(0x1c)
    1590                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   30

    1591                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    1592                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x5e)
    1593                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    1594                            .dwendtag $C$DW$T$65
    1595                    
    1596                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1597                            .dwattr $C$DW$T$182, DW_AT_name("ldiv_t")
    1598                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$65)
    1599                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1600                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1601                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x5e)
    1602                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x23)
    1603                    
    1604                    
    1605                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    1606                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
    1607                    $C$DW$95        .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$14)
    1609                            .dwattr $C$DW$95, DW_AT_name("quot")
    1610                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("quot")
    1611                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
    1614                            .dwattr $C$DW$95, DW_AT_decl_line(0x61)
    1615                            .dwattr $C$DW$95, DW_AT_decl_column(0x1c)
    1616                    
    1617                    $C$DW$96        .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$14)
    1619                            .dwattr $C$DW$96, DW_AT_name("rem")
    1620                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("rem")
    1621                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1622                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1623                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
    1624                            .dwattr $C$DW$96, DW_AT_decl_line(0x61)
    1625                            .dwattr $C$DW$96, DW_AT_decl_column(0x22)
    1626                    
    1627                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    1628                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x61)
    1629                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    1630                            .dwendtag $C$DW$T$66
    1631                    
    1632                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1633                            .dwattr $C$DW$T$183, DW_AT_name("lldiv_t")
    1634                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$66)
    1635                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1636                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1637                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x61)
    1638                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x29)
    1639                    
    1640                    
    1641                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1642                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1643                    $C$DW$97        .dwtag  DW_TAG_member
    1644                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$68)
    1645                            .dwattr $C$DW$97, DW_AT_name("pointerStack")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   31

    1646                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("pointerStack")
    1647                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1650                            .dwattr $C$DW$97, DW_AT_decl_line(0x3f5)
    1651                            .dwattr $C$DW$97, DW_AT_decl_column(0x16)
    1652                    
    1653                    $C$DW$98        .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$69)
    1655                            .dwattr $C$DW$98, DW_AT_name("directAPI")
    1656                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("directAPI")
    1657                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1658                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1659                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1660                            .dwattr $C$DW$98, DW_AT_decl_line(0x3f6)
    1661                            .dwattr $C$DW$98, DW_AT_decl_column(0x15)
    1662                    
    1663                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1664                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x3f4)
    1665                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    1666                            .dwendtag $C$DW$T$70
    1667                    
    1668                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    1669                            .dwattr $C$DW$T$72, DW_AT_name("icall_directAPIMsg_t")
    1670                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$70)
    1671                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1672                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1673                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3f7)
    1674                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1675                    
    1676                    
    1677                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    1678                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x14)
    1679                    $C$DW$99        .dwtag  DW_TAG_member
    1680                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$71)
    1681                            .dwattr $C$DW$99, DW_AT_name("hdr")
    1682                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("hdr")
    1683                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1686                            .dwattr $C$DW$99, DW_AT_decl_line(0x3fb)
    1687                            .dwattr $C$DW$99, DW_AT_decl_column(0x10)
    1688                    
    1689                    $C$DW$100       .dwtag  DW_TAG_member
    1690                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$72)
    1691                            .dwattr $C$DW$100, DW_AT_name("msg")
    1692                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("msg")
    1693                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1694                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1695                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1696                            .dwattr $C$DW$100, DW_AT_decl_line(0x3fc)
    1697                            .dwattr $C$DW$100, DW_AT_decl_column(0x1a)
    1698                    
    1699                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1700                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x3fa)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   32

    1701                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    1702                            .dwendtag $C$DW$T$73
    1703                    
    1704                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1705                            .dwattr $C$DW$T$184, DW_AT_name("icallLiteMsg_t")
    1706                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$73)
    1707                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1708                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1709                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x3fd)
    1710                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
    1711                    
    1712                    
    1713                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1714                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x0c)
    1715                    $C$DW$101       .dwtag  DW_TAG_member
    1716                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$74)
    1717                            .dwattr $C$DW$101, DW_AT_name("bufferHead")
    1718                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("bufferHead")
    1719                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1722                            .dwattr $C$DW$101, DW_AT_decl_line(0x80)
    1723                            .dwattr $C$DW$101, DW_AT_decl_column(0x13)
    1724                    
    1725                    $C$DW$102       .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$74)
    1727                            .dwattr $C$DW$102, DW_AT_name("bufferTail")
    1728                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("bufferTail")
    1729                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1730                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1731                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1732                            .dwattr $C$DW$102, DW_AT_decl_line(0x81)
    1733                            .dwattr $C$DW$102, DW_AT_decl_column(0x13)
    1734                    
    1735                    $C$DW$103       .dwtag  DW_TAG_member
    1736                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1737                            .dwattr $C$DW$103, DW_AT_name("maxBufSize")
    1738                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("maxBufSize")
    1739                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1740                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1741                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1742                            .dwattr $C$DW$103, DW_AT_decl_line(0x82)
    1743                            .dwattr $C$DW$103, DW_AT_decl_column(0x0a)
    1744                    
    1745                    $C$DW$104       .dwtag  DW_TAG_member
    1746                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$75)
    1747                            .dwattr $C$DW$104, DW_AT_name("pBuffer")
    1748                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("pBuffer")
    1749                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1750                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1751                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1752                            .dwattr $C$DW$104, DW_AT_decl_line(0x83)
    1753                            .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    1754                    
    1755                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   33

    1756                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x7e)
    1757                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1758                            .dwendtag $C$DW$T$76
    1759                    
    1760                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1761                            .dwattr $C$DW$T$78, DW_AT_name("halUARTBufControl_t")
    1762                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1763                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1764                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1765                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x84)
    1766                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1767                    
    1768                    
    1769                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1770                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x2c)
    1771                    $C$DW$105       .dwtag  DW_TAG_member
    1772                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$77)
    1773                            .dwattr $C$DW$105, DW_AT_name("configured")
    1774                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("configured")
    1775                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1777                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1778                            .dwattr $C$DW$105, DW_AT_decl_line(0x88)
    1779                            .dwattr $C$DW$105, DW_AT_decl_column(0x17)
    1780                    
    1781                    $C$DW$106       .dwtag  DW_TAG_member
    1782                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1783                            .dwattr $C$DW$106, DW_AT_name("baudRate")
    1784                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("baudRate")
    1785                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1786                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1787                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1788                            .dwattr $C$DW$106, DW_AT_decl_line(0x89)
    1789                            .dwattr $C$DW$106, DW_AT_decl_column(0x17)
    1790                    
    1791                    $C$DW$107       .dwtag  DW_TAG_member
    1792                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$77)
    1793                            .dwattr $C$DW$107, DW_AT_name("flowControl")
    1794                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("flowControl")
    1795                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1796                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1797                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1798                            .dwattr $C$DW$107, DW_AT_decl_line(0x8a)
    1799                            .dwattr $C$DW$107, DW_AT_decl_column(0x17)
    1800                    
    1801                    $C$DW$108       .dwtag  DW_TAG_member
    1802                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1803                            .dwattr $C$DW$108, DW_AT_name("flowControlThreshold")
    1804                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("flowControlThreshold")
    1805                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1806                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1807                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1808                            .dwattr $C$DW$108, DW_AT_decl_line(0x8b)
    1809                            .dwattr $C$DW$108, DW_AT_decl_column(0x17)
    1810                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   34

    1811                    $C$DW$109       .dwtag  DW_TAG_member
    1812                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1813                            .dwattr $C$DW$109, DW_AT_name("idleTimeout")
    1814                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("idleTimeout")
    1815                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1816                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1817                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1818                            .dwattr $C$DW$109, DW_AT_decl_line(0x8c)
    1819                            .dwattr $C$DW$109, DW_AT_decl_column(0x17)
    1820                    
    1821                    $C$DW$110       .dwtag  DW_TAG_member
    1822                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$78)
    1823                            .dwattr $C$DW$110, DW_AT_name("rx")
    1824                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("rx")
    1825                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1826                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1827                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1828                            .dwattr $C$DW$110, DW_AT_decl_line(0x8d)
    1829                            .dwattr $C$DW$110, DW_AT_decl_column(0x17)
    1830                    
    1831                    $C$DW$111       .dwtag  DW_TAG_member
    1832                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$78)
    1833                            .dwattr $C$DW$111, DW_AT_name("tx")
    1834                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("tx")
    1835                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1836                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1837                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1838                            .dwattr $C$DW$111, DW_AT_decl_line(0x8e)
    1839                            .dwattr $C$DW$111, DW_AT_decl_column(0x17)
    1840                    
    1841                    $C$DW$112       .dwtag  DW_TAG_member
    1842                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$77)
    1843                            .dwattr $C$DW$112, DW_AT_name("intEnable")
    1844                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("intEnable")
    1845                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1846                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1847                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1848                            .dwattr $C$DW$112, DW_AT_decl_line(0x8f)
    1849                            .dwattr $C$DW$112, DW_AT_decl_column(0x17)
    1850                    
    1851                    $C$DW$113       .dwtag  DW_TAG_member
    1852                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$79)
    1853                            .dwattr $C$DW$113, DW_AT_name("rxChRvdTime")
    1854                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("rxChRvdTime")
    1855                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1856                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1857                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1858                            .dwattr $C$DW$113, DW_AT_decl_line(0x90)
    1859                            .dwattr $C$DW$113, DW_AT_decl_column(0x17)
    1860                    
    1861                    $C$DW$114       .dwtag  DW_TAG_member
    1862                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$82)
    1863                            .dwattr $C$DW$114, DW_AT_name("callBackFunc")
    1864                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("callBackFunc")
    1865                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   35

    1866                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1867                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1868                            .dwattr $C$DW$114, DW_AT_decl_line(0x91)
    1869                            .dwattr $C$DW$114, DW_AT_decl_column(0x17)
    1870                    
    1871                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1872                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x87)
    1873                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1874                            .dwendtag $C$DW$T$83
    1875                    
    1876                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    1877                            .dwattr $C$DW$T$185, DW_AT_name("halUARTCfg_t")
    1878                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$83)
    1879                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    1880                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1881                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x92)
    1882                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x02)
    1883                    
    1884                    
    1885                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    1886                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1887                    $C$DW$115       .dwtag  DW_TAG_member
    1888                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1889                            .dwattr $C$DW$115, DW_AT_name("event")
    1890                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("event")
    1891                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1893                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1894                            .dwattr $C$DW$115, DW_AT_decl_line(0x79)
    1895                            .dwattr $C$DW$115, DW_AT_decl_column(0x0a)
    1896                    
    1897                    $C$DW$116       .dwtag  DW_TAG_member
    1898                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1899                            .dwattr $C$DW$116, DW_AT_name("status")
    1900                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("status")
    1901                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1902                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1904                            .dwattr $C$DW$116, DW_AT_decl_line(0x7a)
    1905                            .dwattr $C$DW$116, DW_AT_decl_column(0x0a)
    1906                    
    1907                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1908                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x78)
    1909                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    1910                            .dwendtag $C$DW$T$84
    1911                    
    1912                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1913                            .dwattr $C$DW$T$85, DW_AT_name("osal_event_hdr_t")
    1914                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1915                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1916                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1917                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7b)
    1918                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1919                    
    1920                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   36

    1921                    $C$DW$T$86      .dwtag  DW_TAG_structure_type
    1922                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    1923                    $C$DW$117       .dwtag  DW_TAG_member
    1924                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$85)
    1925                            .dwattr $C$DW$117, DW_AT_name("hdr")
    1926                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("hdr")
    1927                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1929                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    1930                            .dwattr $C$DW$117, DW_AT_decl_line(0xbc)
    1931                            .dwattr $C$DW$117, DW_AT_decl_column(0x14)
    1932                    
    1933                    $C$DW$118       .dwtag  DW_TAG_member
    1934                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1935                            .dwattr $C$DW$118, DW_AT_name("state")
    1936                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("state")
    1937                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1938                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1939                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    1940                            .dwattr $C$DW$118, DW_AT_decl_line(0xbd)
    1941                            .dwattr $C$DW$118, DW_AT_decl_column(0x09)
    1942                    
    1943                    $C$DW$119       .dwtag  DW_TAG_member
    1944                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1945                            .dwattr $C$DW$119, DW_AT_name("keys")
    1946                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("keys")
    1947                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1948                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1949                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    1950                            .dwattr $C$DW$119, DW_AT_decl_line(0xbe)
    1951                            .dwattr $C$DW$119, DW_AT_decl_column(0x09)
    1952                    
    1953                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    1954                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xbb)
    1955                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1956                            .dwendtag $C$DW$T$86
    1957                    
    1958                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1959                            .dwattr $C$DW$T$186, DW_AT_name("keyChange_t")
    1960                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$86)
    1961                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1962                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    1963                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xbf)
    1964                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1965                    
    1966                    
    1967                    $C$DW$T$91      .dwtag  DW_TAG_union_type
    1968                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1969                    $C$DW$120       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$88)
    1971                            .dwattr $C$DW$120, DW_AT_name("entityId")
    1972                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("entityId")
    1973                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   37

    1976                            .dwattr $C$DW$120, DW_AT_decl_line(0x1fe)
    1977                            .dwattr $C$DW$120, DW_AT_decl_column(0x14)
    1978                    
    1979                    $C$DW$121       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$90)
    1981                            .dwattr $C$DW$121, DW_AT_name("servId")
    1982                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("servId")
    1983                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1986                            .dwattr $C$DW$121, DW_AT_decl_line(0x200)
    1987                            .dwattr $C$DW$121, DW_AT_decl_column(0x17)
    1988                    
    1989                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1990                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x1fc)
    1991                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1992                            .dwendtag $C$DW$T$91
    1993                    
    1994                    
    1995                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    1996                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    1997                    $C$DW$122       .dwtag  DW_TAG_member
    1998                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$90)
    1999                            .dwattr $C$DW$122, DW_AT_name("servId")
    2000                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("servId")
    2001                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2003                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2004                            .dwattr $C$DW$122, DW_AT_decl_line(0x211)
    2005                            .dwattr $C$DW$122, DW_AT_decl_column(0x17)
    2006                    
    2007                    $C$DW$123       .dwtag  DW_TAG_member
    2008                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$88)
    2009                            .dwattr $C$DW$123, DW_AT_name("entityId")
    2010                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("entityId")
    2011                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2013                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2014                            .dwattr $C$DW$123, DW_AT_decl_line(0x213)
    2015                            .dwattr $C$DW$123, DW_AT_decl_column(0x14)
    2016                    
    2017                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2018                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x20f)
    2019                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    2020                            .dwendtag $C$DW$T$92
    2021                    
    2022                    
    2023                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    2024                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    2025                    $C$DW$124       .dwtag  DW_TAG_member
    2026                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$77)
    2027                            .dwattr $C$DW$124, DW_AT_name("paramCTS")
    2028                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("paramCTS")
    2029                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   38

    2031                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2032                            .dwattr $C$DW$124, DW_AT_decl_line(0x96)
    2033                            .dwattr $C$DW$124, DW_AT_decl_column(0x08)
    2034                    
    2035                    $C$DW$125       .dwtag  DW_TAG_member
    2036                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$77)
    2037                            .dwattr $C$DW$125, DW_AT_name("paramRTS")
    2038                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("paramRTS")
    2039                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2041                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2042                            .dwattr $C$DW$125, DW_AT_decl_line(0x97)
    2043                            .dwattr $C$DW$125, DW_AT_decl_column(0x08)
    2044                    
    2045                    $C$DW$126       .dwtag  DW_TAG_member
    2046                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$77)
    2047                            .dwattr $C$DW$126, DW_AT_name("paramDSR")
    2048                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("paramDSR")
    2049                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2052                            .dwattr $C$DW$126, DW_AT_decl_line(0x98)
    2053                            .dwattr $C$DW$126, DW_AT_decl_column(0x08)
    2054                    
    2055                    $C$DW$127       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$77)
    2057                            .dwattr $C$DW$127, DW_AT_name("paramDTR")
    2058                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("paramDTR")
    2059                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2061                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2062                            .dwattr $C$DW$127, DW_AT_decl_line(0x99)
    2063                            .dwattr $C$DW$127, DW_AT_decl_column(0x08)
    2064                    
    2065                    $C$DW$128       .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$77)
    2067                            .dwattr $C$DW$128, DW_AT_name("paramCD")
    2068                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("paramCD")
    2069                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2072                            .dwattr $C$DW$128, DW_AT_decl_line(0x9a)
    2073                            .dwattr $C$DW$128, DW_AT_decl_column(0x08)
    2074                    
    2075                    $C$DW$129       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$77)
    2077                            .dwattr $C$DW$129, DW_AT_name("paramRI")
    2078                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("paramRI")
    2079                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2081                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2082                            .dwattr $C$DW$129, DW_AT_decl_line(0x9b)
    2083                            .dwattr $C$DW$129, DW_AT_decl_column(0x08)
    2084                    
    2085                    $C$DW$130       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   39

    2086                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    2087                            .dwattr $C$DW$130, DW_AT_name("baudRate")
    2088                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("baudRate")
    2089                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2091                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2092                            .dwattr $C$DW$130, DW_AT_decl_line(0x9c)
    2093                            .dwattr $C$DW$130, DW_AT_decl_column(0x0a)
    2094                    
    2095                    $C$DW$131       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$77)
    2097                            .dwattr $C$DW$131, DW_AT_name("flowControl")
    2098                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("flowControl")
    2099                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2102                            .dwattr $C$DW$131, DW_AT_decl_line(0x9d)
    2103                            .dwattr $C$DW$131, DW_AT_decl_column(0x08)
    2104                    
    2105                    $C$DW$132       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$77)
    2107                            .dwattr $C$DW$132, DW_AT_name("flushControl")
    2108                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("flushControl")
    2109                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2110                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2112                            .dwattr $C$DW$132, DW_AT_decl_line(0x9e)
    2113                            .dwattr $C$DW$132, DW_AT_decl_column(0x08)
    2114                    
    2115                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2116                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x95)
    2117                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2118                            .dwendtag $C$DW$T$93
    2119                    
    2120                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    2121                            .dwattr $C$DW$T$187, DW_AT_name("halUARTIoctl_t")
    2122                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$93)
    2123                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    2124                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2125                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x9f)
    2126                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x02)
    2127                    
    2128                    
    2129                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    2130                            .dwattr $C$DW$T$94, DW_AT_name(".ggroup1")
    2131                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x08)
    2132                    $C$DW$133       .dwtag  DW_TAG_member
    2133                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2134                            .dwattr $C$DW$133, DW_AT_name("timeMSec")
    2135                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("timeMSec")
    2136                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2138                    
    2139                    $C$DW$134       .dwtag  DW_TAG_member
    2140                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   40

    2141                            .dwattr $C$DW$134, DW_AT_name("OSAL_timeSeconds")
    2142                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("OSAL_timeSeconds")
    2143                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2144                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2145                    
    2146                            .dwendtag $C$DW$T$94
    2147                    
    2148                    
    2149                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    2150                            .dwattr $C$DW$T$95, DW_AT_name("_ICall_LiteCmdStatus_")
    2151                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    2152                    $C$DW$135       .dwtag  DW_TAG_member
    2153                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$87)
    2154                            .dwattr $C$DW$135, DW_AT_name("cmdId")
    2155                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("cmdId")
    2156                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2158                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2159                            .dwattr $C$DW$135, DW_AT_decl_line(0x3f0)
    2160                            .dwattr $C$DW$135, DW_AT_decl_column(0x11)
    2161                    
    2162                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2163                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x3ee)
    2164                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    2165                            .dwendtag $C$DW$T$95
    2166                    
    2167                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    2168                            .dwattr $C$DW$T$189, DW_AT_name("ICall_LiteCmdStatus")
    2169                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$95)
    2170                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    2171                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2172                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x3f1)
    2173                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    2174                    
    2175                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2176                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2177                    
    2178                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2179                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2180                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2181                    
    2182                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    2183                            .dwattr $C$DW$T$190, DW_AT_name("ICall_Semaphore")
    2184                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$3)
    2185                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    2186                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2187                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x1ac)
    2188                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x0f)
    2189                    
    2190                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    2191                            .dwattr $C$DW$T$109, DW_AT_name("ICall_SyncHandle")
    2192                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$3)
    2193                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2194                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2195                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x1aa)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   41

    2196                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0f)
    2197                    
    2198                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    2199                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerID")
    2200                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$3)
    2201                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    2202                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2203                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1b7)
    2204                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x0f)
    2205                    
    2206                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    2207                            .dwattr $C$DW$T$191, DW_AT_name("osal_msg_q_t")
    2208                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$3)
    2209                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    2210                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2211                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x7d)
    2212                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x10)
    2213                    
    2214                    
    2215                    $C$DW$T$37      .dwtag  DW_TAG_subroutine_type
    2216                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2217                            .dwendtag $C$DW$T$37
    2218                    
    2219                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2220                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2221                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    2222                    
    2223                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    2224                            .dwattr $C$DW$T$169, DW_AT_name("APPASRTINTF_callAssrtHndler")
    2225                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$38)
    2226                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    2227                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2228                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x43)
    2229                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
    2230                    
    2231                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    2232                            .dwattr $C$DW$T$56, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    2233                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$38)
    2234                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2235                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2236                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x5f)
    2237                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x19)
    2238                    
    2239                    $C$DW$T$39      .dwtag  DW_TAG_typedef
    2240                            .dwattr $C$DW$T$39, DW_AT_name("FPTR_RESETDEV_T")
    2241                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2242                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2243                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2244                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x4d)
    2245                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x19)
    2246                    
    2247                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    2248                            .dwattr $C$DW$T$192, DW_AT_name("FPTR_VOID_VOID_T")
    2249                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$38)
    2250                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   42

    2251                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    2252                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x33)
    2253                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x11)
    2254                    
    2255                    $C$DW$T$193     .dwtag  DW_TAG_typedef
    2256                            .dwattr $C$DW$T$193, DW_AT_name("__TI_atexit_fn")
    2257                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$38)
    2258                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    2259                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    2260                            .dwattr $C$DW$T$193, DW_AT_decl_line(0xb9)
    2261                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x14)
    2262                    
    2263                    
    2264                    $C$DW$T$52      .dwtag  DW_TAG_subroutine_type
    2265                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2266                    $C$DW$136       .dwtag  DW_TAG_formal_parameter
    2267                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2268                    
    2269                            .dwendtag $C$DW$T$52
    2270                    
    2271                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    2272                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2273                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    2274                    
    2275                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    2276                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESERVED4_T")
    2277                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2278                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2279                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2280                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x61)
    2281                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    2282                    
    2283                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    2284                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_RESERVED5_T")
    2285                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    2286                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2287                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2288                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x63)
    2289                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    2290                    
    2291                    
    2292                    $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    2293                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2294                    $C$DW$137       .dwtag  DW_TAG_formal_parameter
    2295                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    2296                    
    2297                            .dwendtag $C$DW$T$57
    2298                    
    2299                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2300                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2301                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2302                    
    2303                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2304                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_ADCCOMPBIN_T")
    2305                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$58)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   43

    2306                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2307                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2308                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x69)
    2309                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    2310                    
    2311                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2312                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_COMPAIN_T")
    2313                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2314                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2315                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2316                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x65)
    2317                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    2318                    
    2319                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    2320                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_COMPAREF_T")
    2321                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    2322                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2323                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2324                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x67)
    2325                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    2326                    
    2327                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2328                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_COMPBREF_T")
    2329                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$58)
    2330                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2331                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2332                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x6b)
    2333                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    2334                    
    2335                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    2336                            .dwattr $C$DW$T$194, DW_AT_name("FPTR_VOID_UINT8_T")
    2337                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$58)
    2338                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    2339                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    2340                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x34)
    2341                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x11)
    2342                    
    2343                    
    2344                    $C$DW$T$80      .dwtag  DW_TAG_subroutine_type
    2345                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2346                    $C$DW$138       .dwtag  DW_TAG_formal_parameter
    2347                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2348                    
    2349                    $C$DW$139       .dwtag  DW_TAG_formal_parameter
    2350                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2351                    
    2352                            .dwendtag $C$DW$T$80
    2353                    
    2354                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    2355                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    2356                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    2357                    
    2358                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    2359                            .dwattr $C$DW$T$195, DW_AT_name("assertCback_t")
    2360                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$81)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:47 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2D81175D-8AB9-45B7-9950-1334162CF193} PAGE   44

    2361                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    2362                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2363                            .dwattr $C$DW$T$195, DW_AT_decl_line(0xd3)
    2364                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x10)
    2365                    
    2366                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    2367                            .dwattr $C$DW$T$82, DW_AT_name("halUARTCBack_t")
    2368                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2369                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
