TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 16:40:48 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4266                            .dwattr $C$DW$432, DW_AT_const_value(0x08)
    4267                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4268                            .dwattr $C$DW$432, DW_AT_decl_line(0xa8)
    4269                            .dwattr $C$DW$432, DW_AT_decl_column(0x05)
    4270                    
    4271                    $C$DW$433       .dwtag  DW_TAG_enumerator
    4272                            .dwattr $C$DW$433, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4273                            .dwattr $C$DW$433, DW_AT_const_value(0x0e)
    4274                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4275                            .dwattr $C$DW$433, DW_AT_decl_line(0xa9)
    4276                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4277                    
    4278                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4279                            .dwattr $C$DW$434, DW_AT_name("FAPI_CLEAR_STATUS")
    4280                            .dwattr $C$DW$434, DW_AT_const_value(0x10)
    4281                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4282                            .dwattr $C$DW$434, DW_AT_decl_line(0xaa)
    4283                            .dwattr $C$DW$434, DW_AT_decl_column(0x05)
    4284                    
    4285                    $C$DW$435       .dwtag  DW_TAG_enumerator
    4286                            .dwattr $C$DW$435, DW_AT_name("FAPI_PROGRAM_RESUME")
    4287                            .dwattr $C$DW$435, DW_AT_const_value(0x14)
    4288                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4289                            .dwattr $C$DW$435, DW_AT_decl_line(0xab)
    4290                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   79

    4291                    
    4292                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4293                            .dwattr $C$DW$436, DW_AT_name("FAPI_ERASE_RESUME")
    4294                            .dwattr $C$DW$436, DW_AT_const_value(0x16)
    4295                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4296                            .dwattr $C$DW$436, DW_AT_decl_line(0xac)
    4297                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4298                    
    4299                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4300                            .dwattr $C$DW$437, DW_AT_name("FAPI_CLEAR_MORE")
    4301                            .dwattr $C$DW$437, DW_AT_const_value(0x18)
    4302                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4303                            .dwattr $C$DW$437, DW_AT_decl_line(0xad)
    4304                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4305                    
    4306                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4307                            .dwattr $C$DW$438, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4308                            .dwattr $C$DW$438, DW_AT_const_value(0x20)
    4309                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4310                            .dwattr $C$DW$438, DW_AT_decl_line(0xae)
    4311                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4312                    
    4313                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4314                            .dwattr $C$DW$439, DW_AT_name("FAPI_ERASE_OTP")
    4315                            .dwattr $C$DW$439, DW_AT_const_value(0x30)
    4316                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4317                            .dwattr $C$DW$439, DW_AT_decl_line(0xaf)
    4318                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4319                    
    4320                            .dwattr $C$DW$T$1058, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4321                            .dwattr $C$DW$T$1058, DW_AT_decl_line(0xa5)
    4322                            .dwattr $C$DW$T$1058, DW_AT_decl_column(0x01)
    4323                            .dwendtag $C$DW$T$1058
    4324                    
    4325                    $C$DW$T$1059    .dwtag  DW_TAG_typedef
    4326                            .dwattr $C$DW$T$1059, DW_AT_name("tFlashStateCommandsType")
    4327                            .dwattr $C$DW$T$1059, DW_AT_type(*$C$DW$T$1058)
    4328                            .dwattr $C$DW$T$1059, DW_AT_language(DW_LANG_C)
    4329                            .dwattr $C$DW$T$1059, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4330                            .dwattr $C$DW$T$1059, DW_AT_decl_line(0xb0)
    4331                            .dwattr $C$DW$T$1059, DW_AT_decl_column(0x03)
    4332                    
    4333                    
    4334                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4335                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4336                    $C$DW$440       .dwtag  DW_TAG_member
    4337                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    4338                            .dwattr $C$DW$440, DW_AT_name("rfMode")
    4339                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("rfMode")
    4340                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4341                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4342                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4343                            .dwattr $C$DW$440, DW_AT_decl_line(0x421)
    4344                            .dwattr $C$DW$440, DW_AT_decl_column(0x0d)
    4345                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   80

    4346                    $C$DW$441       .dwtag  DW_TAG_member
    4347                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    4348                            .dwattr $C$DW$441, DW_AT_name("cpePatchFxn")
    4349                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("cpePatchFxn")
    4350                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4351                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4352                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4353                            .dwattr $C$DW$441, DW_AT_decl_line(0x422)
    4354                            .dwattr $C$DW$441, DW_AT_decl_column(0x0c)
    4355                    
    4356                    $C$DW$442       .dwtag  DW_TAG_member
    4357                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$21)
    4358                            .dwattr $C$DW$442, DW_AT_name("mcePatchFxn")
    4359                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("mcePatchFxn")
    4360                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4361                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4362                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4363                            .dwattr $C$DW$442, DW_AT_decl_line(0x423)
    4364                            .dwattr $C$DW$442, DW_AT_decl_column(0x0c)
    4365                    
    4366                    $C$DW$443       .dwtag  DW_TAG_member
    4367                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$21)
    4368                            .dwattr $C$DW$443, DW_AT_name("rfePatchFxn")
    4369                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("rfePatchFxn")
    4370                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4371                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4372                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4373                            .dwattr $C$DW$443, DW_AT_decl_line(0x424)
    4374                            .dwattr $C$DW$443, DW_AT_decl_column(0x0c)
    4375                    
    4376                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4377                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    4378                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4379                            .dwendtag $C$DW$T$22
    4380                    
    4381                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4382                            .dwattr $C$DW$T$33, DW_AT_name("RF_Mode")
    4383                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$22)
    4384                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4385                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4386                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x425)
    4387                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    4388                    
    4389                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4390                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4391                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4392                    
    4393                    
    4394                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4395                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    4396                    $C$DW$444       .dwtag  DW_TAG_member
    4397                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
    4398                            .dwattr $C$DW$444, DW_AT_name("rawValue")
    4399                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("rawValue")
    4400                            .dwattr $C$DW$444, DW_AT_bit_offset(0x0a)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   81

    4401                            .dwattr $C$DW$444, DW_AT_bit_size(0x16)
    4402                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4403                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4404                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4405                            .dwattr $C$DW$444, DW_AT_decl_line(0x3d6)
    4406                            .dwattr $C$DW$444, DW_AT_decl_column(0x0e)
    4407                    
    4408                    $C$DW$445       .dwtag  DW_TAG_member
    4409                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$23)
    4410                            .dwattr $C$DW$445, DW_AT_name("__dummy")
    4411                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("__dummy")
    4412                            .dwattr $C$DW$445, DW_AT_bit_offset(0x01)
    4413                            .dwattr $C$DW$445, DW_AT_bit_size(0x09)
    4414                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4415                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4416                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4417                            .dwattr $C$DW$445, DW_AT_decl_line(0x3da)
    4418                            .dwattr $C$DW$445, DW_AT_decl_column(0x0e)
    4419                    
    4420                    $C$DW$446       .dwtag  DW_TAG_member
    4421                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
    4422                            .dwattr $C$DW$446, DW_AT_name("paType")
    4423                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("paType")
    4424                            .dwattr $C$DW$446, DW_AT_bit_offset(0x00)
    4425                            .dwattr $C$DW$446, DW_AT_bit_size(0x01)
    4426                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4427                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4428                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4429                            .dwattr $C$DW$446, DW_AT_decl_line(0x3db)
    4430                            .dwattr $C$DW$446, DW_AT_decl_column(0x0e)
    4431                    
    4432                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4433                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x3d5)
    4434                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4435                            .dwendtag $C$DW$T$24
    4436                    
    4437                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    4438                            .dwattr $C$DW$T$26, DW_AT_name("RF_TxPowerTable_Value")
    4439                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$24)
    4440                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4441                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4442                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3df)
    4443                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    4444                    
    4445                    
    4446                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4447                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x05)
    4448                    $C$DW$447       .dwtag  DW_TAG_member
    4449                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$25)
    4450                            .dwattr $C$DW$447, DW_AT_name("power")
    4451                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("power")
    4452                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4453                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4454                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4455                            .dwattr $C$DW$447, DW_AT_decl_line(0x3f5)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   82

    4456                            .dwattr $C$DW$447, DW_AT_decl_column(0x0c)
    4457                    
    4458                    $C$DW$448       .dwtag  DW_TAG_member
    4459                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$26)
    4460                            .dwattr $C$DW$448, DW_AT_name("value")
    4461                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("value")
    4462                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4463                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4464                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4465                            .dwattr $C$DW$448, DW_AT_decl_line(0x3f8)
    4466                            .dwattr $C$DW$448, DW_AT_decl_column(0x1b)
    4467                    
    4468                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4469                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3f4)
    4470                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    4471                            .dwendtag $C$DW$T$27
    4472                    
    4473                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    4474                            .dwattr $C$DW$T$28, DW_AT_name("RF_TxPowerTable_Entry")
    4475                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4476                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4477                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4478                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f9)
    4479                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x1b)
    4480                    
    4481                    $C$DW$T$29      .dwtag  DW_TAG_const_type
    4482                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4483                    
    4484                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    4485                            .dwattr $C$DW$T$30, DW_AT_name("macTxPwrVal_t")
    4486                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4487                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4488                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac
    4489                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x144)
    4490                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x25)
    4491                    
    4492                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4493                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4494                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4495                    
    4496                    
    4497                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4498                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    4499                    $C$DW$449       .dwtag  DW_TAG_member
    4500                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
    4501                            .dwattr $C$DW$449, DW_AT_name("pTxPwrVals")
    4502                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("pTxPwrVals")
    4503                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4505                            .dwattr $C$DW$449, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4506                            .dwattr $C$DW$449, DW_AT_decl_line(0x148)
    4507                            .dwattr $C$DW$449, DW_AT_decl_column(0x12)
    4508                    
    4509                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac
    4510                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x147)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   83

    4511                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4512                            .dwendtag $C$DW$T$32
    4513                    
    4514                    $C$DW$T$36      .dwtag  DW_TAG_const_type
    4515                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    4516                    
    4517                    $C$DW$T$37      .dwtag  DW_TAG_typedef
    4518                            .dwattr $C$DW$T$37, DW_AT_name("macTxPwrTbl_t")
    4519                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4520                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4521                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac
    4522                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x149)
    4523                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    4524                    
    4525                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4526                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4527                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4528                    
    4529                    
    4530                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4531                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x30)
    4532                    $C$DW$450       .dwtag  DW_TAG_member
    4533                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
    4534                            .dwattr $C$DW$450, DW_AT_name("getHwRevision")
    4535                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("getHwRevision")
    4536                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4537                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4538                            .dwattr $C$DW$450, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4539                            .dwattr $C$DW$450, DW_AT_decl_line(0x155)
    4540                            .dwattr $C$DW$450, DW_AT_decl_column(0x1c)
    4541                    
    4542                    $C$DW$451       .dwtag  DW_TAG_member
    4543                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$34)
    4544                            .dwattr $C$DW$451, DW_AT_name("pRfPatchTable")
    4545                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("pRfPatchTable")
    4546                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4547                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4548                            .dwattr $C$DW$451, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4549                            .dwattr $C$DW$451, DW_AT_decl_line(0x156)
    4550                            .dwattr $C$DW$451, DW_AT_decl_column(0x1d)
    4551                    
    4552                    $C$DW$452       .dwtag  DW_TAG_member
    4553                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$35)
    4554                            .dwattr $C$DW$452, DW_AT_name("pRfDrvTblPtr")
    4555                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4556                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4557                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4558                            .dwattr $C$DW$452, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4559                            .dwattr $C$DW$452, DW_AT_decl_line(0x157)
    4560                            .dwattr $C$DW$452, DW_AT_decl_column(0x1d)
    4561                    
    4562                    $C$DW$453       .dwtag  DW_TAG_member
    4563                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$35)
    4564                            .dwattr $C$DW$453, DW_AT_name("pCryptoDrvTblPtr")
    4565                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   84

    4566                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4567                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4568                            .dwattr $C$DW$453, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4569                            .dwattr $C$DW$453, DW_AT_decl_line(0x158)
    4570                            .dwattr $C$DW$453, DW_AT_decl_column(0x1d)
    4571                    
    4572                    $C$DW$454       .dwtag  DW_TAG_member
    4573                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$38)
    4574                            .dwattr $C$DW$454, DW_AT_name("pTxPwrTbl")
    4575                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pTxPwrTbl")
    4576                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4577                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4578                            .dwattr $C$DW$454, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4579                            .dwattr $C$DW$454, DW_AT_decl_line(0x159)
    4580                            .dwattr $C$DW$454, DW_AT_decl_column(0x20)
    4581                    
    4582                    $C$DW$455       .dwtag  DW_TAG_member
    4583                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$39)
    4584                            .dwattr $C$DW$455, DW_AT_name("pOverrides")
    4585                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("pOverrides")
    4586                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4587                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4588                            .dwattr $C$DW$455, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4589                            .dwattr $C$DW$455, DW_AT_decl_line(0x15a)
    4590                            .dwattr $C$DW$455, DW_AT_decl_column(0x1e)
    4591                    
    4592                    $C$DW$456       .dwtag  DW_TAG_member
    4593                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$40)
    4594                            .dwattr $C$DW$456, DW_AT_name("pLoDivider")
    4595                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("pLoDivider")
    4596                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4597                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4598                            .dwattr $C$DW$456, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4599                            .dwattr $C$DW$456, DW_AT_decl_line(0x15b)
    4600                            .dwattr $C$DW$456, DW_AT_decl_column(0x1d)
    4601                    
    4602                    $C$DW$457       .dwtag  DW_TAG_member
    4603                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4604                            .dwattr $C$DW$457, DW_AT_name("rfFeModeBias")
    4605                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("rfFeModeBias")
    4606                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4607                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4608                            .dwattr $C$DW$457, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4609                            .dwattr $C$DW$457, DW_AT_decl_line(0x15c)
    4610                            .dwattr $C$DW$457, DW_AT_decl_column(0x1c)
    4611                    
    4612                    $C$DW$458       .dwtag  DW_TAG_member
    4613                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    4614                            .dwattr $C$DW$458, DW_AT_name("phyId")
    4615                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("phyId")
    4616                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4617                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4618                            .dwattr $C$DW$458, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4619                            .dwattr $C$DW$458, DW_AT_decl_line(0x15d)
    4620                            .dwattr $C$DW$458, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   85

    4621                    
    4622                    $C$DW$459       .dwtag  DW_TAG_member
    4623                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    4624                            .dwattr $C$DW$459, DW_AT_name("last")
    4625                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("last")
    4626                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4627                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4628                            .dwattr $C$DW$459, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4629                            .dwattr $C$DW$459, DW_AT_decl_line(0x15e)
    4630                            .dwattr $C$DW$459, DW_AT_decl_column(0x1c)
    4631                    
    4632                    $C$DW$460       .dwtag  DW_TAG_member
    4633                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$43)
    4634                            .dwattr $C$DW$460, DW_AT_name("pSetRE")
    4635                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("pSetRE")
    4636                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4637                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4638                            .dwattr $C$DW$460, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4639                            .dwattr $C$DW$460, DW_AT_decl_line(0x15f)
    4640                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4641                    
    4642                    $C$DW$461       .dwtag  DW_TAG_member
    4643                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$44)
    4644                            .dwattr $C$DW$461, DW_AT_name("pAssertFP")
    4645                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pAssertFP")
    4646                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4647                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4648                            .dwattr $C$DW$461, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4649                            .dwattr $C$DW$461, DW_AT_decl_line(0x160)
    4650                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4651                    
    4652                    $C$DW$462       .dwtag  DW_TAG_member
    4653                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$47)
    4654                            .dwattr $C$DW$462, DW_AT_name("pAntSwitchFP")
    4655                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("pAntSwitchFP")
    4656                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4657                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4658                            .dwattr $C$DW$462, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4659                            .dwattr $C$DW$462, DW_AT_decl_line(0x161)
    4660                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4661                    
    4662                    $C$DW$463       .dwtag  DW_TAG_member
    4663                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$48)
    4664                            .dwattr $C$DW$463, DW_AT_name("pAntPwrFP")
    4665                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("pAntPwrFP")
    4666                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4667                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4668                            .dwattr $C$DW$463, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac_
    4669                            .dwattr $C$DW$463, DW_AT_decl_line(0x162)
    4670                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4671                    
    4672                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/mac
    4673                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x154)
    4674                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    4675                            .dwendtag $C$DW$T$49
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   86

    4676                    
    4677                    $C$DW$T$1061    .dwtag  DW_TAG_typedef
    4678                            .dwattr $C$DW$T$1061, DW_AT_name("macUserCfg_t")
    4679                            .dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$49)
    4680                            .dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
    4681                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/m
    4682                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x163)
    4683                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x03)
    4684                    
    4685                    $C$DW$T$1062    .dwtag  DW_TAG_pointer_type
    4686                            .dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
    4687                            .dwattr $C$DW$T$1062, DW_AT_address_class(0x20)
    4688                    
    4689                    
    4690                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4691                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    4692                    $C$DW$464       .dwtag  DW_TAG_member
    4693                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$10)
    4694                            .dwattr $C$DW$464, DW_AT_name("quot")
    4695                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("quot")
    4696                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4697                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4698                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    4699                            .dwattr $C$DW$464, DW_AT_decl_line(0x5c)
    4700                            .dwattr $C$DW$464, DW_AT_decl_column(0x16)
    4701                    
    4702                    $C$DW$465       .dwtag  DW_TAG_member
    4703                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$10)
    4704                            .dwattr $C$DW$465, DW_AT_name("rem")
    4705                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("rem")
    4706                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4707                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4708                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    4709                            .dwattr $C$DW$465, DW_AT_decl_line(0x5c)
    4710                            .dwattr $C$DW$465, DW_AT_decl_column(0x1c)
    4711                    
    4712                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    4713                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5c)
    4714                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4715                            .dwendtag $C$DW$T$50
    4716                    
    4717                    $C$DW$T$1063    .dwtag  DW_TAG_typedef
    4718                            .dwattr $C$DW$T$1063, DW_AT_name("div_t")
    4719                            .dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$50)
    4720                            .dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
    4721                            .dwattr $C$DW$T$1063, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/includ
    4722                            .dwattr $C$DW$T$1063, DW_AT_decl_line(0x5c)
    4723                            .dwattr $C$DW$T$1063, DW_AT_decl_column(0x23)
    4724                    
    4725                    
    4726                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4727                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    4728                    $C$DW$466       .dwtag  DW_TAG_member
    4729                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$10)
    4730                            .dwattr $C$DW$466, DW_AT_name("quot")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   87

    4731                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("quot")
    4732                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4733                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4734                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    4735                            .dwattr $C$DW$466, DW_AT_decl_line(0x5e)
    4736                            .dwattr $C$DW$466, DW_AT_decl_column(0x16)
    4737                    
    4738                    $C$DW$467       .dwtag  DW_TAG_member
    4739                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$10)
    4740                            .dwattr $C$DW$467, DW_AT_name("rem")
    4741                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("rem")
    4742                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4743                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4744                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    4745                            .dwattr $C$DW$467, DW_AT_decl_line(0x5e)
    4746                            .dwattr $C$DW$467, DW_AT_decl_column(0x1c)
    4747                    
    4748                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    4749                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x5e)
    4750                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4751                            .dwendtag $C$DW$T$51
    4752                    
    4753                    $C$DW$T$1064    .dwtag  DW_TAG_typedef
    4754                            .dwattr $C$DW$T$1064, DW_AT_name("ldiv_t")
    4755                            .dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$51)
    4756                            .dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
    4757                            .dwattr $C$DW$T$1064, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/includ
    4758                            .dwattr $C$DW$T$1064, DW_AT_decl_line(0x5e)
    4759                            .dwattr $C$DW$T$1064, DW_AT_decl_column(0x23)
    4760                    
    4761                    
    4762                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4763                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    4764                    $C$DW$468       .dwtag  DW_TAG_member
    4765                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$14)
    4766                            .dwattr $C$DW$468, DW_AT_name("quot")
    4767                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("quot")
    4768                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4769                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4770                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    4771                            .dwattr $C$DW$468, DW_AT_decl_line(0x61)
    4772                            .dwattr $C$DW$468, DW_AT_decl_column(0x1c)
    4773                    
    4774                    $C$DW$469       .dwtag  DW_TAG_member
    4775                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$14)
    4776                            .dwattr $C$DW$469, DW_AT_name("rem")
    4777                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("rem")
    4778                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4779                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4780                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    4781                            .dwattr $C$DW$469, DW_AT_decl_line(0x61)
    4782                            .dwattr $C$DW$469, DW_AT_decl_column(0x22)
    4783                    
    4784                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    4785                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   88

    4786                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    4787                            .dwendtag $C$DW$T$52
    4788                    
    4789                    $C$DW$T$1065    .dwtag  DW_TAG_typedef
    4790                            .dwattr $C$DW$T$1065, DW_AT_name("lldiv_t")
    4791                            .dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$52)
    4792                            .dwattr $C$DW$T$1065, DW_AT_language(DW_LANG_C)
    4793                            .dwattr $C$DW$T$1065, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/includ
    4794                            .dwattr $C$DW$T$1065, DW_AT_decl_line(0x61)
    4795                            .dwattr $C$DW$T$1065, DW_AT_decl_column(0x29)
    4796                    
    4797                    
    4798                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4799                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4800                    $C$DW$470       .dwtag  DW_TAG_member
    4801                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    4802                            .dwattr $C$DW$470, DW_AT_name("pointerStack")
    4803                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("pointerStack")
    4804                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4805                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4806                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4807                            .dwattr $C$DW$470, DW_AT_decl_line(0x3f5)
    4808                            .dwattr $C$DW$470, DW_AT_decl_column(0x16)
    4809                    
    4810                    $C$DW$471       .dwtag  DW_TAG_member
    4811                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$55)
    4812                            .dwattr $C$DW$471, DW_AT_name("directAPI")
    4813                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("directAPI")
    4814                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4815                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4816                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4817                            .dwattr $C$DW$471, DW_AT_decl_line(0x3f6)
    4818                            .dwattr $C$DW$471, DW_AT_decl_column(0x15)
    4819                    
    4820                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4821                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x3f4)
    4822                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    4823                            .dwendtag $C$DW$T$56
    4824                    
    4825                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    4826                            .dwattr $C$DW$T$58, DW_AT_name("icall_directAPIMsg_t")
    4827                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$56)
    4828                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4829                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4830                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3f7)
    4831                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4832                    
    4833                    
    4834                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4835                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x14)
    4836                    $C$DW$472       .dwtag  DW_TAG_member
    4837                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$57)
    4838                            .dwattr $C$DW$472, DW_AT_name("hdr")
    4839                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("hdr")
    4840                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   89

    4841                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4842                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4843                            .dwattr $C$DW$472, DW_AT_decl_line(0x3fb)
    4844                            .dwattr $C$DW$472, DW_AT_decl_column(0x10)
    4845                    
    4846                    $C$DW$473       .dwtag  DW_TAG_member
    4847                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$58)
    4848                            .dwattr $C$DW$473, DW_AT_name("msg")
    4849                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("msg")
    4850                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4851                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4852                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4853                            .dwattr $C$DW$473, DW_AT_decl_line(0x3fc)
    4854                            .dwattr $C$DW$473, DW_AT_decl_column(0x1a)
    4855                    
    4856                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4857                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3fa)
    4858                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4859                            .dwendtag $C$DW$T$59
    4860                    
    4861                    $C$DW$T$1066    .dwtag  DW_TAG_typedef
    4862                            .dwattr $C$DW$T$1066, DW_AT_name("icallLiteMsg_t")
    4863                            .dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$59)
    4864                            .dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
    4865                            .dwattr $C$DW$T$1066, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4866                            .dwattr $C$DW$T$1066, DW_AT_decl_line(0x3fd)
    4867                            .dwattr $C$DW$T$1066, DW_AT_decl_column(0x03)
    4868                    
    4869                    
    4870                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4871                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x0a)
    4872                    $C$DW$474       .dwtag  DW_TAG_member
    4873                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$482)
    4874                            .dwattr $C$DW$474, DW_AT_name("addr")
    4875                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("addr")
    4876                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4877                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4878                            .dwattr $C$DW$474, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Serv
    4879                            .dwattr $C$DW$474, DW_AT_decl_line(0x55)
    4880                            .dwattr $C$DW$474, DW_AT_decl_column(0x05)
    4881                    
    4882                    $C$DW$475       .dwtag  DW_TAG_member
    4883                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    4884                            .dwattr $C$DW$475, DW_AT_name("addrMode")
    4885                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("addrMode")
    4886                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4887                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4888                            .dwattr $C$DW$475, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Serv
    4889                            .dwattr $C$DW$475, DW_AT_decl_line(0x56)
    4890                            .dwattr $C$DW$475, DW_AT_decl_column(0x13)
    4891                    
    4892                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Ser
    4893                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x50)
    4894                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    4895                            .dwendtag $C$DW$T$60
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   90

    4896                    
    4897                    $C$DW$T$376     .dwtag  DW_TAG_typedef
    4898                            .dwattr $C$DW$T$376, DW_AT_name("sAddr_t")
    4899                            .dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$60)
    4900                            .dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
    4901                            .dwattr $C$DW$T$376, DW_AT_decl_file("C:/CCSWorkspace/ECG603/collector_cc1350lp/Application/Se
    4902                            .dwattr $C$DW$T$376, DW_AT_decl_line(0x57)
    4903                            .dwattr $C$DW$T$376, DW_AT_decl_column(0x03)
    4904                    
    4905                    $C$DW$T$432     .dwtag  DW_TAG_pointer_type
    4906                            .dwattr $C$DW$T$432, DW_AT_type(*$C$DW$T$376)
    4907                            .dwattr $C$DW$T$432, DW_AT_address_class(0x20)
    4908                    
    4909                    
    4910                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4911                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x0a)
    4912                    $C$DW$476       .dwtag  DW_TAG_member
    4913                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$485)
    4914                            .dwattr $C$DW$476, DW_AT_name("addr")
    4915                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("addr")
    4916                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4917                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4918                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4919                            .dwattr $C$DW$476, DW_AT_decl_line(0x139)
    4920                            .dwattr $C$DW$476, DW_AT_decl_column(0x05)
    4921                    
    4922                    $C$DW$477       .dwtag  DW_TAG_member
    4923                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$62)
    4924                            .dwattr $C$DW$477, DW_AT_name("addrMode")
    4925                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("addrMode")
    4926                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4927                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4928                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4929                            .dwattr $C$DW$477, DW_AT_decl_line(0x13a)
    4930                            .dwattr $C$DW$477, DW_AT_decl_column(0x08)
    4931                    
    4932                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4933                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x134)
    4934                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4935                            .dwendtag $C$DW$T$63
    4936                    
    4937                    $C$DW$T$1067    .dwtag  DW_TAG_typedef
    4938                            .dwattr $C$DW$T$1067, DW_AT_name("zAddrType_t")
    4939                            .dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$63)
    4940                            .dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
    4941                            .dwattr $C$DW$T$1067, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4942                            .dwattr $C$DW$T$1067, DW_AT_decl_line(0x13b)
    4943                            .dwattr $C$DW$T$1067, DW_AT_decl_column(0x03)
    4944                    
    4945                    
    4946                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4947                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x0c)
    4948                    $C$DW$478       .dwtag  DW_TAG_member
    4949                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$61)
    4950                            .dwattr $C$DW$478, DW_AT_name("txCounter")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   91

    4951                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("txCounter")
    4952                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4953                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4954                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4955                            .dwattr $C$DW$478, DW_AT_decl_line(0x198)
    4956                            .dwattr $C$DW$478, DW_AT_decl_column(0x0a)
    4957                    
    4958                    $C$DW$479       .dwtag  DW_TAG_member
    4959                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$61)
    4960                            .dwattr $C$DW$479, DW_AT_name("txCost")
    4961                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("txCost")
    4962                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4963                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4964                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4965                            .dwattr $C$DW$479, DW_AT_decl_line(0x199)
    4966                            .dwattr $C$DW$479, DW_AT_decl_column(0x0a)
    4967                    
    4968                    $C$DW$480       .dwtag  DW_TAG_member
    4969                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$61)
    4970                            .dwattr $C$DW$480, DW_AT_name("rxLqi")
    4971                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("rxLqi")
    4972                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4973                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4974                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4975                            .dwattr $C$DW$480, DW_AT_decl_line(0x19b)
    4976                            .dwattr $C$DW$480, DW_AT_decl_column(0x0a)
    4977                    
    4978                    $C$DW$481       .dwtag  DW_TAG_member
    4979                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$61)
    4980                            .dwattr $C$DW$481, DW_AT_name("inKeySeqNum")
    4981                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("inKeySeqNum")
    4982                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4983                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4984                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4985                            .dwattr $C$DW$481, DW_AT_decl_line(0x19d)
    4986                            .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    4987                    
    4988                    $C$DW$482       .dwtag  DW_TAG_member
    4989                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$64)
    4990                            .dwattr $C$DW$482, DW_AT_name("inFrmCntr")
    4991                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("inFrmCntr")
    4992                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4993                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4994                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4995                            .dwattr $C$DW$482, DW_AT_decl_line(0x19e)
    4996                            .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    4997                    
    4998                    $C$DW$483       .dwtag  DW_TAG_member
    4999                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$65)
    5000                            .dwattr $C$DW$483, DW_AT_name("txFailure")
    5001                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("txFailure")
    5002                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5003                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5004                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5005                            .dwattr $C$DW$483, DW_AT_decl_line(0x19f)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   92

    5006                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5007                    
    5008                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5009                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x197)
    5010                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    5011                            .dwendtag $C$DW$T$66
    5012                    
    5013                    $C$DW$T$1068    .dwtag  DW_TAG_typedef
    5014                            .dwattr $C$DW$T$1068, DW_AT_name("linkInfo_t")
    5015                            .dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$66)
    5016                            .dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
    5017                            .dwattr $C$DW$T$1068, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5018                            .dwattr $C$DW$T$1068, DW_AT_decl_line(0x1a0)
    5019                            .dwattr $C$DW$T$1068, DW_AT_decl_column(0x03)
    5020                    
    5021                    
    5022                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    5023                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
    5024                    $C$DW$484       .dwtag  DW_TAG_member
    5025                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$61)
    5026                            .dwattr $C$DW$484, DW_AT_name("event")
    5027                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("event")
    5028                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5029                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5030                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5031                            .dwattr $C$DW$484, DW_AT_decl_line(0x79)
    5032                            .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    5033                    
    5034                    $C$DW$485       .dwtag  DW_TAG_member
    5035                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$61)
    5036                            .dwattr $C$DW$485, DW_AT_name("status")
    5037                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("status")
    5038                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5039                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5040                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5041                            .dwattr $C$DW$485, DW_AT_decl_line(0x7a)
    5042                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5043                    
    5044                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5045                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x78)
    5046                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    5047                            .dwendtag $C$DW$T$67
    5048                    
    5049                    $C$DW$T$1069    .dwtag  DW_TAG_typedef
    5050                            .dwattr $C$DW$T$1069, DW_AT_name("osal_event_hdr_t")
    5051                            .dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$67)
    5052                            .dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
    5053                            .dwattr $C$DW$T$1069, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5054                            .dwattr $C$DW$T$1069, DW_AT_decl_line(0x7b)
    5055                            .dwattr $C$DW$T$1069, DW_AT_decl_column(0x03)
    5056                    
    5057                    
    5058                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    5059                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x4c)
    5060                    $C$DW$486       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   93

    5061                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$70)
    5062                            .dwattr $C$DW$486, DW_AT_name("Crc32")
    5063                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("Crc32")
    5064                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5065                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5066                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5067                            .dwattr $C$DW$486, DW_AT_decl_line(0x76)
    5068                            .dwattr $C$DW$486, DW_AT_decl_column(0x25)
    5069                    
    5070                    $C$DW$487       .dwtag  DW_TAG_member
    5071                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$73)
    5072                            .dwattr $C$DW$487, DW_AT_name("FlashGetSize")
    5073                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("FlashGetSize")
    5074                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5075                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5076                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5077                            .dwattr $C$DW$487, DW_AT_decl_line(0x77)
    5078                            .dwattr $C$DW$487, DW_AT_decl_column(0x25)
    5079                    
    5080                    $C$DW$488       .dwtag  DW_TAG_member
    5081                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$74)
    5082                            .dwattr $C$DW$488, DW_AT_name("GetChipId")
    5083                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("GetChipId")
    5084                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5085                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5086                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5087                            .dwattr $C$DW$488, DW_AT_decl_line(0x78)
    5088                            .dwattr $C$DW$488, DW_AT_decl_column(0x25)
    5089                    
    5090                    $C$DW$489       .dwtag  DW_TAG_member
    5091                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$77)
    5092                            .dwattr $C$DW$489, DW_AT_name("ReservedLocation1")
    5093                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("ReservedLocation1")
    5094                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5095                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5096                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5097                            .dwattr $C$DW$489, DW_AT_decl_line(0x79)
    5098                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    5099                    
    5100                    $C$DW$490       .dwtag  DW_TAG_member
    5101                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$78)
    5102                            .dwattr $C$DW$490, DW_AT_name("ReservedLocation2")
    5103                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("ReservedLocation2")
    5104                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5105                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5106                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5107                            .dwattr $C$DW$490, DW_AT_decl_line(0x7a)
    5108                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
    5109                    
    5110                    $C$DW$491       .dwtag  DW_TAG_member
    5111                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$79)
    5112                            .dwattr $C$DW$491, DW_AT_name("ReservedLocation3")
    5113                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("ReservedLocation3")
    5114                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5115                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   94

    5116                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5117                            .dwattr $C$DW$491, DW_AT_decl_line(0x7b)
    5118                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5119                    
    5120                    $C$DW$492       .dwtag  DW_TAG_member
    5121                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$80)
    5122                            .dwattr $C$DW$492, DW_AT_name("ResetDevice")
    5123                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("ResetDevice")
    5124                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5125                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5126                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5127                            .dwattr $C$DW$492, DW_AT_decl_line(0x7c)
    5128                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5129                    
    5130                    $C$DW$493       .dwtag  DW_TAG_member
    5131                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$85)
    5132                            .dwattr $C$DW$493, DW_AT_name("Fletcher32")
    5133                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("Fletcher32")
    5134                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5135                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5136                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5137                            .dwattr $C$DW$493, DW_AT_decl_line(0x7d)
    5138                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5139                    
    5140                    $C$DW$494       .dwtag  DW_TAG_member
    5141                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$88)
    5142                            .dwattr $C$DW$494, DW_AT_name("MinValue")
    5143                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("MinValue")
    5144                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5145                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5146                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5147                            .dwattr $C$DW$494, DW_AT_decl_line(0x7e)
    5148                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5149                    
    5150                    $C$DW$495       .dwtag  DW_TAG_member
    5151                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$89)
    5152                            .dwattr $C$DW$495, DW_AT_name("MaxValue")
    5153                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("MaxValue")
    5154                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5155                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5156                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5157                            .dwattr $C$DW$495, DW_AT_decl_line(0x7f)
    5158                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5159                    
    5160                    $C$DW$496       .dwtag  DW_TAG_member
    5161                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$90)
    5162                            .dwattr $C$DW$496, DW_AT_name("MeanValue")
    5163                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("MeanValue")
    5164                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5165                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5166                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5167                            .dwattr $C$DW$496, DW_AT_decl_line(0x80)
    5168                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5169                    
    5170                    $C$DW$497       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   95

    5171                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$91)
    5172                            .dwattr $C$DW$497, DW_AT_name("StandDeviationValue")
    5173                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("StandDeviationValue")
    5174                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5175                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5176                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5177                            .dwattr $C$DW$497, DW_AT_decl_line(0x81)
    5178                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5179                    
    5180                    $C$DW$498       .dwtag  DW_TAG_member
    5181                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$92)
    5182                            .dwattr $C$DW$498, DW_AT_name("ReservedLocation4")
    5183                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("ReservedLocation4")
    5184                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5185                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5186                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5187                            .dwattr $C$DW$498, DW_AT_decl_line(0x82)
    5188                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5189                    
    5190                    $C$DW$499       .dwtag  DW_TAG_member
    5191                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$93)
    5192                            .dwattr $C$DW$499, DW_AT_name("ReservedLocation5")
    5193                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("ReservedLocation5")
    5194                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5195                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5196                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5197                            .dwattr $C$DW$499, DW_AT_decl_line(0x83)
    5198                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5199                    
    5200                    $C$DW$500       .dwtag  DW_TAG_member
    5201                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$94)
    5202                            .dwattr $C$DW$500, DW_AT_name("HFSourceSafeSwitch")
    5203                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5204                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5205                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5206                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5207                            .dwattr $C$DW$500, DW_AT_decl_line(0x84)
    5208                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5209                    
    5210                    $C$DW$501       .dwtag  DW_TAG_member
    5211                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$95)
    5212                            .dwattr $C$DW$501, DW_AT_name("SelectCompAInput")
    5213                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("SelectCompAInput")
    5214                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5215                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5216                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5217                            .dwattr $C$DW$501, DW_AT_decl_line(0x85)
    5218                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
    5219                    
    5220                    $C$DW$502       .dwtag  DW_TAG_member
    5221                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$96)
    5222                            .dwattr $C$DW$502, DW_AT_name("SelectCompARef")
    5223                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("SelectCompARef")
    5224                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5225                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   96

    5226                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5227                            .dwattr $C$DW$502, DW_AT_decl_line(0x86)
    5228                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5229                    
    5230                    $C$DW$503       .dwtag  DW_TAG_member
    5231                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$97)
    5232                            .dwattr $C$DW$503, DW_AT_name("SelectADCCompBInput")
    5233                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5234                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5235                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5236                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5237                            .dwattr $C$DW$503, DW_AT_decl_line(0x87)
    5238                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5239                    
    5240                    $C$DW$504       .dwtag  DW_TAG_member
    5241                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$98)
    5242                            .dwattr $C$DW$504, DW_AT_name("SelectCompBRef")
    5243                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("SelectCompBRef")
    5244                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5245                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5246                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5247                            .dwattr $C$DW$504, DW_AT_decl_line(0x88)
    5248                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5249                    
    5250                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    5251                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x75)
    5252                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    5253                            .dwendtag $C$DW$T$99
    5254                    
    5255                    $C$DW$T$1070    .dwtag  DW_TAG_typedef
    5256                            .dwattr $C$DW$T$1070, DW_AT_name("HARD_API_T")
    5257                            .dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$99)
    5258                            .dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
    5259                            .dwattr $C$DW$T$1070, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    5260                            .dwattr $C$DW$T$1070, DW_AT_decl_line(0x89)
    5261                            .dwattr $C$DW$T$1070, DW_AT_decl_column(0x03)
    5262                    
    5263                    
    5264                    $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5265                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x0a)
    5266                    $C$DW$505       .dwtag  DW_TAG_member
    5267                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$486)
    5268                            .dwattr $C$DW$505, DW_AT_name("addr")
    5269                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("addr")
    5270                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5271                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5272                            .dwattr $C$DW$505, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5273                            .dwattr $C$DW$505, DW_AT_decl_line(0x4db)
    5274                            .dwattr $C$DW$505, DW_AT_decl_column(0x07)
    5275                    
    5276                    $C$DW$506       .dwtag  DW_TAG_member
    5277                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$101)
    5278                            .dwattr $C$DW$506, DW_AT_name("addrMode")
    5279                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("addrMode")
    5280                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   97

    5281                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5282                            .dwattr $C$DW$506, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5283                            .dwattr $C$DW$506, DW_AT_decl_line(0x4de)
    5284                            .dwattr $C$DW$506, DW_AT_decl_column(0x17)
    5285                    
    5286                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\ap
    5287                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4d0)
    5288                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    5289                            .dwendtag $C$DW$T$102
    5290                    
    5291                    $C$DW$T$721     .dwtag  DW_TAG_typedef
    5292                            .dwattr $C$DW$T$721, DW_AT_name("ApiMac_sAddr_t")
    5293                            .dwattr $C$DW$T$721, DW_AT_type(*$C$DW$T$102)
    5294                            .dwattr $C$DW$T$721, DW_AT_language(DW_LANG_C)
    5295                            .dwattr $C$DW$T$721, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\ap
    5296                            .dwattr $C$DW$T$721, DW_AT_decl_line(0x4df)
    5297                            .dwattr $C$DW$T$721, DW_AT_decl_column(0x03)
    5298                    
    5299                    
    5300                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5301                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x08)
    5302                    $C$DW$507       .dwtag  DW_TAG_member
    5303                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$23)
    5304                            .dwattr $C$DW$507, DW_AT_name("frameCounter")
    5305                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("frameCounter")
    5306                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5307                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5308                            .dwattr $C$DW$507, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5309                            .dwattr $C$DW$507, DW_AT_decl_line(0x575)
    5310                            .dwattr $C$DW$507, DW_AT_decl_column(0x1a)
    5311                    
    5312                    $C$DW$508       .dwtag  DW_TAG_member
    5313                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$81)
    5314                            .dwattr $C$DW$508, DW_AT_name("keyIdx")
    5315                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("keyIdx")
    5316                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5317                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5318                            .dwattr $C$DW$508, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5319                            .dwattr $C$DW$508, DW_AT_decl_line(0x576)
    5320                            .dwattr $C$DW$508, DW_AT_decl_column(0x1a)
    5321                    
    5322                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\ap
    5323                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x574)
    5324                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    5325                            .dwendtag $C$DW$T$103
    5326                    
    5327                    $C$DW$T$781     .dwtag  DW_TAG_typedef
    5328                            .dwattr $C$DW$T$781, DW_AT_name("ApiMac_frameCntr_t")
    5329                            .dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$103)
    5330                            .dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
    5331                            .dwattr $C$DW$T$781, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\ap
    5332                            .dwattr $C$DW$T$781, DW_AT_decl_line(0x577)
    5333                            .dwattr $C$DW$T$781, DW_AT_decl_column(0x03)
    5334                    
    5335                    $C$DW$T$782     .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   98

    5336                            .dwattr $C$DW$T$782, DW_AT_type(*$C$DW$T$781)
    5337                            .dwattr $C$DW$T$782, DW_AT_address_class(0x20)
    5338                    
    5339                    
    5340                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5341                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x40)
    5342                    $C$DW$509       .dwtag  DW_TAG_member
    5343                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$105)
    5344                            .dwattr $C$DW$509, DW_AT_name("beaconType")
    5345                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("beaconType")
    5346                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5347                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5348                            .dwattr $C$DW$509, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5349                            .dwattr $C$DW$509, DW_AT_decl_line(0x886)
    5350                            .dwattr $C$DW$509, DW_AT_decl_column(0x19)
    5351                    
    5352                    $C$DW$510       .dwtag  DW_TAG_member
    5353                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$19)
    5354                            .dwattr $C$DW$510, DW_AT_name("bsn")
    5355                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("bsn")
    5356                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5357                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5358                            .dwattr $C$DW$510, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5359                            .dwattr $C$DW$510, DW_AT_decl_line(0x888)
    5360                            .dwattr $C$DW$510, DW_AT_decl_column(0x0d)
    5361                    
    5362                    $C$DW$511       .dwtag  DW_TAG_member
    5363                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$106)
    5364                            .dwattr $C$DW$511, DW_AT_name("panDesc")
    5365                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("panDesc")
    5366                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5367                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5368                            .dwattr $C$DW$511, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5369                            .dwattr $C$DW$511, DW_AT_decl_line(0x88a)
    5370                            .dwattr $C$DW$511, DW_AT_decl_column(0x16)
    5371                    
    5372                    $C$DW$512       .dwtag  DW_TAG_member
    5373                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$489)
    5374                            .dwattr $C$DW$512, DW_AT_name("beaconData")
    5375                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("beaconData")
    5376                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5377                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5378                            .dwattr $C$DW$512, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\api_
    5379                            .dwattr $C$DW$512, DW_AT_decl_line(0x895)
    5380                            .dwattr $C$DW$512, DW_AT_decl_column(0x07)
    5381                    
    5382                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\ap
    5383                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x884)
    5384                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5385                            .dwendtag $C$DW$T$107
    5386                    
    5387                    $C$DW$T$635     .dwtag  DW_TAG_typedef
    5388                            .dwattr $C$DW$T$635, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5389                            .dwattr $C$DW$T$635, DW_AT_type(*$C$DW$T$107)
    5390                            .dwattr $C$DW$T$635, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{118D2615-9A38-4D3A-925A-BE73855E9B4F} PAGE   99

    5391                            .dwattr $C$DW$T$635, DW_AT_decl_file("C:\CCSWorkspace\ECG603\collector_cc1350lp\Application\ap
    5392                            .dwattr $C$DW$T$635, DW_AT_decl_line(0x896)
    5393                            .dwattr $C$DW$T$635, DW_AT_decl_column(0x03)
    5394                    
    5395                    $C$DW$T$636     .dwtag  DW_TAG_pointer_type
    5396                            .dwattr $C$DW$T$636, DW_AT_type(*$C$DW$T$635)
    5397                            .dwattr $C$DW$T$636, DW_AT_address_class(0x20)
    5398                    
    5399                    
    5400                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    5401                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x08)
    5402                    $C$DW$513       .dwtag  DW_TAG_member
    5403                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$40)
    5404                            .dwattr $C$DW$513, DW_AT_name("pCurrEntry")
    5405                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("pCurrEntry")
    5406                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5407                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5408                            .dwattr $C$DW$513, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5409                            .dwattr $C$DW$513, DW_AT_decl_line(0x41)
    5410                            .dwattr $C$DW$513, DW_AT_decl_column(0x0d)
    5411                    
    5412                    $C$DW$514       .dwtag  DW_TAG_member
    5413                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$40)
    5414                            .dwattr $C$DW$514, DW_AT_name("pLastEntry")
    5415                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("pLastEntry")
    5416                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5417                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5418                            .dwattr $C$DW$514, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5419                            .dwattr $C$DW$514, DW_AT_decl_line(0x42)
    5420                            .dwattr $C$DW$514, DW_AT_decl_column(0x0d)
    5421                    
    5422                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5423                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x40)
    5424                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x10)
    5425                            .dwendtag $C$DW$T$108
    5426                    
    5427                    $C$DW$T$877     .dwtag  DW_TAG_typedef
    5428                            .dwattr $C$DW$T$877, DW_AT_name("dataQueue_t")
    5429                            .dwattr $C$DW$T$877, DW_AT_type(*$C$DW$T$108)
    5430                            .dwattr $C$DW$T$877, DW_AT_language(DW_LANG_C)
    5431                            .dwattr $C$DW$T$877, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5432                            .dwattr $C$DW$T$877, DW_AT_decl_line(0x43)
    5433                            .dwattr $C$DW$T$877, DW_AT_decl_column(0x03)
    5434                    
    5435                    $C$DW$T$878     .dwtag  DW_TAG_pointer_type
    5436                            .dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$877)
    5437                            .dwattr $C$DW$T$878, DW_AT_address_class(0x20)
    5438                    
    5439                    
    5440                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    5441                            .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    5442                    $C$DW$515       .dwtag  DW_TAG_member
    5443                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    5444                            .dwattr $C$DW$515, DW_AT_name("triggerType")
    5445                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("triggerType")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
