TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 16:40:47 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\collector_cc1350lp\collector_cc1350lp
      13                    
      14                    ;*****************************************************************************

    7143                    
    7144                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    7145                            .dwattr $C$DW$T$176, DW_AT_name("tFlashStateCommandsType")
    7146                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    7147                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    7148                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    7149                            .dwattr $C$DW$T$176, DW_AT_decl_line(0xb0)
    7150                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
    7151                    
    7152                    
    7153                    $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    7154                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    7155                    $C$DW$456       .dwtag  DW_TAG_enumerator
    7156                            .dwattr $C$DW$456, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    7157                            .dwattr $C$DW$456, DW_AT_const_value(0xe0)
    7158                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7159                            .dwattr $C$DW$456, DW_AT_decl_line(0x3de)
    7160                            .dwattr $C$DW$456, DW_AT_decl_column(0x04)
    7161                    
    7162                    $C$DW$457       .dwtag  DW_TAG_enumerator
    7163                            .dwattr $C$DW$457, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    7164                            .dwattr $C$DW$457, DW_AT_const_value(0xe1)
    7165                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7166                            .dwattr $C$DW$457, DW_AT_decl_line(0x3e0)
    7167                            .dwattr $C$DW$457, DW_AT_decl_column(0x04)
    7168                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  132

    7169                    $C$DW$458       .dwtag  DW_TAG_enumerator
    7170                            .dwattr $C$DW$458, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    7171                            .dwattr $C$DW$458, DW_AT_const_value(0xe2)
    7172                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7173                            .dwattr $C$DW$458, DW_AT_decl_line(0x3e2)
    7174                            .dwattr $C$DW$458, DW_AT_decl_column(0x04)
    7175                    
    7176                    $C$DW$459       .dwtag  DW_TAG_enumerator
    7177                            .dwattr $C$DW$459, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    7178                            .dwattr $C$DW$459, DW_AT_const_value(0xe3)
    7179                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7180                            .dwattr $C$DW$459, DW_AT_decl_line(0x3e4)
    7181                            .dwattr $C$DW$459, DW_AT_decl_column(0x04)
    7182                    
    7183                    $C$DW$460       .dwtag  DW_TAG_enumerator
    7184                            .dwattr $C$DW$460, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    7185                            .dwattr $C$DW$460, DW_AT_const_value(0xe4)
    7186                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7187                            .dwattr $C$DW$460, DW_AT_decl_line(0x3e6)
    7188                            .dwattr $C$DW$460, DW_AT_decl_column(0x04)
    7189                    
    7190                    $C$DW$461       .dwtag  DW_TAG_enumerator
    7191                            .dwattr $C$DW$461, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    7192                            .dwattr $C$DW$461, DW_AT_const_value(0xe5)
    7193                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7194                            .dwattr $C$DW$461, DW_AT_decl_line(0x3e8)
    7195                            .dwattr $C$DW$461, DW_AT_decl_column(0x04)
    7196                    
    7197                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7198                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x3dc)
    7199                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x01)
    7200                            .dwendtag $C$DW$T$177
    7201                    
    7202                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    7203                            .dwattr $C$DW$T$178, DW_AT_name("ICall_RemotiCmdEvent_t")
    7204                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    7205                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    7206                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7207                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x3e9)
    7208                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x02)
    7209                    
    7210                    
    7211                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7212                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    7213                    $C$DW$462       .dwtag  DW_TAG_member
    7214                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    7215                            .dwattr $C$DW$462, DW_AT_name("event")
    7216                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("event")
    7217                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7218                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7219                            .dwattr $C$DW$462, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7220                            .dwattr $C$DW$462, DW_AT_decl_line(0x79)
    7221                            .dwattr $C$DW$462, DW_AT_decl_column(0x0a)
    7222                    
    7223                    $C$DW$463       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  133

    7224                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    7225                            .dwattr $C$DW$463, DW_AT_name("status")
    7226                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("status")
    7227                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7228                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7229                            .dwattr $C$DW$463, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7230                            .dwattr $C$DW$463, DW_AT_decl_line(0x7a)
    7231                            .dwattr $C$DW$463, DW_AT_decl_column(0x0a)
    7232                    
    7233                            .dwattr $C$DW$T$20, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7234                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x78)
    7235                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    7236                            .dwendtag $C$DW$T$20
    7237                    
    7238                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    7239                            .dwattr $C$DW$T$86, DW_AT_name("osal_event_hdr_t")
    7240                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    7241                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    7242                            .dwattr $C$DW$T$86, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7243                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    7244                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    7245                    
    7246                    $C$DW$T$181     .dwtag  DW_TAG_pointer_type
    7247                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$86)
    7248                            .dwattr $C$DW$T$181, DW_AT_address_class(0x20)
    7249                    
    7250                    
    7251                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    7252                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x4c)
    7253                    $C$DW$464       .dwtag  DW_TAG_member
    7254                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$26)
    7255                            .dwattr $C$DW$464, DW_AT_name("Crc32")
    7256                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("Crc32")
    7257                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7258                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7259                            .dwattr $C$DW$464, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7260                            .dwattr $C$DW$464, DW_AT_decl_line(0x76)
    7261                            .dwattr $C$DW$464, DW_AT_decl_column(0x25)
    7262                    
    7263                    $C$DW$465       .dwtag  DW_TAG_member
    7264                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$29)
    7265                            .dwattr $C$DW$465, DW_AT_name("FlashGetSize")
    7266                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("FlashGetSize")
    7267                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7268                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7269                            .dwattr $C$DW$465, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7270                            .dwattr $C$DW$465, DW_AT_decl_line(0x77)
    7271                            .dwattr $C$DW$465, DW_AT_decl_column(0x25)
    7272                    
    7273                    $C$DW$466       .dwtag  DW_TAG_member
    7274                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$30)
    7275                            .dwattr $C$DW$466, DW_AT_name("GetChipId")
    7276                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("GetChipId")
    7277                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7278                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  134

    7279                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7280                            .dwattr $C$DW$466, DW_AT_decl_line(0x78)
    7281                            .dwattr $C$DW$466, DW_AT_decl_column(0x25)
    7282                    
    7283                    $C$DW$467       .dwtag  DW_TAG_member
    7284                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$33)
    7285                            .dwattr $C$DW$467, DW_AT_name("ReservedLocation1")
    7286                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("ReservedLocation1")
    7287                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7288                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7289                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7290                            .dwattr $C$DW$467, DW_AT_decl_line(0x79)
    7291                            .dwattr $C$DW$467, DW_AT_decl_column(0x25)
    7292                    
    7293                    $C$DW$468       .dwtag  DW_TAG_member
    7294                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$34)
    7295                            .dwattr $C$DW$468, DW_AT_name("ReservedLocation2")
    7296                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("ReservedLocation2")
    7297                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7298                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7299                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7300                            .dwattr $C$DW$468, DW_AT_decl_line(0x7a)
    7301                            .dwattr $C$DW$468, DW_AT_decl_column(0x25)
    7302                    
    7303                    $C$DW$469       .dwtag  DW_TAG_member
    7304                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$35)
    7305                            .dwattr $C$DW$469, DW_AT_name("ReservedLocation3")
    7306                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("ReservedLocation3")
    7307                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7308                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7309                            .dwattr $C$DW$469, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7310                            .dwattr $C$DW$469, DW_AT_decl_line(0x7b)
    7311                            .dwattr $C$DW$469, DW_AT_decl_column(0x25)
    7312                    
    7313                    $C$DW$470       .dwtag  DW_TAG_member
    7314                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$38)
    7315                            .dwattr $C$DW$470, DW_AT_name("ResetDevice")
    7316                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("ResetDevice")
    7317                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7318                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7319                            .dwattr $C$DW$470, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7320                            .dwattr $C$DW$470, DW_AT_decl_line(0x7c)
    7321                            .dwattr $C$DW$470, DW_AT_decl_column(0x25)
    7322                    
    7323                    $C$DW$471       .dwtag  DW_TAG_member
    7324                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$43)
    7325                            .dwattr $C$DW$471, DW_AT_name("Fletcher32")
    7326                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("Fletcher32")
    7327                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7328                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7329                            .dwattr $C$DW$471, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7330                            .dwattr $C$DW$471, DW_AT_decl_line(0x7d)
    7331                            .dwattr $C$DW$471, DW_AT_decl_column(0x25)
    7332                    
    7333                    $C$DW$472       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  135

    7334                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$47)
    7335                            .dwattr $C$DW$472, DW_AT_name("MinValue")
    7336                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("MinValue")
    7337                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7338                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7339                            .dwattr $C$DW$472, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7340                            .dwattr $C$DW$472, DW_AT_decl_line(0x7e)
    7341                            .dwattr $C$DW$472, DW_AT_decl_column(0x25)
    7342                    
    7343                    $C$DW$473       .dwtag  DW_TAG_member
    7344                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$48)
    7345                            .dwattr $C$DW$473, DW_AT_name("MaxValue")
    7346                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("MaxValue")
    7347                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7348                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7349                            .dwattr $C$DW$473, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7350                            .dwattr $C$DW$473, DW_AT_decl_line(0x7f)
    7351                            .dwattr $C$DW$473, DW_AT_decl_column(0x25)
    7352                    
    7353                    $C$DW$474       .dwtag  DW_TAG_member
    7354                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$49)
    7355                            .dwattr $C$DW$474, DW_AT_name("MeanValue")
    7356                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("MeanValue")
    7357                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7358                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7359                            .dwattr $C$DW$474, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7360                            .dwattr $C$DW$474, DW_AT_decl_line(0x80)
    7361                            .dwattr $C$DW$474, DW_AT_decl_column(0x25)
    7362                    
    7363                    $C$DW$475       .dwtag  DW_TAG_member
    7364                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$50)
    7365                            .dwattr $C$DW$475, DW_AT_name("StandDeviationValue")
    7366                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("StandDeviationValue")
    7367                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7368                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7369                            .dwattr $C$DW$475, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7370                            .dwattr $C$DW$475, DW_AT_decl_line(0x81)
    7371                            .dwattr $C$DW$475, DW_AT_decl_column(0x25)
    7372                    
    7373                    $C$DW$476       .dwtag  DW_TAG_member
    7374                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$53)
    7375                            .dwattr $C$DW$476, DW_AT_name("ReservedLocation4")
    7376                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("ReservedLocation4")
    7377                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7378                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7379                            .dwattr $C$DW$476, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7380                            .dwattr $C$DW$476, DW_AT_decl_line(0x82)
    7381                            .dwattr $C$DW$476, DW_AT_decl_column(0x25)
    7382                    
    7383                    $C$DW$477       .dwtag  DW_TAG_member
    7384                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    7385                            .dwattr $C$DW$477, DW_AT_name("ReservedLocation5")
    7386                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("ReservedLocation5")
    7387                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7388                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  136

    7389                            .dwattr $C$DW$477, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7390                            .dwattr $C$DW$477, DW_AT_decl_line(0x83)
    7391                            .dwattr $C$DW$477, DW_AT_decl_column(0x25)
    7392                    
    7393                    $C$DW$478       .dwtag  DW_TAG_member
    7394                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$55)
    7395                            .dwattr $C$DW$478, DW_AT_name("HFSourceSafeSwitch")
    7396                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7397                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7398                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7399                            .dwattr $C$DW$478, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7400                            .dwattr $C$DW$478, DW_AT_decl_line(0x84)
    7401                            .dwattr $C$DW$478, DW_AT_decl_column(0x25)
    7402                    
    7403                    $C$DW$479       .dwtag  DW_TAG_member
    7404                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$58)
    7405                            .dwattr $C$DW$479, DW_AT_name("SelectCompAInput")
    7406                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("SelectCompAInput")
    7407                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7408                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7409                            .dwattr $C$DW$479, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7410                            .dwattr $C$DW$479, DW_AT_decl_line(0x85)
    7411                            .dwattr $C$DW$479, DW_AT_decl_column(0x25)
    7412                    
    7413                    $C$DW$480       .dwtag  DW_TAG_member
    7414                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$59)
    7415                            .dwattr $C$DW$480, DW_AT_name("SelectCompARef")
    7416                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("SelectCompARef")
    7417                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7418                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7419                            .dwattr $C$DW$480, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7420                            .dwattr $C$DW$480, DW_AT_decl_line(0x86)
    7421                            .dwattr $C$DW$480, DW_AT_decl_column(0x25)
    7422                    
    7423                    $C$DW$481       .dwtag  DW_TAG_member
    7424                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$60)
    7425                            .dwattr $C$DW$481, DW_AT_name("SelectADCCompBInput")
    7426                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7427                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7428                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7429                            .dwattr $C$DW$481, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7430                            .dwattr $C$DW$481, DW_AT_decl_line(0x87)
    7431                            .dwattr $C$DW$481, DW_AT_decl_column(0x25)
    7432                    
    7433                    $C$DW$482       .dwtag  DW_TAG_member
    7434                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$61)
    7435                            .dwattr $C$DW$482, DW_AT_name("SelectCompBRef")
    7436                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("SelectCompBRef")
    7437                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7438                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7439                            .dwattr $C$DW$482, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7440                            .dwattr $C$DW$482, DW_AT_decl_line(0x88)
    7441                            .dwattr $C$DW$482, DW_AT_decl_column(0x25)
    7442                    
    7443                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  137

    7444                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x75)
    7445                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    7446                            .dwendtag $C$DW$T$62
    7447                    
    7448                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    7449                            .dwattr $C$DW$T$183, DW_AT_name("HARD_API_T")
    7450                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$62)
    7451                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    7452                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7453                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x89)
    7454                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    7455                    
    7456                    
    7457                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    7458                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    7459                    $C$DW$483       .dwtag  DW_TAG_member
    7460                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$10)
    7461                            .dwattr $C$DW$483, DW_AT_name("quot")
    7462                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("quot")
    7463                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7464                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7465                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7466                            .dwattr $C$DW$483, DW_AT_decl_line(0x5c)
    7467                            .dwattr $C$DW$483, DW_AT_decl_column(0x16)
    7468                    
    7469                    $C$DW$484       .dwtag  DW_TAG_member
    7470                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$10)
    7471                            .dwattr $C$DW$484, DW_AT_name("rem")
    7472                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("rem")
    7473                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7474                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7475                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7476                            .dwattr $C$DW$484, DW_AT_decl_line(0x5c)
    7477                            .dwattr $C$DW$484, DW_AT_decl_column(0x1c)
    7478                    
    7479                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    7480                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x5c)
    7481                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
    7482                            .dwendtag $C$DW$T$63
    7483                    
    7484                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    7485                            .dwattr $C$DW$T$184, DW_AT_name("div_t")
    7486                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$63)
    7487                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    7488                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7489                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x5c)
    7490                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x23)
    7491                    
    7492                    
    7493                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7494                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
    7495                    $C$DW$485       .dwtag  DW_TAG_member
    7496                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$10)
    7497                            .dwattr $C$DW$485, DW_AT_name("quot")
    7498                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("quot")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  138

    7499                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7500                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7501                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7502                            .dwattr $C$DW$485, DW_AT_decl_line(0x5e)
    7503                            .dwattr $C$DW$485, DW_AT_decl_column(0x16)
    7504                    
    7505                    $C$DW$486       .dwtag  DW_TAG_member
    7506                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$10)
    7507                            .dwattr $C$DW$486, DW_AT_name("rem")
    7508                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("rem")
    7509                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7510                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7511                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7512                            .dwattr $C$DW$486, DW_AT_decl_line(0x5e)
    7513                            .dwattr $C$DW$486, DW_AT_decl_column(0x1c)
    7514                    
    7515                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    7516                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5e)
    7517                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
    7518                            .dwendtag $C$DW$T$64
    7519                    
    7520                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    7521                            .dwattr $C$DW$T$185, DW_AT_name("ldiv_t")
    7522                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$64)
    7523                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    7524                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7525                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x5e)
    7526                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x23)
    7527                    
    7528                    
    7529                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7530                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    7531                    $C$DW$487       .dwtag  DW_TAG_member
    7532                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$14)
    7533                            .dwattr $C$DW$487, DW_AT_name("quot")
    7534                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("quot")
    7535                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7536                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7537                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7538                            .dwattr $C$DW$487, DW_AT_decl_line(0x61)
    7539                            .dwattr $C$DW$487, DW_AT_decl_column(0x1c)
    7540                    
    7541                    $C$DW$488       .dwtag  DW_TAG_member
    7542                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$14)
    7543                            .dwattr $C$DW$488, DW_AT_name("rem")
    7544                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("rem")
    7545                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7546                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7547                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7548                            .dwattr $C$DW$488, DW_AT_decl_line(0x61)
    7549                            .dwattr $C$DW$488, DW_AT_decl_column(0x22)
    7550                    
    7551                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    7552                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x61)
    7553                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  139

    7554                            .dwendtag $C$DW$T$65
    7555                    
    7556                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    7557                            .dwattr $C$DW$T$186, DW_AT_name("lldiv_t")
    7558                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$65)
    7559                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    7560                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7561                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x61)
    7562                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x29)
    7563                    
    7564                    
    7565                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    7566                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    7567                    $C$DW$489       .dwtag  DW_TAG_member
    7568                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$67)
    7569                            .dwattr $C$DW$489, DW_AT_name("pointerStack")
    7570                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("pointerStack")
    7571                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7572                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7573                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7574                            .dwattr $C$DW$489, DW_AT_decl_line(0x3f5)
    7575                            .dwattr $C$DW$489, DW_AT_decl_column(0x16)
    7576                    
    7577                    $C$DW$490       .dwtag  DW_TAG_member
    7578                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$68)
    7579                            .dwattr $C$DW$490, DW_AT_name("directAPI")
    7580                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("directAPI")
    7581                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7582                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7583                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7584                            .dwattr $C$DW$490, DW_AT_decl_line(0x3f6)
    7585                            .dwattr $C$DW$490, DW_AT_decl_column(0x15)
    7586                    
    7587                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7588                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3f4)
    7589                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    7590                            .dwendtag $C$DW$T$69
    7591                    
    7592                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    7593                            .dwattr $C$DW$T$71, DW_AT_name("icall_directAPIMsg_t")
    7594                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    7595                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    7596                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7597                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x3f7)
    7598                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    7599                    
    7600                    
    7601                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7602                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x14)
    7603                    $C$DW$491       .dwtag  DW_TAG_member
    7604                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$70)
    7605                            .dwattr $C$DW$491, DW_AT_name("hdr")
    7606                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("hdr")
    7607                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7608                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  140

    7609                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7610                            .dwattr $C$DW$491, DW_AT_decl_line(0x3fb)
    7611                            .dwattr $C$DW$491, DW_AT_decl_column(0x10)
    7612                    
    7613                    $C$DW$492       .dwtag  DW_TAG_member
    7614                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$71)
    7615                            .dwattr $C$DW$492, DW_AT_name("msg")
    7616                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("msg")
    7617                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7618                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7619                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7620                            .dwattr $C$DW$492, DW_AT_decl_line(0x3fc)
    7621                            .dwattr $C$DW$492, DW_AT_decl_column(0x1a)
    7622                    
    7623                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7624                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3fa)
    7625                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    7626                            .dwendtag $C$DW$T$72
    7627                    
    7628                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    7629                            .dwattr $C$DW$T$187, DW_AT_name("icallLiteMsg_t")
    7630                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$72)
    7631                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    7632                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7633                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3fd)
    7634                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x03)
    7635                    
    7636                    
    7637                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7638                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    7639                    $C$DW$493       .dwtag  DW_TAG_member
    7640                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$73)
    7641                            .dwattr $C$DW$493, DW_AT_name("pwrmgr_task_state")
    7642                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("pwrmgr_task_state")
    7643                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7644                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7645                            .dwattr $C$DW$493, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7646                            .dwattr $C$DW$493, DW_AT_decl_line(0x48)
    7647                            .dwattr $C$DW$493, DW_AT_decl_column(0x0a)
    7648                    
    7649                            .dwattr $C$DW$T$74, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7650                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x47)
    7651                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    7652                            .dwendtag $C$DW$T$74
    7653                    
    7654                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    7655                            .dwattr $C$DW$T$188, DW_AT_name("pwrmgr_attribute_t")
    7656                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$74)
    7657                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    7658                            .dwattr $C$DW$T$188, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7659                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x4e)
    7660                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x03)
    7661                    
    7662                    
    7663                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  141

    7664                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    7665                    $C$DW$494       .dwtag  DW_TAG_member
    7666                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    7667                            .dwattr $C$DW$494, DW_AT_name("seconds")
    7668                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("seconds")
    7669                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7670                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7671                            .dwattr $C$DW$494, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7672                            .dwattr $C$DW$494, DW_AT_decl_line(0x50)
    7673                            .dwattr $C$DW$494, DW_AT_decl_column(0x09)
    7674                    
    7675                    $C$DW$495       .dwtag  DW_TAG_member
    7676                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    7677                            .dwattr $C$DW$495, DW_AT_name("minutes")
    7678                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("minutes")
    7679                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7680                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7681                            .dwattr $C$DW$495, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7682                            .dwattr $C$DW$495, DW_AT_decl_line(0x51)
    7683                            .dwattr $C$DW$495, DW_AT_decl_column(0x09)
    7684                    
    7685                    $C$DW$496       .dwtag  DW_TAG_member
    7686                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    7687                            .dwattr $C$DW$496, DW_AT_name("hour")
    7688                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("hour")
    7689                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7690                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7691                            .dwattr $C$DW$496, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7692                            .dwattr $C$DW$496, DW_AT_decl_line(0x52)
    7693                            .dwattr $C$DW$496, DW_AT_decl_column(0x09)
    7694                    
    7695                    $C$DW$497       .dwtag  DW_TAG_member
    7696                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    7697                            .dwattr $C$DW$497, DW_AT_name("day")
    7698                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("day")
    7699                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7700                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7701                            .dwattr $C$DW$497, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7702                            .dwattr $C$DW$497, DW_AT_decl_line(0x53)
    7703                            .dwattr $C$DW$497, DW_AT_decl_column(0x09)
    7704                    
    7705                    $C$DW$498       .dwtag  DW_TAG_member
    7706                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    7707                            .dwattr $C$DW$498, DW_AT_name("month")
    7708                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("month")
    7709                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7710                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7711                            .dwattr $C$DW$498, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7712                            .dwattr $C$DW$498, DW_AT_decl_line(0x54)
    7713                            .dwattr $C$DW$498, DW_AT_decl_column(0x09)
    7714                    
    7715                    $C$DW$499       .dwtag  DW_TAG_member
    7716                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$73)
    7717                            .dwattr $C$DW$499, DW_AT_name("year")
    7718                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("year")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  142

    7719                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7720                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7721                            .dwattr $C$DW$499, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7722                            .dwattr $C$DW$499, DW_AT_decl_line(0x55)
    7723                            .dwattr $C$DW$499, DW_AT_decl_column(0x0a)
    7724                    
    7725                            .dwattr $C$DW$T$75, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7726                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
    7727                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
    7728                            .dwendtag $C$DW$T$75
    7729                    
    7730                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    7731                            .dwattr $C$DW$T$189, DW_AT_name("UTCTimeStruct")
    7732                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$75)
    7733                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    7734                            .dwattr $C$DW$T$189, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7735                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x56)
    7736                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    7737                    
    7738                    
    7739                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7740                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
    7741                    $C$DW$500       .dwtag  DW_TAG_member
    7742                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$76)
    7743                            .dwattr $C$DW$500, DW_AT_name("bufferHead")
    7744                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("bufferHead")
    7745                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7746                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7747                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7748                            .dwattr $C$DW$500, DW_AT_decl_line(0x80)
    7749                            .dwattr $C$DW$500, DW_AT_decl_column(0x13)
    7750                    
    7751                    $C$DW$501       .dwtag  DW_TAG_member
    7752                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$76)
    7753                            .dwattr $C$DW$501, DW_AT_name("bufferTail")
    7754                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("bufferTail")
    7755                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7756                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    7757                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7758                            .dwattr $C$DW$501, DW_AT_decl_line(0x81)
    7759                            .dwattr $C$DW$501, DW_AT_decl_column(0x13)
    7760                    
    7761                    $C$DW$502       .dwtag  DW_TAG_member
    7762                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$73)
    7763                            .dwattr $C$DW$502, DW_AT_name("maxBufSize")
    7764                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("maxBufSize")
    7765                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7766                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    7767                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7768                            .dwattr $C$DW$502, DW_AT_decl_line(0x82)
    7769                            .dwattr $C$DW$502, DW_AT_decl_column(0x0a)
    7770                    
    7771                    $C$DW$503       .dwtag  DW_TAG_member
    7772                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$77)
    7773                            .dwattr $C$DW$503, DW_AT_name("pBuffer")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  143

    7774                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("pBuffer")
    7775                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7776                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    7777                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7778                            .dwattr $C$DW$503, DW_AT_decl_line(0x83)
    7779                            .dwattr $C$DW$503, DW_AT_decl_column(0x0a)
    7780                    
    7781                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7782                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x7e)
    7783                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    7784                            .dwendtag $C$DW$T$78
    7785                    
    7786                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    7787                            .dwattr $C$DW$T$80, DW_AT_name("halUARTBufControl_t")
    7788                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    7789                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    7790                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7791                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x84)
    7792                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    7793                    
    7794                    
    7795                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7796                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x2c)
    7797                    $C$DW$504       .dwtag  DW_TAG_member
    7798                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$79)
    7799                            .dwattr $C$DW$504, DW_AT_name("configured")
    7800                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("configured")
    7801                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7802                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    7803                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7804                            .dwattr $C$DW$504, DW_AT_decl_line(0x88)
    7805                            .dwattr $C$DW$504, DW_AT_decl_column(0x17)
    7806                    
    7807                    $C$DW$505       .dwtag  DW_TAG_member
    7808                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    7809                            .dwattr $C$DW$505, DW_AT_name("baudRate")
    7810                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("baudRate")
    7811                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7812                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    7813                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7814                            .dwattr $C$DW$505, DW_AT_decl_line(0x89)
    7815                            .dwattr $C$DW$505, DW_AT_decl_column(0x17)
    7816                    
    7817                    $C$DW$506       .dwtag  DW_TAG_member
    7818                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$79)
    7819                            .dwattr $C$DW$506, DW_AT_name("flowControl")
    7820                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("flowControl")
    7821                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7822                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    7823                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7824                            .dwattr $C$DW$506, DW_AT_decl_line(0x8a)
    7825                            .dwattr $C$DW$506, DW_AT_decl_column(0x17)
    7826                    
    7827                    $C$DW$507       .dwtag  DW_TAG_member
    7828                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$73)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  144

    7829                            .dwattr $C$DW$507, DW_AT_name("flowControlThreshold")
    7830                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("flowControlThreshold")
    7831                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7832                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    7833                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7834                            .dwattr $C$DW$507, DW_AT_decl_line(0x8b)
    7835                            .dwattr $C$DW$507, DW_AT_decl_column(0x17)
    7836                    
    7837                    $C$DW$508       .dwtag  DW_TAG_member
    7838                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    7839                            .dwattr $C$DW$508, DW_AT_name("idleTimeout")
    7840                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("idleTimeout")
    7841                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7842                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    7843                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7844                            .dwattr $C$DW$508, DW_AT_decl_line(0x8c)
    7845                            .dwattr $C$DW$508, DW_AT_decl_column(0x17)
    7846                    
    7847                    $C$DW$509       .dwtag  DW_TAG_member
    7848                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$80)
    7849                            .dwattr $C$DW$509, DW_AT_name("rx")
    7850                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("rx")
    7851                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7852                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    7853                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7854                            .dwattr $C$DW$509, DW_AT_decl_line(0x8d)
    7855                            .dwattr $C$DW$509, DW_AT_decl_column(0x17)
    7856                    
    7857                    $C$DW$510       .dwtag  DW_TAG_member
    7858                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$80)
    7859                            .dwattr $C$DW$510, DW_AT_name("tx")
    7860                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("tx")
    7861                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7862                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    7863                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7864                            .dwattr $C$DW$510, DW_AT_decl_line(0x8e)
    7865                            .dwattr $C$DW$510, DW_AT_decl_column(0x17)
    7866                    
    7867                    $C$DW$511       .dwtag  DW_TAG_member
    7868                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$79)
    7869                            .dwattr $C$DW$511, DW_AT_name("intEnable")
    7870                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("intEnable")
    7871                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7872                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    7873                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7874                            .dwattr $C$DW$511, DW_AT_decl_line(0x8f)
    7875                            .dwattr $C$DW$511, DW_AT_decl_column(0x17)
    7876                    
    7877                    $C$DW$512       .dwtag  DW_TAG_member
    7878                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$81)
    7879                            .dwattr $C$DW$512, DW_AT_name("rxChRvdTime")
    7880                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("rxChRvdTime")
    7881                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7882                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    7883                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  145

    7884                            .dwattr $C$DW$512, DW_AT_decl_line(0x90)
    7885                            .dwattr $C$DW$512, DW_AT_decl_column(0x17)
    7886                    
    7887                    $C$DW$513       .dwtag  DW_TAG_member
    7888                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$84)
    7889                            .dwattr $C$DW$513, DW_AT_name("callBackFunc")
    7890                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("callBackFunc")
    7891                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7892                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    7893                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7894                            .dwattr $C$DW$513, DW_AT_decl_line(0x91)
    7895                            .dwattr $C$DW$513, DW_AT_decl_column(0x17)
    7896                    
    7897                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7898                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x87)
    7899                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    7900                            .dwendtag $C$DW$T$85
    7901                    
    7902                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    7903                            .dwattr $C$DW$T$190, DW_AT_name("halUARTCfg_t")
    7904                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$85)
    7905                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    7906                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7907                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x92)
    7908                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x02)
    7909                    
    7910                    
    7911                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7912                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    7913                    $C$DW$514       .dwtag  DW_TAG_member
    7914                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$86)
    7915                            .dwattr $C$DW$514, DW_AT_name("hdr")
    7916                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("hdr")
    7917                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7918                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    7919                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    7920                            .dwattr $C$DW$514, DW_AT_decl_line(0xbc)
    7921                            .dwattr $C$DW$514, DW_AT_decl_column(0x14)
    7922                    
    7923                    $C$DW$515       .dwtag  DW_TAG_member
    7924                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    7925                            .dwattr $C$DW$515, DW_AT_name("state")
    7926                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("state")
    7927                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7928                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    7929                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    7930                            .dwattr $C$DW$515, DW_AT_decl_line(0xbd)
    7931                            .dwattr $C$DW$515, DW_AT_decl_column(0x09)
    7932                    
    7933                    $C$DW$516       .dwtag  DW_TAG_member
    7934                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    7935                            .dwattr $C$DW$516, DW_AT_name("keys")
    7936                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("keys")
    7937                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7938                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  146

    7939                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    7940                            .dwattr $C$DW$516, DW_AT_decl_line(0xbe)
    7941                            .dwattr $C$DW$516, DW_AT_decl_column(0x09)
    7942                    
    7943                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    7944                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xbb)
    7945                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    7946                            .dwendtag $C$DW$T$87
    7947                    
    7948                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    7949                            .dwattr $C$DW$T$191, DW_AT_name("keyChange_t")
    7950                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$87)
    7951                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    7952                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    7953                            .dwattr $C$DW$T$191, DW_AT_decl_line(0xbf)
    7954                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
    7955                    
    7956                    
    7957                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    7958                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    7959                    $C$DW$517       .dwtag  DW_TAG_member
    7960                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$89)
    7961                            .dwattr $C$DW$517, DW_AT_name("entityId")
    7962                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("entityId")
    7963                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7964                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    7965                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7966                            .dwattr $C$DW$517, DW_AT_decl_line(0x1fe)
    7967                            .dwattr $C$DW$517, DW_AT_decl_column(0x14)
    7968                    
    7969                    $C$DW$518       .dwtag  DW_TAG_member
    7970                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$91)
    7971                            .dwattr $C$DW$518, DW_AT_name("servId")
    7972                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("servId")
    7973                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7974                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    7975                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7976                            .dwattr $C$DW$518, DW_AT_decl_line(0x200)
    7977                            .dwattr $C$DW$518, DW_AT_decl_column(0x17)
    7978                    
    7979                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7980                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x1fc)
    7981                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    7982                            .dwendtag $C$DW$T$92
    7983                    
    7984                    
    7985                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    7986                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    7987                    $C$DW$519       .dwtag  DW_TAG_member
    7988                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$91)
    7989                            .dwattr $C$DW$519, DW_AT_name("servId")
    7990                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("servId")
    7991                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7992                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    7993                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  147

    7994                            .dwattr $C$DW$519, DW_AT_decl_line(0x211)
    7995                            .dwattr $C$DW$519, DW_AT_decl_column(0x17)
    7996                    
    7997                    $C$DW$520       .dwtag  DW_TAG_member
    7998                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$89)
    7999                            .dwattr $C$DW$520, DW_AT_name("entityId")
    8000                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("entityId")
    8001                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8002                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    8003                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8004                            .dwattr $C$DW$520, DW_AT_decl_line(0x213)
    8005                            .dwattr $C$DW$520, DW_AT_decl_column(0x14)
    8006                    
    8007                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8008                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x20f)
    8009                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    8010                            .dwendtag $C$DW$T$93
    8011                    
    8012                    
    8013                    $C$DW$T$94      .dwtag  DW_TAG_union_type
    8014                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x02)
    8015                    $C$DW$521       .dwtag  DW_TAG_member
    8016                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$79)
    8017                            .dwattr $C$DW$521, DW_AT_name("paramCTS")
    8018                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("paramCTS")
    8019                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8020                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    8021                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8022                            .dwattr $C$DW$521, DW_AT_decl_line(0x96)
    8023                            .dwattr $C$DW$521, DW_AT_decl_column(0x08)
    8024                    
    8025                    $C$DW$522       .dwtag  DW_TAG_member
    8026                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$79)
    8027                            .dwattr $C$DW$522, DW_AT_name("paramRTS")
    8028                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("paramRTS")
    8029                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8030                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    8031                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8032                            .dwattr $C$DW$522, DW_AT_decl_line(0x97)
    8033                            .dwattr $C$DW$522, DW_AT_decl_column(0x08)
    8034                    
    8035                    $C$DW$523       .dwtag  DW_TAG_member
    8036                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$79)
    8037                            .dwattr $C$DW$523, DW_AT_name("paramDSR")
    8038                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("paramDSR")
    8039                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8040                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8041                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8042                            .dwattr $C$DW$523, DW_AT_decl_line(0x98)
    8043                            .dwattr $C$DW$523, DW_AT_decl_column(0x08)
    8044                    
    8045                    $C$DW$524       .dwtag  DW_TAG_member
    8046                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$79)
    8047                            .dwattr $C$DW$524, DW_AT_name("paramDTR")
    8048                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("paramDTR")
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  148

    8049                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8050                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8051                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8052                            .dwattr $C$DW$524, DW_AT_decl_line(0x99)
    8053                            .dwattr $C$DW$524, DW_AT_decl_column(0x08)
    8054                    
    8055                    $C$DW$525       .dwtag  DW_TAG_member
    8056                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$79)
    8057                            .dwattr $C$DW$525, DW_AT_name("paramCD")
    8058                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("paramCD")
    8059                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8060                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8061                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8062                            .dwattr $C$DW$525, DW_AT_decl_line(0x9a)
    8063                            .dwattr $C$DW$525, DW_AT_decl_column(0x08)
    8064                    
    8065                    $C$DW$526       .dwtag  DW_TAG_member
    8066                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$79)
    8067                            .dwattr $C$DW$526, DW_AT_name("paramRI")
    8068                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("paramRI")
    8069                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8070                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8071                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8072                            .dwattr $C$DW$526, DW_AT_decl_line(0x9b)
    8073                            .dwattr $C$DW$526, DW_AT_decl_column(0x08)
    8074                    
    8075                    $C$DW$527       .dwtag  DW_TAG_member
    8076                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$73)
    8077                            .dwattr $C$DW$527, DW_AT_name("baudRate")
    8078                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("baudRate")
    8079                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8080                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8081                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8082                            .dwattr $C$DW$527, DW_AT_decl_line(0x9c)
    8083                            .dwattr $C$DW$527, DW_AT_decl_column(0x0a)
    8084                    
    8085                    $C$DW$528       .dwtag  DW_TAG_member
    8086                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$79)
    8087                            .dwattr $C$DW$528, DW_AT_name("flowControl")
    8088                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("flowControl")
    8089                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8090                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8091                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8092                            .dwattr $C$DW$528, DW_AT_decl_line(0x9d)
    8093                            .dwattr $C$DW$528, DW_AT_decl_column(0x08)
    8094                    
    8095                    $C$DW$529       .dwtag  DW_TAG_member
    8096                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$79)
    8097                            .dwattr $C$DW$529, DW_AT_name("flushControl")
    8098                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("flushControl")
    8099                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8100                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8101                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8102                            .dwattr $C$DW$529, DW_AT_decl_line(0x9e)
    8103                            .dwattr $C$DW$529, DW_AT_decl_column(0x08)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  149

    8104                    
    8105                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8106                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x95)
    8107                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    8108                            .dwendtag $C$DW$T$94
    8109                    
    8110                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    8111                            .dwattr $C$DW$T$192, DW_AT_name("halUARTIoctl_t")
    8112                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$94)
    8113                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    8114                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8115                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x9f)
    8116                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x02)
    8117                    
    8118                    
    8119                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    8120                            .dwattr $C$DW$T$99, DW_AT_name(".ggroup1")
    8121                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x2c)
    8122                    $C$DW$530       .dwtag  DW_TAG_member
    8123                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$6)
    8124                            .dwattr $C$DW$530, DW_AT_name("activeTaskID")
    8125                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("activeTaskID")
    8126                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8127                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8128                    
    8129                    $C$DW$531       .dwtag  DW_TAG_member
    8130                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$6)
    8131                            .dwattr $C$DW$531, DW_AT_name("osal_notask_entity")
    8132                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("osal_notask_entity")
    8133                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8134                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8135                    
    8136                    $C$DW$532       .dwtag  DW_TAG_member
    8137                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$95)
    8138                            .dwattr $C$DW$532, DW_AT_name("osal_proxy_tasks")
    8139                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("osal_proxy_tasks")
    8140                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8141                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8142                    
    8143                    $C$DW$533       .dwtag  DW_TAG_member
    8144                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$3)
    8145                            .dwattr $C$DW$533, DW_AT_name("osal_qHead")
    8146                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("osal_qHead")
    8147                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8148                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8149                    
    8150                    $C$DW$534       .dwtag  DW_TAG_member
    8151                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$37)
    8152                            .dwattr $C$DW$534, DW_AT_name("osal_eventloop_hook")
    8153                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("osal_eventloop_hook")
    8154                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8155                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8156                    
    8157                    $C$DW$535       .dwtag  DW_TAG_member
    8158                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$97)
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  150

    8159                            .dwattr $C$DW$535, DW_AT_name("osal_icallMsg_hook")
    8160                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("osal_icallMsg_hook")
    8161                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8162                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8163                    
    8164                    $C$DW$536       .dwtag  DW_TAG_member
    8165                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$3)
    8166                            .dwattr $C$DW$536, DW_AT_name("osal_semaphore")
    8167                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("osal_semaphore")
    8168                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8169                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8170                    
    8171                    $C$DW$537       .dwtag  DW_TAG_member
    8172                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$11)
    8173                            .dwattr $C$DW$537, DW_AT_name("osal_last_timestamp")
    8174                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("osal_last_timestamp")
    8175                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8176                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8177                    
    8178                    $C$DW$538       .dwtag  DW_TAG_member
    8179                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$11)
    8180                            .dwattr $C$DW$538, DW_AT_name("osal_tickperiod")
    8181                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("osal_tickperiod")
    8182                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8183                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8184                    
    8185                    $C$DW$539       .dwtag  DW_TAG_member
    8186                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$11)
    8187                            .dwattr $C$DW$539, DW_AT_name("osal_max_msecs")
    8188                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("osal_max_msecs")
    8189                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8190                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8191                    
    8192                    $C$DW$540       .dwtag  DW_TAG_member
    8193                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$3)
    8194                            .dwattr $C$DW$540, DW_AT_name("osal_timerid_msec_timer")
    8195                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("osal_timerid_msec_timer")
    8196                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8197                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8198                    
    8199                    $C$DW$541       .dwtag  DW_TAG_member
    8200                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$11)
    8201                            .dwattr $C$DW$541, DW_AT_name("osal_msec_timer_seq")
    8202                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("osal_msec_timer_seq")
    8203                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8204                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8205                    
    8206                    $C$DW$542       .dwtag  DW_TAG_member
    8207                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$98)
    8208                            .dwattr $C$DW$542, DW_AT_name("osal_dispatch_entities")
    8209                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("osal_dispatch_entities")
    8210                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8211                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8212                    
    8213                            .dwendtag $C$DW$T$99
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  151

    8214                    
    8215                    
    8216                    $C$DW$T$100     .dwtag  DW_TAG_structure_type
    8217                            .dwattr $C$DW$T$100, DW_AT_name("_ICall_LiteCmdStatus_")
    8218                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    8219                    $C$DW$543       .dwtag  DW_TAG_member
    8220                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$88)
    8221                            .dwattr $C$DW$543, DW_AT_name("cmdId")
    8222                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("cmdId")
    8223                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8224                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8225                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8226                            .dwattr $C$DW$543, DW_AT_decl_line(0x3f0)
    8227                            .dwattr $C$DW$543, DW_AT_decl_column(0x11)
    8228                    
    8229                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8230                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x3ee)
    8231                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x10)
    8232                            .dwendtag $C$DW$T$100
    8233                    
    8234                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    8235                            .dwattr $C$DW$T$194, DW_AT_name("ICall_LiteCmdStatus")
    8236                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$100)
    8237                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    8238                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8239                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x3f1)
    8240                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x03)
    8241                    
    8242                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    8243                            .dwattr $C$DW$T$2, DW_AT_name("void")
    8244                    
    8245                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    8246                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    8247                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    8248                    
    8249                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    8250                            .dwattr $C$DW$T$195, DW_AT_name("ICall_Semaphore")
    8251                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$3)
    8252                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    8253                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8254                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x1ac)
    8255                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x0f)
    8256                    
    8257                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    8258                            .dwattr $C$DW$T$114, DW_AT_name("ICall_SyncHandle")
    8259                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$3)
    8260                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    8261                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8262                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1aa)
    8263                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    8264                    
    8265                    $C$DW$T$196     .dwtag  DW_TAG_const_type
    8266                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$114)
    8267                    
    8268                    $C$DW$T$158     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  152

    8269                            .dwattr $C$DW$T$158, DW_AT_name("ICall_TimerID")
    8270                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$3)
    8271                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    8272                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8273                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x1b7)
    8274                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x0f)
    8275                    
    8276                    $C$DW$T$212     .dwtag  DW_TAG_const_type
    8277                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$3)
    8278                    
    8279                    $C$DW$T$209     .dwtag  DW_TAG_typedef
    8280                            .dwattr $C$DW$T$209, DW_AT_name("osal_msg_q_t")
    8281                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$3)
    8282                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    8283                            .dwattr $C$DW$T$209, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    8284                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x7d)
    8285                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x10)
    8286                    
    8287                    $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    8288                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    8289                            .dwattr $C$DW$T$210, DW_AT_address_class(0x20)
    8290                    
    8291                    $C$DW$T$213     .dwtag  DW_TAG_const_type
    8292                            .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$210)
    8293                    
    8294                    
    8295                    $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    8296                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    8297                            .dwendtag $C$DW$T$36
    8298                    
    8299                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    8300                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    8301                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    8302                    
    8303                    $C$DW$T$173     .dwtag  DW_TAG_typedef
    8304                            .dwattr $C$DW$T$173, DW_AT_name("APPASRTINTF_callAssrtHndler")
    8305                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$37)
    8306                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    8307                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8308                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x43)
    8309                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
    8310                    
    8311                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    8312                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    8313                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$37)
    8314                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    8315                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    8316                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x5f)
    8317                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    8318                    
    8319                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    8320                            .dwattr $C$DW$T$38, DW_AT_name("FPTR_RESETDEV_T")
    8321                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    8322                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8323                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
TI ARM Assembler PC v16.9.9 Sun Nov 25 16:40:48 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{8719FFD6-004A-4401-8DC3-4DA83C6CF1D8} PAGE  153

    8324                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4d)
    8325                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x19)
    8326                    
    8327                    $C$DW$T$214     .dwtag  DW_TAG_typedef
