TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 19:10:05 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/Services/nvoctp.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\sensor_cc1350lp_Lab5Part2\sensor_cc13
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    6454                            .dwattr $C$DW$T$665, DW_AT_type(*$C$DW$T$664)
    6455                            .dwattr $C$DW$T$665, DW_AT_language(DW_LANG_C)
    6456                            .dwattr $C$DW$T$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    6457                            .dwattr $C$DW$T$665, DW_AT_decl_line(0xb0)
    6458                            .dwattr $C$DW$T$665, DW_AT_decl_column(0x03)
    6459                    
    6460                    
    6461                    $C$DW$T$666     .dwtag  DW_TAG_enumeration_type
    6462                            .dwattr $C$DW$T$666, DW_AT_byte_size(0x01)
    6463                    $C$DW$415       .dwtag  DW_TAG_enumerator
    6464                            .dwattr $C$DW$415, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    6465                            .dwattr $C$DW$415, DW_AT_const_value(0xe0)
    6466                            .dwattr $C$DW$415, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6467                            .dwattr $C$DW$415, DW_AT_decl_line(0x3de)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  119

    6468                            .dwattr $C$DW$415, DW_AT_decl_column(0x04)
    6469                    
    6470                    $C$DW$416       .dwtag  DW_TAG_enumerator
    6471                            .dwattr $C$DW$416, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    6472                            .dwattr $C$DW$416, DW_AT_const_value(0xe1)
    6473                            .dwattr $C$DW$416, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6474                            .dwattr $C$DW$416, DW_AT_decl_line(0x3e0)
    6475                            .dwattr $C$DW$416, DW_AT_decl_column(0x04)
    6476                    
    6477                    $C$DW$417       .dwtag  DW_TAG_enumerator
    6478                            .dwattr $C$DW$417, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    6479                            .dwattr $C$DW$417, DW_AT_const_value(0xe2)
    6480                            .dwattr $C$DW$417, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6481                            .dwattr $C$DW$417, DW_AT_decl_line(0x3e2)
    6482                            .dwattr $C$DW$417, DW_AT_decl_column(0x04)
    6483                    
    6484                    $C$DW$418       .dwtag  DW_TAG_enumerator
    6485                            .dwattr $C$DW$418, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    6486                            .dwattr $C$DW$418, DW_AT_const_value(0xe3)
    6487                            .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6488                            .dwattr $C$DW$418, DW_AT_decl_line(0x3e4)
    6489                            .dwattr $C$DW$418, DW_AT_decl_column(0x04)
    6490                    
    6491                    $C$DW$419       .dwtag  DW_TAG_enumerator
    6492                            .dwattr $C$DW$419, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    6493                            .dwattr $C$DW$419, DW_AT_const_value(0xe4)
    6494                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6495                            .dwattr $C$DW$419, DW_AT_decl_line(0x3e6)
    6496                            .dwattr $C$DW$419, DW_AT_decl_column(0x04)
    6497                    
    6498                    $C$DW$420       .dwtag  DW_TAG_enumerator
    6499                            .dwattr $C$DW$420, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    6500                            .dwattr $C$DW$420, DW_AT_const_value(0xe5)
    6501                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6502                            .dwattr $C$DW$420, DW_AT_decl_line(0x3e8)
    6503                            .dwattr $C$DW$420, DW_AT_decl_column(0x04)
    6504                    
    6505                            .dwattr $C$DW$T$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6506                            .dwattr $C$DW$T$666, DW_AT_decl_line(0x3dc)
    6507                            .dwattr $C$DW$T$666, DW_AT_decl_column(0x01)
    6508                            .dwendtag $C$DW$T$666
    6509                    
    6510                    $C$DW$T$667     .dwtag  DW_TAG_typedef
    6511                            .dwattr $C$DW$T$667, DW_AT_name("ICall_RemotiCmdEvent_t")
    6512                            .dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$666)
    6513                            .dwattr $C$DW$T$667, DW_AT_language(DW_LANG_C)
    6514                            .dwattr $C$DW$T$667, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6515                            .dwattr $C$DW$T$667, DW_AT_decl_line(0x3e9)
    6516                            .dwattr $C$DW$T$667, DW_AT_decl_column(0x02)
    6517                    
    6518                    
    6519                    $C$DW$T$127     .dwtag  DW_TAG_structure_type
    6520                            .dwattr $C$DW$T$127, DW_AT_byte_size(0x10)
    6521                    $C$DW$421       .dwtag  DW_TAG_member
    6522                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$124)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  120

    6523                            .dwattr $C$DW$421, DW_AT_name("cmpid")
    6524                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("cmpid")
    6525                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6526                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6527                            .dwattr $C$DW$421, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6528                            .dwattr $C$DW$421, DW_AT_decl_line(0xea)
    6529                            .dwattr $C$DW$421, DW_AT_decl_column(0x0e)
    6530                    
    6531                    $C$DW$422       .dwtag  DW_TAG_member
    6532                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$125)
    6533                            .dwattr $C$DW$422, DW_AT_name("subid")
    6534                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("subid")
    6535                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6536                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6537                            .dwattr $C$DW$422, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6538                            .dwattr $C$DW$422, DW_AT_decl_line(0xeb)
    6539                            .dwattr $C$DW$422, DW_AT_decl_column(0x0e)
    6540                    
    6541                    $C$DW$423       .dwtag  DW_TAG_member
    6542                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$125)
    6543                            .dwattr $C$DW$423, DW_AT_name("itmid")
    6544                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("itmid")
    6545                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6546                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6547                            .dwattr $C$DW$423, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6548                            .dwattr $C$DW$423, DW_AT_decl_line(0xec)
    6549                            .dwattr $C$DW$423, DW_AT_decl_column(0x0e)
    6550                    
    6551                    $C$DW$424       .dwtag  DW_TAG_member
    6552                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$126)
    6553                            .dwattr $C$DW$424, DW_AT_name("sysid")
    6554                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("sysid")
    6555                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6556                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6557                            .dwattr $C$DW$424, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6558                            .dwattr $C$DW$424, DW_AT_decl_line(0xed)
    6559                            .dwattr $C$DW$424, DW_AT_decl_column(0x0e)
    6560                    
    6561                    $C$DW$425       .dwtag  DW_TAG_member
    6562                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$126)
    6563                            .dwattr $C$DW$425, DW_AT_name("stats")
    6564                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("stats")
    6565                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6566                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6567                            .dwattr $C$DW$425, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6568                            .dwattr $C$DW$425, DW_AT_decl_line(0xee)
    6569                            .dwattr $C$DW$425, DW_AT_decl_column(0x0e)
    6570                    
    6571                    $C$DW$426       .dwtag  DW_TAG_member
    6572                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$125)
    6573                            .dwattr $C$DW$426, DW_AT_name("hofs")
    6574                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("hofs")
    6575                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6576                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6577                            .dwattr $C$DW$426, DW_AT_decl_file("../Application/Services/nvoctp.c")
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  121

    6578                            .dwattr $C$DW$426, DW_AT_decl_line(0xef)
    6579                            .dwattr $C$DW$426, DW_AT_decl_column(0x0e)
    6580                    
    6581                    $C$DW$427       .dwtag  DW_TAG_member
    6582                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$125)
    6583                            .dwattr $C$DW$427, DW_AT_name("len")
    6584                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("len")
    6585                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6586                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6587                            .dwattr $C$DW$427, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6588                            .dwattr $C$DW$427, DW_AT_decl_line(0xf0)
    6589                            .dwattr $C$DW$427, DW_AT_decl_column(0x0e)
    6590                    
    6591                            .dwattr $C$DW$T$127, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6592                            .dwattr $C$DW$T$127, DW_AT_decl_line(0xe9)
    6593                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x01)
    6594                            .dwendtag $C$DW$T$127
    6595                    
    6596                    $C$DW$T$128     .dwtag  DW_TAG_typedef
    6597                            .dwattr $C$DW$T$128, DW_AT_name("NVOCTP_itemHdr_t")
    6598                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    6599                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    6600                            .dwattr $C$DW$T$128, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6601                            .dwattr $C$DW$T$128, DW_AT_decl_line(0xf1)
    6602                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x03)
    6603                    
    6604                    $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    6605                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    6606                            .dwattr $C$DW$T$129, DW_AT_address_class(0x20)
    6607                    
    6608                    $C$DW$T$668     .dwtag  DW_TAG_const_type
    6609                            .dwattr $C$DW$T$668, DW_AT_type(*$C$DW$T$129)
    6610                    
    6611                    
    6612                    $C$DW$T$131     .dwtag  DW_TAG_structure_type
    6613                            .dwattr $C$DW$T$131, DW_AT_byte_size(0x10)
    6614                    $C$DW$428       .dwtag  DW_TAG_member
    6615                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$129)
    6616                            .dwattr $C$DW$428, DW_AT_name("iHdr")
    6617                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("iHdr")
    6618                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6619                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6620                            .dwattr $C$DW$428, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6621                            .dwattr $C$DW$428, DW_AT_decl_line(0x117)
    6622                            .dwattr $C$DW$428, DW_AT_decl_column(0x17)
    6623                    
    6624                    $C$DW$429       .dwtag  DW_TAG_member
    6625                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$125)
    6626                            .dwattr $C$DW$429, DW_AT_name("dOfs")
    6627                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("dOfs")
    6628                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6629                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6630                            .dwattr $C$DW$429, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6631                            .dwattr $C$DW$429, DW_AT_decl_line(0x118)
    6632                            .dwattr $C$DW$429, DW_AT_decl_column(0x17)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  122

    6633                    
    6634                    $C$DW$430       .dwtag  DW_TAG_member
    6635                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$125)
    6636                            .dwattr $C$DW$430, DW_AT_name("bOfs")
    6637                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("bOfs")
    6638                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6639                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6640                            .dwattr $C$DW$430, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6641                            .dwattr $C$DW$430, DW_AT_decl_line(0x119)
    6642                            .dwattr $C$DW$430, DW_AT_decl_column(0x17)
    6643                    
    6644                    $C$DW$431       .dwtag  DW_TAG_member
    6645                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$125)
    6646                            .dwattr $C$DW$431, DW_AT_name("bLen")
    6647                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("bLen")
    6648                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6649                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6650                            .dwattr $C$DW$431, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6651                            .dwattr $C$DW$431, DW_AT_decl_line(0x11a)
    6652                            .dwattr $C$DW$431, DW_AT_decl_column(0x17)
    6653                    
    6654                    $C$DW$432       .dwtag  DW_TAG_member
    6655                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$130)
    6656                            .dwattr $C$DW$432, DW_AT_name("pBuf")
    6657                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("pBuf")
    6658                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6659                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6660                            .dwattr $C$DW$432, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6661                            .dwattr $C$DW$432, DW_AT_decl_line(0x11b)
    6662                            .dwattr $C$DW$432, DW_AT_decl_column(0x17)
    6663                    
    6664                            .dwattr $C$DW$T$131, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6665                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x116)
    6666                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x01)
    6667                            .dwendtag $C$DW$T$131
    6668                    
    6669                    $C$DW$T$672     .dwtag  DW_TAG_typedef
    6670                            .dwattr $C$DW$T$672, DW_AT_name("NVOCTP_itemWrp_t")
    6671                            .dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$131)
    6672                            .dwattr $C$DW$T$672, DW_AT_language(DW_LANG_C)
    6673                            .dwattr $C$DW$T$672, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6674                            .dwattr $C$DW$T$672, DW_AT_decl_line(0x11c)
    6675                            .dwattr $C$DW$T$672, DW_AT_decl_column(0x03)
    6676                    
    6677                    $C$DW$T$673     .dwtag  DW_TAG_pointer_type
    6678                            .dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$672)
    6679                            .dwattr $C$DW$T$673, DW_AT_address_class(0x20)
    6680                    
    6681                    $C$DW$T$674     .dwtag  DW_TAG_const_type
    6682                            .dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$673)
    6683                    
    6684                    
    6685                    $C$DW$T$132     .dwtag  DW_TAG_structure_type
    6686                            .dwattr $C$DW$T$132, DW_AT_byte_size(0x04)
    6687                    $C$DW$433       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  123

    6688                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$126)
    6689                            .dwattr $C$DW$433, DW_AT_name("state")
    6690                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("state")
    6691                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6692                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6693                            .dwattr $C$DW$433, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6694                            .dwattr $C$DW$433, DW_AT_decl_line(0xc4)
    6695                            .dwattr $C$DW$433, DW_AT_decl_column(0x0d)
    6696                    
    6697                    $C$DW$434       .dwtag  DW_TAG_member
    6698                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$126)
    6699                            .dwattr $C$DW$434, DW_AT_name("cycle")
    6700                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("cycle")
    6701                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6702                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6703                            .dwattr $C$DW$434, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6704                            .dwattr $C$DW$434, DW_AT_decl_line(0xc5)
    6705                            .dwattr $C$DW$434, DW_AT_decl_column(0x0d)
    6706                    
    6707                    $C$DW$435       .dwtag  DW_TAG_member
    6708                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$126)
    6709                            .dwattr $C$DW$435, DW_AT_name("version")
    6710                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("version")
    6711                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6712                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6713                            .dwattr $C$DW$435, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6714                            .dwattr $C$DW$435, DW_AT_decl_line(0xc6)
    6715                            .dwattr $C$DW$435, DW_AT_decl_column(0x0d)
    6716                    
    6717                    $C$DW$436       .dwtag  DW_TAG_member
    6718                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$126)
    6719                            .dwattr $C$DW$436, DW_AT_name("signature")
    6720                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("signature")
    6721                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6722                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6723                            .dwattr $C$DW$436, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6724                            .dwattr $C$DW$436, DW_AT_decl_line(0xc7)
    6725                            .dwattr $C$DW$436, DW_AT_decl_column(0x0d)
    6726                    
    6727                            .dwattr $C$DW$T$132, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6728                            .dwattr $C$DW$T$132, DW_AT_decl_line(0xc3)
    6729                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x01)
    6730                            .dwendtag $C$DW$T$132
    6731                    
    6732                    $C$DW$T$677     .dwtag  DW_TAG_typedef
    6733                            .dwattr $C$DW$T$677, DW_AT_name("NVOCTP_pageHdr_t")
    6734                            .dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$132)
    6735                            .dwattr $C$DW$T$677, DW_AT_language(DW_LANG_C)
    6736                            .dwattr $C$DW$T$677, DW_AT_decl_file("../Application/Services/nvoctp.c")
    6737                            .dwattr $C$DW$T$677, DW_AT_decl_line(0xc8)
    6738                            .dwattr $C$DW$T$677, DW_AT_decl_column(0x03)
    6739                    
    6740                    
    6741                    $C$DW$T$133     .dwtag  DW_TAG_structure_type
    6742                            .dwattr $C$DW$T$133, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  124

    6743                    $C$DW$437       .dwtag  DW_TAG_member
    6744                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$124)
    6745                            .dwattr $C$DW$437, DW_AT_name("compacts")
    6746                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("compacts")
    6747                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6748                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6749                            .dwattr $C$DW$437, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6750                            .dwattr $C$DW$437, DW_AT_decl_line(0x46)
    6751                            .dwattr $C$DW$437, DW_AT_decl_column(0x0e)
    6752                    
    6753                    $C$DW$438       .dwtag  DW_TAG_member
    6754                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$125)
    6755                            .dwattr $C$DW$438, DW_AT_name("resets")
    6756                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("resets")
    6757                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6758                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6759                            .dwattr $C$DW$438, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6760                            .dwattr $C$DW$438, DW_AT_decl_line(0x47)
    6761                            .dwattr $C$DW$438, DW_AT_decl_column(0x0e)
    6762                    
    6763                    $C$DW$439       .dwtag  DW_TAG_member
    6764                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$125)
    6765                            .dwattr $C$DW$439, DW_AT_name("available")
    6766                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("available")
    6767                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6768                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6769                            .dwattr $C$DW$439, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6770                            .dwattr $C$DW$439, DW_AT_decl_line(0x48)
    6771                            .dwattr $C$DW$439, DW_AT_decl_column(0x0e)
    6772                    
    6773                    $C$DW$440       .dwtag  DW_TAG_member
    6774                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$125)
    6775                            .dwattr $C$DW$440, DW_AT_name("active")
    6776                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("active")
    6777                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6778                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6779                            .dwattr $C$DW$440, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6780                            .dwattr $C$DW$440, DW_AT_decl_line(0x49)
    6781                            .dwattr $C$DW$440, DW_AT_decl_column(0x0e)
    6782                    
    6783                    $C$DW$441       .dwtag  DW_TAG_member
    6784                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$125)
    6785                            .dwattr $C$DW$441, DW_AT_name("reserved")
    6786                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("reserved")
    6787                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6788                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6789                            .dwattr $C$DW$441, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6790                            .dwattr $C$DW$441, DW_AT_decl_line(0x4a)
    6791                            .dwattr $C$DW$441, DW_AT_decl_column(0x0e)
    6792                    
    6793                            .dwattr $C$DW$T$133, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6794                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x45)
    6795                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x01)
    6796                            .dwendtag $C$DW$T$133
    6797                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  125

    6798                    $C$DW$T$678     .dwtag  DW_TAG_typedef
    6799                            .dwattr $C$DW$T$678, DW_AT_name("NVOCTP_diag_t")
    6800                            .dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$133)
    6801                            .dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
    6802                            .dwattr $C$DW$T$678, DW_AT_decl_file("..\Application\Services\nvoctp.h")
    6803                            .dwattr $C$DW$T$678, DW_AT_decl_line(0x4c)
    6804                            .dwattr $C$DW$T$678, DW_AT_decl_column(0x01)
    6805                    
    6806                    
    6807                    $C$DW$T$136     .dwtag  DW_TAG_structure_type
    6808                            .dwattr $C$DW$T$136, DW_AT_byte_size(0x08)
    6809                    $C$DW$442       .dwtag  DW_TAG_member
    6810                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$10)
    6811                            .dwattr $C$DW$442, DW_AT_name("length")
    6812                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("length")
    6813                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6814                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6815                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6816                            .dwattr $C$DW$442, DW_AT_decl_line(0x165)
    6817                            .dwattr $C$DW$442, DW_AT_decl_column(0x16)
    6818                    
    6819                    $C$DW$443       .dwtag  DW_TAG_member
    6820                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$135)
    6821                            .dwattr $C$DW$443, DW_AT_name("elem")
    6822                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("elem")
    6823                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6824                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6825                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6826                            .dwattr $C$DW$443, DW_AT_decl_line(0x165)
    6827                            .dwattr $C$DW$443, DW_AT_decl_column(0x3a)
    6828                    
    6829                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6830                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x165)
    6831                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x10)
    6832                            .dwendtag $C$DW$T$136
    6833                    
    6834                    $C$DW$T$679     .dwtag  DW_TAG_typedef
    6835                            .dwattr $C$DW$T$679, DW_AT_name("ARRAY1_ti_sysbios_knl_Swi_hooks")
    6836                            .dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$136)
    6837                            .dwattr $C$DW$T$679, DW_AT_language(DW_LANG_C)
    6838                            .dwattr $C$DW$T$679, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6839                            .dwattr $C$DW$T$679, DW_AT_decl_line(0x165)
    6840                            .dwattr $C$DW$T$679, DW_AT_decl_column(0x42)
    6841                    
    6842                    
    6843                    $C$DW$T$139     .dwtag  DW_TAG_structure_type
    6844                            .dwattr $C$DW$T$139, DW_AT_byte_size(0x08)
    6845                    $C$DW$444       .dwtag  DW_TAG_member
    6846                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$10)
    6847                            .dwattr $C$DW$444, DW_AT_name("length")
    6848                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("length")
    6849                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6850                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6851                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6852                            .dwattr $C$DW$444, DW_AT_decl_line(0x166)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  126

    6853                            .dwattr $C$DW$444, DW_AT_decl_column(0x16)
    6854                    
    6855                    $C$DW$445       .dwtag  DW_TAG_member
    6856                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$138)
    6857                            .dwattr $C$DW$445, DW_AT_name("elem")
    6858                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("elem")
    6859                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6860                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6861                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6862                            .dwattr $C$DW$445, DW_AT_decl_line(0x166)
    6863                            .dwattr $C$DW$445, DW_AT_decl_column(0x40)
    6864                    
    6865                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6866                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x166)
    6867                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x10)
    6868                            .dwendtag $C$DW$T$139
    6869                    
    6870                    $C$DW$T$680     .dwtag  DW_TAG_typedef
    6871                            .dwattr $C$DW$T$680, DW_AT_name("CARRAY1_ti_sysbios_knl_Swi_hooks")
    6872                            .dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$139)
    6873                            .dwattr $C$DW$T$680, DW_AT_language(DW_LANG_C)
    6874                            .dwattr $C$DW$T$680, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6875                            .dwattr $C$DW$T$680, DW_AT_decl_line(0x166)
    6876                            .dwattr $C$DW$T$680, DW_AT_decl_column(0x48)
    6877                    
    6878                    $C$DW$T$681     .dwtag  DW_TAG_typedef
    6879                            .dwattr $C$DW$T$681, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    6880                            .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$680)
    6881                            .dwattr $C$DW$T$681, DW_AT_language(DW_LANG_C)
    6882                            .dwattr $C$DW$T$681, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6883                            .dwattr $C$DW$T$681, DW_AT_decl_line(0x168)
    6884                            .dwattr $C$DW$T$681, DW_AT_decl_column(0x2a)
    6885                    
    6886                    $C$DW$T$682     .dwtag  DW_TAG_typedef
    6887                            .dwattr $C$DW$T$682, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    6888                            .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$680)
    6889                            .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
    6890                            .dwattr $C$DW$T$682, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6891                            .dwattr $C$DW$T$682, DW_AT_decl_line(0x167)
    6892                            .dwattr $C$DW$T$682, DW_AT_decl_column(0x2a)
    6893                    
    6894                    
    6895                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    6896                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    6897                    $C$DW$446       .dwtag  DW_TAG_member
    6898                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$10)
    6899                            .dwattr $C$DW$446, DW_AT_name("length")
    6900                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("length")
    6901                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6902                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6903                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6904                            .dwattr $C$DW$446, DW_AT_decl_line(0x29b)
    6905                            .dwattr $C$DW$446, DW_AT_decl_column(0x16)
    6906                    
    6907                    $C$DW$447       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  127

    6908                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$141)
    6909                            .dwattr $C$DW$447, DW_AT_name("elem")
    6910                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("elem")
    6911                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6912                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6913                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6914                            .dwattr $C$DW$447, DW_AT_decl_line(0x29b)
    6915                            .dwattr $C$DW$447, DW_AT_decl_column(0x3b)
    6916                    
    6917                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6918                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x29b)
    6919                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    6920                            .dwendtag $C$DW$T$142
    6921                    
    6922                    $C$DW$T$683     .dwtag  DW_TAG_typedef
    6923                            .dwattr $C$DW$T$683, DW_AT_name("ARRAY1_ti_sysbios_knl_Task_hooks")
    6924                            .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$142)
    6925                            .dwattr $C$DW$T$683, DW_AT_language(DW_LANG_C)
    6926                            .dwattr $C$DW$T$683, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6927                            .dwattr $C$DW$T$683, DW_AT_decl_line(0x29b)
    6928                            .dwattr $C$DW$T$683, DW_AT_decl_column(0x43)
    6929                    
    6930                    
    6931                    $C$DW$T$145     .dwtag  DW_TAG_structure_type
    6932                            .dwattr $C$DW$T$145, DW_AT_byte_size(0x08)
    6933                    $C$DW$448       .dwtag  DW_TAG_member
    6934                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$10)
    6935                            .dwattr $C$DW$448, DW_AT_name("length")
    6936                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("length")
    6937                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6938                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    6939                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6940                            .dwattr $C$DW$448, DW_AT_decl_line(0x29c)
    6941                            .dwattr $C$DW$448, DW_AT_decl_column(0x16)
    6942                    
    6943                    $C$DW$449       .dwtag  DW_TAG_member
    6944                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$144)
    6945                            .dwattr $C$DW$449, DW_AT_name("elem")
    6946                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("elem")
    6947                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6948                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6949                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/packa
    6950                            .dwattr $C$DW$449, DW_AT_decl_line(0x29c)
    6951                            .dwattr $C$DW$449, DW_AT_decl_column(0x41)
    6952                    
    6953                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6954                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x29c)
    6955                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
    6956                            .dwendtag $C$DW$T$145
    6957                    
    6958                    $C$DW$T$684     .dwtag  DW_TAG_typedef
    6959                            .dwattr $C$DW$T$684, DW_AT_name("CARRAY1_ti_sysbios_knl_Task_hooks")
    6960                            .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$145)
    6961                            .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    6962                            .dwattr $C$DW$T$684, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  128

    6963                            .dwattr $C$DW$T$684, DW_AT_decl_line(0x29c)
    6964                            .dwattr $C$DW$T$684, DW_AT_decl_column(0x49)
    6965                    
    6966                    $C$DW$T$685     .dwtag  DW_TAG_typedef
    6967                            .dwattr $C$DW$T$685, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    6968                            .dwattr $C$DW$T$685, DW_AT_type(*$C$DW$T$684)
    6969                            .dwattr $C$DW$T$685, DW_AT_language(DW_LANG_C)
    6970                            .dwattr $C$DW$T$685, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6971                            .dwattr $C$DW$T$685, DW_AT_decl_line(0x29e)
    6972                            .dwattr $C$DW$T$685, DW_AT_decl_column(0x2b)
    6973                    
    6974                    $C$DW$T$686     .dwtag  DW_TAG_typedef
    6975                            .dwattr $C$DW$T$686, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    6976                            .dwattr $C$DW$T$686, DW_AT_type(*$C$DW$T$684)
    6977                            .dwattr $C$DW$T$686, DW_AT_language(DW_LANG_C)
    6978                            .dwattr $C$DW$T$686, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/kernel/tirtos/pac
    6979                            .dwattr $C$DW$T$686, DW_AT_decl_line(0x29d)
    6980                            .dwattr $C$DW$T$686, DW_AT_decl_column(0x2b)
    6981                    
    6982                    
    6983                    $C$DW$T$183     .dwtag  DW_TAG_structure_type
    6984                            .dwattr $C$DW$T$183, DW_AT_byte_size(0x4c)
    6985                    $C$DW$450       .dwtag  DW_TAG_member
    6986                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$148)
    6987                            .dwattr $C$DW$450, DW_AT_name("Crc32")
    6988                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("Crc32")
    6989                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6990                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6991                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    6992                            .dwattr $C$DW$450, DW_AT_decl_line(0x76)
    6993                            .dwattr $C$DW$450, DW_AT_decl_column(0x25)
    6994                    
    6995                    $C$DW$451       .dwtag  DW_TAG_member
    6996                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$151)
    6997                            .dwattr $C$DW$451, DW_AT_name("FlashGetSize")
    6998                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("FlashGetSize")
    6999                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7000                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7001                            .dwattr $C$DW$451, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7002                            .dwattr $C$DW$451, DW_AT_decl_line(0x77)
    7003                            .dwattr $C$DW$451, DW_AT_decl_column(0x25)
    7004                    
    7005                    $C$DW$452       .dwtag  DW_TAG_member
    7006                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$152)
    7007                            .dwattr $C$DW$452, DW_AT_name("GetChipId")
    7008                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("GetChipId")
    7009                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7010                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7011                            .dwattr $C$DW$452, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7012                            .dwattr $C$DW$452, DW_AT_decl_line(0x78)
    7013                            .dwattr $C$DW$452, DW_AT_decl_column(0x25)
    7014                    
    7015                    $C$DW$453       .dwtag  DW_TAG_member
    7016                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$155)
    7017                            .dwattr $C$DW$453, DW_AT_name("ReservedLocation1")
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  129

    7018                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("ReservedLocation1")
    7019                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7020                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7021                            .dwattr $C$DW$453, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7022                            .dwattr $C$DW$453, DW_AT_decl_line(0x79)
    7023                            .dwattr $C$DW$453, DW_AT_decl_column(0x25)
    7024                    
    7025                    $C$DW$454       .dwtag  DW_TAG_member
    7026                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$156)
    7027                            .dwattr $C$DW$454, DW_AT_name("ReservedLocation2")
    7028                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("ReservedLocation2")
    7029                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7030                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7031                            .dwattr $C$DW$454, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7032                            .dwattr $C$DW$454, DW_AT_decl_line(0x7a)
    7033                            .dwattr $C$DW$454, DW_AT_decl_column(0x25)
    7034                    
    7035                    $C$DW$455       .dwtag  DW_TAG_member
    7036                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$157)
    7037                            .dwattr $C$DW$455, DW_AT_name("ReservedLocation3")
    7038                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("ReservedLocation3")
    7039                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7040                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7041                            .dwattr $C$DW$455, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7042                            .dwattr $C$DW$455, DW_AT_decl_line(0x7b)
    7043                            .dwattr $C$DW$455, DW_AT_decl_column(0x25)
    7044                    
    7045                    $C$DW$456       .dwtag  DW_TAG_member
    7046                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$160)
    7047                            .dwattr $C$DW$456, DW_AT_name("ResetDevice")
    7048                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("ResetDevice")
    7049                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7050                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7051                            .dwattr $C$DW$456, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7052                            .dwattr $C$DW$456, DW_AT_decl_line(0x7c)
    7053                            .dwattr $C$DW$456, DW_AT_decl_column(0x25)
    7054                    
    7055                    $C$DW$457       .dwtag  DW_TAG_member
    7056                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$164)
    7057                            .dwattr $C$DW$457, DW_AT_name("Fletcher32")
    7058                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("Fletcher32")
    7059                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7060                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7061                            .dwattr $C$DW$457, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7062                            .dwattr $C$DW$457, DW_AT_decl_line(0x7d)
    7063                            .dwattr $C$DW$457, DW_AT_decl_column(0x25)
    7064                    
    7065                    $C$DW$458       .dwtag  DW_TAG_member
    7066                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$168)
    7067                            .dwattr $C$DW$458, DW_AT_name("MinValue")
    7068                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("MinValue")
    7069                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7070                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    7071                            .dwattr $C$DW$458, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7072                            .dwattr $C$DW$458, DW_AT_decl_line(0x7e)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  130

    7073                            .dwattr $C$DW$458, DW_AT_decl_column(0x25)
    7074                    
    7075                    $C$DW$459       .dwtag  DW_TAG_member
    7076                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$169)
    7077                            .dwattr $C$DW$459, DW_AT_name("MaxValue")
    7078                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("MaxValue")
    7079                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7080                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7081                            .dwattr $C$DW$459, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7082                            .dwattr $C$DW$459, DW_AT_decl_line(0x7f)
    7083                            .dwattr $C$DW$459, DW_AT_decl_column(0x25)
    7084                    
    7085                    $C$DW$460       .dwtag  DW_TAG_member
    7086                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$170)
    7087                            .dwattr $C$DW$460, DW_AT_name("MeanValue")
    7088                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("MeanValue")
    7089                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7090                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7091                            .dwattr $C$DW$460, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7092                            .dwattr $C$DW$460, DW_AT_decl_line(0x80)
    7093                            .dwattr $C$DW$460, DW_AT_decl_column(0x25)
    7094                    
    7095                    $C$DW$461       .dwtag  DW_TAG_member
    7096                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$171)
    7097                            .dwattr $C$DW$461, DW_AT_name("StandDeviationValue")
    7098                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("StandDeviationValue")
    7099                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7100                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7101                            .dwattr $C$DW$461, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7102                            .dwattr $C$DW$461, DW_AT_decl_line(0x81)
    7103                            .dwattr $C$DW$461, DW_AT_decl_column(0x25)
    7104                    
    7105                    $C$DW$462       .dwtag  DW_TAG_member
    7106                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$174)
    7107                            .dwattr $C$DW$462, DW_AT_name("ReservedLocation4")
    7108                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("ReservedLocation4")
    7109                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7110                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7111                            .dwattr $C$DW$462, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7112                            .dwattr $C$DW$462, DW_AT_decl_line(0x82)
    7113                            .dwattr $C$DW$462, DW_AT_decl_column(0x25)
    7114                    
    7115                    $C$DW$463       .dwtag  DW_TAG_member
    7116                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$175)
    7117                            .dwattr $C$DW$463, DW_AT_name("ReservedLocation5")
    7118                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("ReservedLocation5")
    7119                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7120                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7121                            .dwattr $C$DW$463, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7122                            .dwattr $C$DW$463, DW_AT_decl_line(0x83)
    7123                            .dwattr $C$DW$463, DW_AT_decl_column(0x25)
    7124                    
    7125                    $C$DW$464       .dwtag  DW_TAG_member
    7126                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$176)
    7127                            .dwattr $C$DW$464, DW_AT_name("HFSourceSafeSwitch")
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  131

    7128                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7129                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7130                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7131                            .dwattr $C$DW$464, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7132                            .dwattr $C$DW$464, DW_AT_decl_line(0x84)
    7133                            .dwattr $C$DW$464, DW_AT_decl_column(0x25)
    7134                    
    7135                    $C$DW$465       .dwtag  DW_TAG_member
    7136                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$179)
    7137                            .dwattr $C$DW$465, DW_AT_name("SelectCompAInput")
    7138                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("SelectCompAInput")
    7139                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7140                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7141                            .dwattr $C$DW$465, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7142                            .dwattr $C$DW$465, DW_AT_decl_line(0x85)
    7143                            .dwattr $C$DW$465, DW_AT_decl_column(0x25)
    7144                    
    7145                    $C$DW$466       .dwtag  DW_TAG_member
    7146                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$180)
    7147                            .dwattr $C$DW$466, DW_AT_name("SelectCompARef")
    7148                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("SelectCompARef")
    7149                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7150                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7151                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7152                            .dwattr $C$DW$466, DW_AT_decl_line(0x86)
    7153                            .dwattr $C$DW$466, DW_AT_decl_column(0x25)
    7154                    
    7155                    $C$DW$467       .dwtag  DW_TAG_member
    7156                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$181)
    7157                            .dwattr $C$DW$467, DW_AT_name("SelectADCCompBInput")
    7158                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7159                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7160                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7161                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7162                            .dwattr $C$DW$467, DW_AT_decl_line(0x87)
    7163                            .dwattr $C$DW$467, DW_AT_decl_column(0x25)
    7164                    
    7165                    $C$DW$468       .dwtag  DW_TAG_member
    7166                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$182)
    7167                            .dwattr $C$DW$468, DW_AT_name("SelectCompBRef")
    7168                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("SelectCompBRef")
    7169                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7170                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7171                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7172                            .dwattr $C$DW$468, DW_AT_decl_line(0x88)
    7173                            .dwattr $C$DW$468, DW_AT_decl_column(0x25)
    7174                    
    7175                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7176                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x75)
    7177                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x01)
    7178                            .dwendtag $C$DW$T$183
    7179                    
    7180                    $C$DW$T$687     .dwtag  DW_TAG_typedef
    7181                            .dwattr $C$DW$T$687, DW_AT_name("HARD_API_T")
    7182                            .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$183)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  132

    7183                            .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    7184                            .dwattr $C$DW$T$687, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7185                            .dwattr $C$DW$T$687, DW_AT_decl_line(0x89)
    7186                            .dwattr $C$DW$T$687, DW_AT_decl_column(0x03)
    7187                    
    7188                    
    7189                    $C$DW$T$184     .dwtag  DW_TAG_structure_type
    7190                            .dwattr $C$DW$T$184, DW_AT_byte_size(0x08)
    7191                    $C$DW$469       .dwtag  DW_TAG_member
    7192                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$10)
    7193                            .dwattr $C$DW$469, DW_AT_name("quot")
    7194                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("quot")
    7195                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7196                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7197                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7198                            .dwattr $C$DW$469, DW_AT_decl_line(0x5c)
    7199                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    7200                    
    7201                    $C$DW$470       .dwtag  DW_TAG_member
    7202                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$10)
    7203                            .dwattr $C$DW$470, DW_AT_name("rem")
    7204                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("rem")
    7205                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7206                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7207                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7208                            .dwattr $C$DW$470, DW_AT_decl_line(0x5c)
    7209                            .dwattr $C$DW$470, DW_AT_decl_column(0x1c)
    7210                    
    7211                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7212                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x5c)
    7213                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x10)
    7214                            .dwendtag $C$DW$T$184
    7215                    
    7216                    $C$DW$T$688     .dwtag  DW_TAG_typedef
    7217                            .dwattr $C$DW$T$688, DW_AT_name("div_t")
    7218                            .dwattr $C$DW$T$688, DW_AT_type(*$C$DW$T$184)
    7219                            .dwattr $C$DW$T$688, DW_AT_language(DW_LANG_C)
    7220                            .dwattr $C$DW$T$688, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7221                            .dwattr $C$DW$T$688, DW_AT_decl_line(0x5c)
    7222                            .dwattr $C$DW$T$688, DW_AT_decl_column(0x23)
    7223                    
    7224                    
    7225                    $C$DW$T$185     .dwtag  DW_TAG_structure_type
    7226                            .dwattr $C$DW$T$185, DW_AT_byte_size(0x08)
    7227                    $C$DW$471       .dwtag  DW_TAG_member
    7228                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$10)
    7229                            .dwattr $C$DW$471, DW_AT_name("quot")
    7230                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("quot")
    7231                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7232                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7233                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7234                            .dwattr $C$DW$471, DW_AT_decl_line(0x5e)
    7235                            .dwattr $C$DW$471, DW_AT_decl_column(0x16)
    7236                    
    7237                    $C$DW$472       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  133

    7238                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$10)
    7239                            .dwattr $C$DW$472, DW_AT_name("rem")
    7240                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rem")
    7241                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7242                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7243                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7244                            .dwattr $C$DW$472, DW_AT_decl_line(0x5e)
    7245                            .dwattr $C$DW$472, DW_AT_decl_column(0x1c)
    7246                    
    7247                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7248                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x5e)
    7249                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x10)
    7250                            .dwendtag $C$DW$T$185
    7251                    
    7252                    $C$DW$T$689     .dwtag  DW_TAG_typedef
    7253                            .dwattr $C$DW$T$689, DW_AT_name("ldiv_t")
    7254                            .dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$185)
    7255                            .dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
    7256                            .dwattr $C$DW$T$689, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7257                            .dwattr $C$DW$T$689, DW_AT_decl_line(0x5e)
    7258                            .dwattr $C$DW$T$689, DW_AT_decl_column(0x23)
    7259                    
    7260                    
    7261                    $C$DW$T$186     .dwtag  DW_TAG_structure_type
    7262                            .dwattr $C$DW$T$186, DW_AT_byte_size(0x10)
    7263                    $C$DW$473       .dwtag  DW_TAG_member
    7264                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$14)
    7265                            .dwattr $C$DW$473, DW_AT_name("quot")
    7266                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("quot")
    7267                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7268                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7269                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7270                            .dwattr $C$DW$473, DW_AT_decl_line(0x61)
    7271                            .dwattr $C$DW$473, DW_AT_decl_column(0x1c)
    7272                    
    7273                    $C$DW$474       .dwtag  DW_TAG_member
    7274                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$14)
    7275                            .dwattr $C$DW$474, DW_AT_name("rem")
    7276                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rem")
    7277                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7278                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7279                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    7280                            .dwattr $C$DW$474, DW_AT_decl_line(0x61)
    7281                            .dwattr $C$DW$474, DW_AT_decl_column(0x22)
    7282                    
    7283                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    7284                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x61)
    7285                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x10)
    7286                            .dwendtag $C$DW$T$186
    7287                    
    7288                    $C$DW$T$690     .dwtag  DW_TAG_typedef
    7289                            .dwattr $C$DW$T$690, DW_AT_name("lldiv_t")
    7290                            .dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$186)
    7291                            .dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
    7292                            .dwattr $C$DW$T$690, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  134

    7293                            .dwattr $C$DW$T$690, DW_AT_decl_line(0x61)
    7294                            .dwattr $C$DW$T$690, DW_AT_decl_column(0x29)
    7295                    
    7296                    
    7297                    $C$DW$T$190     .dwtag  DW_TAG_structure_type
    7298                            .dwattr $C$DW$T$190, DW_AT_byte_size(0x08)
    7299                    $C$DW$475       .dwtag  DW_TAG_member
    7300                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$188)
    7301                            .dwattr $C$DW$475, DW_AT_name("pointerStack")
    7302                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("pointerStack")
    7303                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7304                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7305                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7306                            .dwattr $C$DW$475, DW_AT_decl_line(0x3f5)
    7307                            .dwattr $C$DW$475, DW_AT_decl_column(0x16)
    7308                    
    7309                    $C$DW$476       .dwtag  DW_TAG_member
    7310                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$189)
    7311                            .dwattr $C$DW$476, DW_AT_name("directAPI")
    7312                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("directAPI")
    7313                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7314                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7315                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7316                            .dwattr $C$DW$476, DW_AT_decl_line(0x3f6)
    7317                            .dwattr $C$DW$476, DW_AT_decl_column(0x15)
    7318                    
    7319                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7320                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x3f4)
    7321                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x01)
    7322                            .dwendtag $C$DW$T$190
    7323                    
    7324                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    7325                            .dwattr $C$DW$T$192, DW_AT_name("icall_directAPIMsg_t")
    7326                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$190)
    7327                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    7328                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7329                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x3f7)
    7330                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x03)
    7331                    
    7332                    
    7333                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    7334                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x14)
    7335                    $C$DW$477       .dwtag  DW_TAG_member
    7336                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$191)
    7337                            .dwattr $C$DW$477, DW_AT_name("hdr")
    7338                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("hdr")
    7339                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7340                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7341                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7342                            .dwattr $C$DW$477, DW_AT_decl_line(0x3fb)
    7343                            .dwattr $C$DW$477, DW_AT_decl_column(0x10)
    7344                    
    7345                    $C$DW$478       .dwtag  DW_TAG_member
    7346                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$192)
    7347                            .dwattr $C$DW$478, DW_AT_name("msg")
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  135

    7348                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("msg")
    7349                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7350                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7351                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7352                            .dwattr $C$DW$478, DW_AT_decl_line(0x3fc)
    7353                            .dwattr $C$DW$478, DW_AT_decl_column(0x1a)
    7354                    
    7355                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7356                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x3fa)
    7357                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    7358                            .dwendtag $C$DW$T$193
    7359                    
    7360                    $C$DW$T$691     .dwtag  DW_TAG_typedef
    7361                            .dwattr $C$DW$T$691, DW_AT_name("icallLiteMsg_t")
    7362                            .dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$193)
    7363                            .dwattr $C$DW$T$691, DW_AT_language(DW_LANG_C)
    7364                            .dwattr $C$DW$T$691, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7365                            .dwattr $C$DW$T$691, DW_AT_decl_line(0x3fd)
    7366                            .dwattr $C$DW$T$691, DW_AT_decl_column(0x03)
    7367                    
    7368                    
    7369                    $C$DW$T$197     .dwtag  DW_TAG_union_type
    7370                            .dwattr $C$DW$T$197, DW_AT_byte_size(0x04)
    7371                    $C$DW$479       .dwtag  DW_TAG_member
    7372                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$194)
    7373                            .dwattr $C$DW$479, DW_AT_name("f")
    7374                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("f")
    7375                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7376                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7377                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7378                            .dwattr $C$DW$479, DW_AT_decl_line(0xb7)
    7379                            .dwattr $C$DW$479, DW_AT_decl_column(0x0f)
    7380                    
    7381                    $C$DW$480       .dwtag  DW_TAG_member
    7382                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$196)
    7383                            .dwattr $C$DW$480, DW_AT_name("a")
    7384                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("a")
    7385                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7386                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7387                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7388                            .dwattr $C$DW$480, DW_AT_decl_line(0xb8)
    7389                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    7390                    
    7391                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7392                            .dwattr $C$DW$T$197, DW_AT_decl_line(0xb6)
    7393                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x0f)
    7394                            .dwendtag $C$DW$T$197
    7395                    
    7396                    $C$DW$T$692     .dwtag  DW_TAG_typedef
    7397                            .dwattr $C$DW$T$692, DW_AT_name("xdc_FloatData")
    7398                            .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$197)
    7399                            .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    7400                            .dwattr $C$DW$T$692, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7401                            .dwattr $C$DW$T$692, DW_AT_decl_line(0xb9)
    7402                            .dwattr $C$DW$T$692, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  136

    7403                    
    7404                    
    7405                    $C$DW$T$202     .dwtag  DW_TAG_union_type
    7406                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x02)
    7407                    $C$DW$481       .dwtag  DW_TAG_member
    7408                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$199)
    7409                            .dwattr $C$DW$481, DW_AT_name("entityId")
    7410                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("entityId")
    7411                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7412                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7413                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7414                            .dwattr $C$DW$481, DW_AT_decl_line(0x1fe)
    7415                            .dwattr $C$DW$481, DW_AT_decl_column(0x14)
    7416                    
    7417                    $C$DW$482       .dwtag  DW_TAG_member
    7418                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$201)
    7419                            .dwattr $C$DW$482, DW_AT_name("servId")
    7420                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("servId")
    7421                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7422                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7423                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7424                            .dwattr $C$DW$482, DW_AT_decl_line(0x200)
    7425                            .dwattr $C$DW$482, DW_AT_decl_column(0x17)
    7426                    
    7427                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7428                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1fc)
    7429                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x03)
    7430                            .dwendtag $C$DW$T$202
    7431                    
    7432                    
    7433                    $C$DW$T$203     .dwtag  DW_TAG_union_type
    7434                            .dwattr $C$DW$T$203, DW_AT_byte_size(0x02)
    7435                    $C$DW$483       .dwtag  DW_TAG_member
    7436                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$201)
    7437                            .dwattr $C$DW$483, DW_AT_name("servId")
    7438                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("servId")
    7439                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7440                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7441                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7442                            .dwattr $C$DW$483, DW_AT_decl_line(0x211)
    7443                            .dwattr $C$DW$483, DW_AT_decl_column(0x17)
    7444                    
    7445                    $C$DW$484       .dwtag  DW_TAG_member
    7446                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$199)
    7447                            .dwattr $C$DW$484, DW_AT_name("entityId")
    7448                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("entityId")
    7449                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7450                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7451                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7452                            .dwattr $C$DW$484, DW_AT_decl_line(0x213)
    7453                            .dwattr $C$DW$484, DW_AT_decl_column(0x14)
    7454                    
    7455                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7456                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x20f)
    7457                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  137

    7458                            .dwendtag $C$DW$T$203
    7459                    
    7460                    
    7461                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    7462                            .dwattr $C$DW$T$206, DW_AT_name(".ggroup1")
    7463                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x0c)
    7464                    $C$DW$485       .dwtag  DW_TAG_member
    7465                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$204)
    7466                            .dwattr $C$DW$485, DW_AT_name("nvBegPage")
    7467                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("nvBegPage")
    7468                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7469                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7470                    
    7471                    $C$DW$486       .dwtag  DW_TAG_member
    7472                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$204)
    7473                            .dwattr $C$DW$486, DW_AT_name("nvEndPage")
    7474                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("nvEndPage")
    7475                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7476                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7477                    
    7478                    $C$DW$487       .dwtag  DW_TAG_member
    7479                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$6)
    7480                            .dwattr $C$DW$487, DW_AT_name("activePg")
    7481                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("activePg")
    7482                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7483                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7484                    
    7485                    $C$DW$488       .dwtag  DW_TAG_member
    7486                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$6)
    7487                            .dwattr $C$DW$488, DW_AT_name("pgCycle")
    7488                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("pgCycle")
    7489                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7490                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7491                    
    7492                    $C$DW$489       .dwtag  DW_TAG_member
    7493                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$6)
    7494                            .dwattr $C$DW$489, DW_AT_name("failF")
    7495                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("failF")
    7496                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7497                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7498                    
    7499                    $C$DW$490       .dwtag  DW_TAG_member
    7500                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$6)
    7501                            .dwattr $C$DW$490, DW_AT_name("failW")
    7502                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("failW")
    7503                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7504                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7505                    
    7506                    $C$DW$491       .dwtag  DW_TAG_member
    7507                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$9)
    7508                            .dwattr $C$DW$491, DW_AT_name("pgOff")
    7509                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("pgOff")
    7510                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7511                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7512                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  138

    7513                    $C$DW$492       .dwtag  DW_TAG_member
    7514                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$205)
    7515                            .dwattr $C$DW$492, DW_AT_name("nvMutex")
    7516                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("nvMutex")
    7517                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7518                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7519                    
    7520                            .dwendtag $C$DW$T$206
    7521                    
    7522                    
    7523                    $C$DW$T$207     .dwtag  DW_TAG_structure_type
    7524                            .dwattr $C$DW$T$207, DW_AT_name("S3_1")
    7525                            .dwattr $C$DW$T$207, DW_AT_declaration
    7526                            .dwendtag $C$DW$T$207
    7527                    
    7528                    
    7529                    $C$DW$T$208     .dwtag  DW_TAG_structure_type
    7530                            .dwattr $C$DW$T$208, DW_AT_name("S3_1")
    7531                            .dwattr $C$DW$T$208, DW_AT_declaration
    7532                            .dwendtag $C$DW$T$208
    7533                    
    7534                    
    7535                    $C$DW$T$209     .dwtag  DW_TAG_structure_type
    7536                            .dwattr $C$DW$T$209, DW_AT_name("S3_3")
    7537                            .dwattr $C$DW$T$209, DW_AT_declaration
    7538                            .dwendtag $C$DW$T$209
    7539                    
    7540                    
    7541                    $C$DW$T$210     .dwtag  DW_TAG_structure_type
    7542                            .dwattr $C$DW$T$210, DW_AT_name("S4_4")
    7543                            .dwattr $C$DW$T$210, DW_AT_declaration
    7544                            .dwendtag $C$DW$T$210
    7545                    
    7546                    
    7547                    $C$DW$T$211     .dwtag  DW_TAG_structure_type
    7548                            .dwattr $C$DW$T$211, DW_AT_name("S4_6")
    7549                            .dwattr $C$DW$T$211, DW_AT_declaration
    7550                            .dwendtag $C$DW$T$211
    7551                    
    7552                    
    7553                    $C$DW$T$212     .dwtag  DW_TAG_structure_type
    7554                            .dwattr $C$DW$T$212, DW_AT_name("S4_6")
    7555                            .dwattr $C$DW$T$212, DW_AT_declaration
    7556                            .dwendtag $C$DW$T$212
    7557                    
    7558                    
    7559                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7560                            .dwattr $C$DW$T$19, DW_AT_name("S5_8")
    7561                            .dwattr $C$DW$T$19, DW_AT_declaration
    7562                            .dwendtag $C$DW$T$19
    7563                    
    7564                    
    7565                    $C$DW$T$213     .dwtag  DW_TAG_union_type
    7566                            .dwattr $C$DW$T$213, DW_AT_name("U3_0")
    7567                            .dwattr $C$DW$T$213, DW_AT_declaration
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  139

    7568                            .dwendtag $C$DW$T$213
    7569                    
    7570                    
    7571                    $C$DW$T$214     .dwtag  DW_TAG_union_type
    7572                            .dwattr $C$DW$T$214, DW_AT_name("U3_0")
    7573                            .dwattr $C$DW$T$214, DW_AT_declaration
    7574                            .dwendtag $C$DW$T$214
    7575                    
    7576                    
    7577                    $C$DW$T$215     .dwtag  DW_TAG_union_type
    7578                            .dwattr $C$DW$T$215, DW_AT_name("U4_3")
    7579                            .dwattr $C$DW$T$215, DW_AT_declaration
    7580                            .dwendtag $C$DW$T$215
    7581                    
    7582                    
    7583                    $C$DW$T$216     .dwtag  DW_TAG_union_type
    7584                            .dwattr $C$DW$T$216, DW_AT_name("U4_5")
    7585                            .dwattr $C$DW$T$216, DW_AT_declaration
    7586                            .dwendtag $C$DW$T$216
    7587                    
    7588                    
    7589                    $C$DW$T$217     .dwtag  DW_TAG_union_type
    7590                            .dwattr $C$DW$T$217, DW_AT_name("U5_7")
    7591                            .dwattr $C$DW$T$217, DW_AT_declaration
    7592                            .dwendtag $C$DW$T$217
    7593                    
    7594                    
    7595                    $C$DW$T$218     .dwtag  DW_TAG_structure_type
    7596                            .dwattr $C$DW$T$218, DW_AT_name("_ICall_LiteCmdStatus_")
    7597                            .dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
    7598                    $C$DW$493       .dwtag  DW_TAG_member
    7599                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$198)
    7600                            .dwattr $C$DW$493, DW_AT_name("cmdId")
    7601                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("cmdId")
    7602                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7603                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7604                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7605                            .dwattr $C$DW$493, DW_AT_decl_line(0x3f0)
    7606                            .dwattr $C$DW$493, DW_AT_decl_column(0x11)
    7607                    
    7608                            .dwattr $C$DW$T$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7609                            .dwattr $C$DW$T$218, DW_AT_decl_line(0x3ee)
    7610                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x10)
    7611                            .dwendtag $C$DW$T$218
    7612                    
    7613                    $C$DW$T$696     .dwtag  DW_TAG_typedef
    7614                            .dwattr $C$DW$T$696, DW_AT_name("ICall_LiteCmdStatus")
    7615                            .dwattr $C$DW$T$696, DW_AT_type(*$C$DW$T$218)
    7616                            .dwattr $C$DW$T$696, DW_AT_language(DW_LANG_C)
    7617                            .dwattr $C$DW$T$696, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7618                            .dwattr $C$DW$T$696, DW_AT_decl_line(0x3f1)
    7619                            .dwattr $C$DW$T$696, DW_AT_decl_column(0x03)
    7620                    
    7621                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7622                            .dwattr $C$DW$T$2, DW_AT_name("void")
TI ARM Assembler PC v16.9.9 Sun Nov 25 19:10:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{6FE13B51-C70D-4DF2-8F05-648F609965C3} PAGE  140

    7623                    
    7624                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    7625                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    7626                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    7627                    
    7628                    $C$DW$T$697     .dwtag  DW_TAG_typedef
    7629                            .dwattr $C$DW$T$697, DW_AT_name("ICall_Semaphore")
    7630                            .dwattr $C$DW$T$697, DW_AT_type(*$C$DW$T$3)
    7631                            .dwattr $C$DW$T$697, DW_AT_language(DW_LANG_C)
    7632                            .dwattr $C$DW$T$697, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7633                            .dwattr $C$DW$T$697, DW_AT_decl_line(0x1ac)
    7634                            .dwattr $C$DW$T$697, DW_AT_decl_column(0x0f)
    7635                    
    7636                    $C$DW$T$233     .dwtag  DW_TAG_typedef
    7637                            .dwattr $C$DW$T$233, DW_AT_name("ICall_SyncHandle")
    7638                            .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$3)
    7639                            .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
    7640                            .dwattr $C$DW$T$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7641                            .dwattr $C$DW$T$233, DW_AT_decl_line(0x1aa)
    7642                            .dwattr $C$DW$T$233, DW_AT_decl_column(0x0f)
    7643                    
    7644                    $C$DW$T$278     .dwtag  DW_TAG_typedef
    7645                            .dwattr $C$DW$T$278, DW_AT_name("ICall_TimerID")
    7646                            .dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$3)
    7647                            .dwattr $C$DW$T$278, DW_AT_language(DW_LANG_C)
    7648                            .dwattr $C$DW$T$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7649                            .dwattr $C$DW$T$278, DW_AT_decl_line(0x1b7)
    7650                            .dwattr $C$DW$T$278, DW_AT_decl_column(0x0f)
    7651                    
    7652                    $C$DW$T$700     .dwtag  DW_TAG_const_type
    7653                            .dwattr $C$DW$T$700, DW_AT_type(*$C$DW$T$3)
    7654                    
    7655                    $C$DW$T$353     .dwtag  DW_TAG_typedef
    7656                            .dwattr $C$DW$T$353, DW_AT_name("xdc_Ptr")
    7657                            .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$3)
    7658                            .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    7659                            .dwattr $C$DW$T$353, DW_AT_decl_file("C:/ti/xdctools_3_50_08_24_core/packages/xdc/std.h")
    7660                            .dwattr $C$DW$T$353, DW_AT_decl_line(0x2e)
    7661                            .dwattr $C$DW$T$353, DW_AT_decl_column(0x1a)
    7662                    
    7663                    $C$DW$T$701     .dwtag  DW_TAG_typedef
    7664                            .dwattr $C$DW$T$701, DW_AT_name("CT__ti_sysbios_BIOS_Module__gateObj")
    7665                            .dwattr $C$DW$T$701, DW_AT_type(*$C$DW$T$353)
