TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 17:19:52 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/LowLevel/mac_settings.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\sensor_cc1350lp\sensor_cc1350lp")
      13                            .global RF_cmdPropRadioDivSetup
      14 00000000                   .sect   ".data:RF_cmdPropRadioDivSetup", RW

     900                            .dwattr $C$DW$57, DW_AT_decl_line(0x5ed)
     901                            .dwattr $C$DW$57, DW_AT_decl_column(0x05)
     902                    
     903                    $C$DW$58        .dwtag  DW_TAG_enumerator
     904                            .dwattr $C$DW$58, DW_AT_name("RF_AllowDelayAny")
     905                            .dwattr $C$DW$58, DW_AT_const_value(-1)
     906                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     907                            .dwattr $C$DW$58, DW_AT_decl_line(0x5ee)
     908                            .dwattr $C$DW$58, DW_AT_decl_column(0x05)
     909                    
     910                            .dwattr $C$DW$T$403, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     911                            .dwattr $C$DW$T$403, DW_AT_decl_line(0x5ec)
     912                            .dwattr $C$DW$T$403, DW_AT_decl_column(0x0e)
     913                            .dwendtag $C$DW$T$403
     914                    
     915                    $C$DW$T$404     .dwtag  DW_TAG_typedef
     916                            .dwattr $C$DW$T$404, DW_AT_name("RF_AllowDelay")
     917                            .dwattr $C$DW$T$404, DW_AT_type(*$C$DW$T$403)
     918                            .dwattr $C$DW$T$404, DW_AT_language(DW_LANG_C)
     919                            .dwattr $C$DW$T$404, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     920                            .dwattr $C$DW$T$404, DW_AT_decl_line(0x5ef)
     921                            .dwattr $C$DW$T$404, DW_AT_decl_column(0x03)
     922                    
     923                    
     924                    $C$DW$T$405     .dwtag  DW_TAG_enumeration_type
     925                            .dwattr $C$DW$T$405, DW_AT_byte_size(0x01)
     926                    $C$DW$59        .dwtag  DW_TAG_enumerator
     927                            .dwattr $C$DW$59, DW_AT_name("RF_RatChannelAny")
     928                            .dwattr $C$DW$59, DW_AT_const_value(-1)
     929                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     930                            .dwattr $C$DW$59, DW_AT_decl_line(0x60f)
     931                            .dwattr $C$DW$59, DW_AT_decl_column(0x05)
     932                    
     933                    $C$DW$60        .dwtag  DW_TAG_enumerator
     934                            .dwattr $C$DW$60, DW_AT_name("RF_RatChannel0")
     935                            .dwattr $C$DW$60, DW_AT_const_value(0x00)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   18

     936                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     937                            .dwattr $C$DW$60, DW_AT_decl_line(0x610)
     938                            .dwattr $C$DW$60, DW_AT_decl_column(0x05)
     939                    
     940                    $C$DW$61        .dwtag  DW_TAG_enumerator
     941                            .dwattr $C$DW$61, DW_AT_name("RF_RatChannel1")
     942                            .dwattr $C$DW$61, DW_AT_const_value(0x01)
     943                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     944                            .dwattr $C$DW$61, DW_AT_decl_line(0x611)
     945                            .dwattr $C$DW$61, DW_AT_decl_column(0x05)
     946                    
     947                    $C$DW$62        .dwtag  DW_TAG_enumerator
     948                            .dwattr $C$DW$62, DW_AT_name("RF_RatChannel2")
     949                            .dwattr $C$DW$62, DW_AT_const_value(0x02)
     950                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     951                            .dwattr $C$DW$62, DW_AT_decl_line(0x612)
     952                            .dwattr $C$DW$62, DW_AT_decl_column(0x05)
     953                    
     954                            .dwattr $C$DW$T$405, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     955                            .dwattr $C$DW$T$405, DW_AT_decl_line(0x60e)
     956                            .dwattr $C$DW$T$405, DW_AT_decl_column(0x0e)
     957                            .dwendtag $C$DW$T$405
     958                    
     959                    $C$DW$T$406     .dwtag  DW_TAG_typedef
     960                            .dwattr $C$DW$T$406, DW_AT_name("RF_RatSelectChannel")
     961                            .dwattr $C$DW$T$406, DW_AT_type(*$C$DW$T$405)
     962                            .dwattr $C$DW$T$406, DW_AT_language(DW_LANG_C)
     963                            .dwattr $C$DW$T$406, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     964                            .dwattr $C$DW$T$406, DW_AT_decl_line(0x613)
     965                            .dwattr $C$DW$T$406, DW_AT_decl_column(0x03)
     966                    
     967                    
     968                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     969                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     970                    $C$DW$63        .dwtag  DW_TAG_member
     971                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     972                            .dwattr $C$DW$63, DW_AT_name("triggerType")
     973                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("triggerType")
     974                            .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     975                            .dwattr $C$DW$63, DW_AT_bit_size(0x04)
     976                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     978                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
     979                            .dwattr $C$DW$63, DW_AT_decl_line(0x7d)
     980                            .dwattr $C$DW$63, DW_AT_decl_column(0x0f)
     981                    
     982                    $C$DW$64        .dwtag  DW_TAG_member
     983                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     984                            .dwattr $C$DW$64, DW_AT_name("bEnaCmd")
     985                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("bEnaCmd")
     986                            .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
     987                            .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     988                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     990                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   19

     991                            .dwattr $C$DW$64, DW_AT_decl_line(0x7e)
     992                            .dwattr $C$DW$64, DW_AT_decl_column(0x0f)
     993                    
     994                    $C$DW$65        .dwtag  DW_TAG_member
     995                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     996                            .dwattr $C$DW$65, DW_AT_name("triggerNo")
     997                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("triggerNo")
     998                            .dwattr $C$DW$65, DW_AT_bit_offset(0x01)
     999                            .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1000                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1002                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1003                            .dwattr $C$DW$65, DW_AT_decl_line(0x80)
    1004                            .dwattr $C$DW$65, DW_AT_decl_column(0x0f)
    1005                    
    1006                    $C$DW$66        .dwtag  DW_TAG_member
    1007                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1008                            .dwattr $C$DW$66, DW_AT_name("pastTrig")
    1009                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("pastTrig")
    1010                            .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
    1011                            .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1012                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1014                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1015                            .dwattr $C$DW$66, DW_AT_decl_line(0x81)
    1016                            .dwattr $C$DW$66, DW_AT_decl_column(0x0f)
    1017                    
    1018                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1019                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x7c)
    1020                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x0b)
    1021                            .dwendtag $C$DW$T$20
    1022                    
    1023                    
    1024                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1025                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1026                    $C$DW$67        .dwtag  DW_TAG_member
    1027                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1028                            .dwattr $C$DW$67, DW_AT_name("rule")
    1029                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("rule")
    1030                            .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
    1031                            .dwattr $C$DW$67, DW_AT_bit_size(0x04)
    1032                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1034                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1035                            .dwattr $C$DW$67, DW_AT_decl_line(0x85)
    1036                            .dwattr $C$DW$67, DW_AT_decl_column(0x0f)
    1037                    
    1038                    $C$DW$68        .dwtag  DW_TAG_member
    1039                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1040                            .dwattr $C$DW$68, DW_AT_name("nSkip")
    1041                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("nSkip")
    1042                            .dwattr $C$DW$68, DW_AT_bit_offset(0x00)
    1043                            .dwattr $C$DW$68, DW_AT_bit_size(0x04)
    1044                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   20

    1046                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1047                            .dwattr $C$DW$68, DW_AT_decl_line(0x86)
    1048                            .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
    1049                    
    1050                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1051                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x84)
    1052                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x0b)
    1053                            .dwendtag $C$DW$T$21
    1054                    
    1055                    
    1056                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1057                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1058                    $C$DW$69        .dwtag  DW_TAG_member
    1059                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1060                            .dwattr $C$DW$69, DW_AT_name("triggerType")
    1061                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("triggerType")
    1062                            .dwattr $C$DW$69, DW_AT_bit_offset(0x04)
    1063                            .dwattr $C$DW$69, DW_AT_bit_size(0x04)
    1064                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1066                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1067                            .dwattr $C$DW$69, DW_AT_decl_line(0x232)
    1068                            .dwattr $C$DW$69, DW_AT_decl_column(0x0f)
    1069                    
    1070                    $C$DW$70        .dwtag  DW_TAG_member
    1071                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1072                            .dwattr $C$DW$70, DW_AT_name("bEnaCmd")
    1073                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("bEnaCmd")
    1074                            .dwattr $C$DW$70, DW_AT_bit_offset(0x03)
    1075                            .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1076                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1078                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1079                            .dwattr $C$DW$70, DW_AT_decl_line(0x233)
    1080                            .dwattr $C$DW$70, DW_AT_decl_column(0x0f)
    1081                    
    1082                    $C$DW$71        .dwtag  DW_TAG_member
    1083                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1084                            .dwattr $C$DW$71, DW_AT_name("triggerNo")
    1085                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("triggerNo")
    1086                            .dwattr $C$DW$71, DW_AT_bit_offset(0x01)
    1087                            .dwattr $C$DW$71, DW_AT_bit_size(0x02)
    1088                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1090                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1091                            .dwattr $C$DW$71, DW_AT_decl_line(0x235)
    1092                            .dwattr $C$DW$71, DW_AT_decl_column(0x0f)
    1093                    
    1094                    $C$DW$72        .dwtag  DW_TAG_member
    1095                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1096                            .dwattr $C$DW$72, DW_AT_name("pastTrig")
    1097                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("pastTrig")
    1098                            .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1099                            .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1100                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   21

    1101                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1102                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1103                            .dwattr $C$DW$72, DW_AT_decl_line(0x236)
    1104                            .dwattr $C$DW$72, DW_AT_decl_column(0x0f)
    1105                    
    1106                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1107                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x231)
    1108                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0b)
    1109                            .dwendtag $C$DW$T$22
    1110                    
    1111                    
    1112                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1113                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1114                    $C$DW$73        .dwtag  DW_TAG_member
    1115                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1116                            .dwattr $C$DW$73, DW_AT_name("rule")
    1117                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("rule")
    1118                            .dwattr $C$DW$73, DW_AT_bit_offset(0x04)
    1119                            .dwattr $C$DW$73, DW_AT_bit_size(0x04)
    1120                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1122                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1123                            .dwattr $C$DW$73, DW_AT_decl_line(0x23a)
    1124                            .dwattr $C$DW$73, DW_AT_decl_column(0x0f)
    1125                    
    1126                    $C$DW$74        .dwtag  DW_TAG_member
    1127                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1128                            .dwattr $C$DW$74, DW_AT_name("nSkip")
    1129                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("nSkip")
    1130                            .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1131                            .dwattr $C$DW$74, DW_AT_bit_size(0x04)
    1132                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1134                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1135                            .dwattr $C$DW$74, DW_AT_decl_line(0x23b)
    1136                            .dwattr $C$DW$74, DW_AT_decl_column(0x0f)
    1137                    
    1138                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1139                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x239)
    1140                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    1141                            .dwendtag $C$DW$T$23
    1142                    
    1143                    
    1144                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1145                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1146                    $C$DW$75        .dwtag  DW_TAG_member
    1147                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$24)
    1148                            .dwattr $C$DW$75, DW_AT_name("modType")
    1149                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("modType")
    1150                            .dwattr $C$DW$75, DW_AT_bit_offset(0x0d)
    1151                            .dwattr $C$DW$75, DW_AT_bit_size(0x03)
    1152                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1154                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1155                            .dwattr $C$DW$75, DW_AT_decl_line(0x23e)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   22

    1156                            .dwattr $C$DW$75, DW_AT_decl_column(0x10)
    1157                    
    1158                    $C$DW$76        .dwtag  DW_TAG_member
    1159                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$24)
    1160                            .dwattr $C$DW$76, DW_AT_name("deviation")
    1161                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("deviation")
    1162                            .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
    1163                            .dwattr $C$DW$76, DW_AT_bit_size(0x0d)
    1164                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1166                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1167                            .dwattr $C$DW$76, DW_AT_decl_line(0x241)
    1168                            .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1169                    
    1170                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1171                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x23d)
    1172                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    1173                            .dwendtag $C$DW$T$25
    1174                    
    1175                    
    1176                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1177                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1178                    $C$DW$77        .dwtag  DW_TAG_member
    1179                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$26)
    1180                            .dwattr $C$DW$77, DW_AT_name("preScale")
    1181                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("preScale")
    1182                            .dwattr $C$DW$77, DW_AT_bit_offset(0x1c)
    1183                            .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1184                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1186                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1187                            .dwattr $C$DW$77, DW_AT_decl_line(0x244)
    1188                            .dwattr $C$DW$77, DW_AT_decl_column(0x10)
    1189                    
    1190                    $C$DW$78        .dwtag  DW_TAG_member
    1191                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$26)
    1192                            .dwattr $C$DW$78, DW_AT_name("rateWord")
    1193                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("rateWord")
    1194                            .dwattr $C$DW$78, DW_AT_bit_offset(0x03)
    1195                            .dwattr $C$DW$78, DW_AT_bit_size(0x15)
    1196                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1198                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1199                            .dwattr $C$DW$78, DW_AT_decl_line(0x246)
    1200                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1201                    
    1202                    $C$DW$79        .dwtag  DW_TAG_member
    1203                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$26)
    1204                            .dwattr $C$DW$79, DW_AT_name("decimMode")
    1205                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("decimMode")
    1206                            .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1207                            .dwattr $C$DW$79, DW_AT_bit_size(0x03)
    1208                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1210                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   23

    1211                            .dwattr $C$DW$79, DW_AT_decl_line(0x247)
    1212                            .dwattr $C$DW$79, DW_AT_decl_column(0x10)
    1213                    
    1214                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1215                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x243)
    1216                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    1217                            .dwendtag $C$DW$T$27
    1218                    
    1219                    
    1220                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1221                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1222                    $C$DW$80        .dwtag  DW_TAG_member
    1223                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1224                            .dwattr $C$DW$80, DW_AT_name("nPreamBytes")
    1225                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("nPreamBytes")
    1226                            .dwattr $C$DW$80, DW_AT_bit_offset(0x02)
    1227                            .dwattr $C$DW$80, DW_AT_bit_size(0x06)
    1228                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1230                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1231                            .dwattr $C$DW$80, DW_AT_decl_line(0x24f)
    1232                            .dwattr $C$DW$80, DW_AT_decl_column(0x0f)
    1233                    
    1234                    $C$DW$81        .dwtag  DW_TAG_member
    1235                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1236                            .dwattr $C$DW$81, DW_AT_name("preamMode")
    1237                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("preamMode")
    1238                            .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1239                            .dwattr $C$DW$81, DW_AT_bit_size(0x02)
    1240                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1242                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1243                            .dwattr $C$DW$81, DW_AT_decl_line(0x255)
    1244                            .dwattr $C$DW$81, DW_AT_decl_column(0x0f)
    1245                    
    1246                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1247                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x24e)
    1248                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    1249                            .dwendtag $C$DW$T$28
    1250                    
    1251                    
    1252                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1253                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1254                    $C$DW$82        .dwtag  DW_TAG_member
    1255                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$24)
    1256                            .dwattr $C$DW$82, DW_AT_name("nSwBits")
    1257                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("nSwBits")
    1258                            .dwattr $C$DW$82, DW_AT_bit_offset(0x0a)
    1259                            .dwattr $C$DW$82, DW_AT_bit_size(0x06)
    1260                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1262                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1263                            .dwattr $C$DW$82, DW_AT_decl_line(0x25b)
    1264                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1265                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   24

    1266                    $C$DW$83        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$24)
    1268                            .dwattr $C$DW$83, DW_AT_name("bBitReversal")
    1269                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("bBitReversal")
    1270                            .dwattr $C$DW$83, DW_AT_bit_offset(0x09)
    1271                            .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1272                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1274                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1275                            .dwattr $C$DW$83, DW_AT_decl_line(0x25c)
    1276                            .dwattr $C$DW$83, DW_AT_decl_column(0x10)
    1277                    
    1278                    $C$DW$84        .dwtag  DW_TAG_member
    1279                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
    1280                            .dwattr $C$DW$84, DW_AT_name("bMsbFirst")
    1281                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("bMsbFirst")
    1282                            .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
    1283                            .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1284                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1286                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1287                            .dwattr $C$DW$84, DW_AT_decl_line(0x25e)
    1288                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1289                    
    1290                    $C$DW$85        .dwtag  DW_TAG_member
    1291                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$24)
    1292                            .dwattr $C$DW$85, DW_AT_name("fecMode")
    1293                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("fecMode")
    1294                            .dwattr $C$DW$85, DW_AT_bit_offset(0x04)
    1295                            .dwattr $C$DW$85, DW_AT_bit_size(0x04)
    1296                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1298                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1299                            .dwattr $C$DW$85, DW_AT_decl_line(0x260)
    1300                            .dwattr $C$DW$85, DW_AT_decl_column(0x10)
    1301                    
    1302                    $C$DW$86        .dwtag  DW_TAG_member
    1303                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$24)
    1304                            .dwattr $C$DW$86, DW_AT_name("whitenMode")
    1305                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("whitenMode")
    1306                            .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1307                            .dwattr $C$DW$86, DW_AT_bit_size(0x03)
    1308                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1310                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1311                            .dwattr $C$DW$86, DW_AT_decl_line(0x266)
    1312                            .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1313                    
    1314                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1315                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x25a)
    1316                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    1317                            .dwendtag $C$DW$T$29
    1318                    
    1319                    
    1320                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   25

    1321                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1322                    $C$DW$87        .dwtag  DW_TAG_member
    1323                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$24)
    1324                            .dwattr $C$DW$87, DW_AT_name("frontEndMode")
    1325                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("frontEndMode")
    1326                            .dwattr $C$DW$87, DW_AT_bit_offset(0x0d)
    1327                            .dwattr $C$DW$87, DW_AT_bit_size(0x03)
    1328                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1330                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1331                            .dwattr $C$DW$87, DW_AT_decl_line(0x270)
    1332                            .dwattr $C$DW$87, DW_AT_decl_column(0x10)
    1333                    
    1334                    $C$DW$88        .dwtag  DW_TAG_member
    1335                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$24)
    1336                            .dwattr $C$DW$88, DW_AT_name("biasMode")
    1337                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("biasMode")
    1338                            .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1339                            .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1340                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1342                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1343                            .dwattr $C$DW$88, DW_AT_decl_line(0x276)
    1344                            .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1345                    
    1346                    $C$DW$89        .dwtag  DW_TAG_member
    1347                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$24)
    1348                            .dwattr $C$DW$89, DW_AT_name("analogCfgMode")
    1349                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("analogCfgMode")
    1350                            .dwattr $C$DW$89, DW_AT_bit_offset(0x06)
    1351                            .dwattr $C$DW$89, DW_AT_bit_size(0x06)
    1352                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1354                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1355                            .dwattr $C$DW$89, DW_AT_decl_line(0x278)
    1356                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1357                    
    1358                    $C$DW$90        .dwtag  DW_TAG_member
    1359                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$24)
    1360                            .dwattr $C$DW$90, DW_AT_name("bNoFsPowerUp")
    1361                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("bNoFsPowerUp")
    1362                            .dwattr $C$DW$90, DW_AT_bit_offset(0x05)
    1363                            .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1364                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1366                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1367                            .dwattr $C$DW$90, DW_AT_decl_line(0x27f)
    1368                            .dwattr $C$DW$90, DW_AT_decl_column(0x10)
    1369                    
    1370                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1371                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x26f)
    1372                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    1373                            .dwendtag $C$DW$T$30
    1374                    
    1375                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   26

    1376                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1377                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1378                    $C$DW$91        .dwtag  DW_TAG_member
    1379                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1380                            .dwattr $C$DW$91, DW_AT_name("triggerType")
    1381                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("triggerType")
    1382                            .dwattr $C$DW$91, DW_AT_bit_offset(0x04)
    1383                            .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1384                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1386                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1387                            .dwattr $C$DW$91, DW_AT_decl_line(0xee)
    1388                            .dwattr $C$DW$91, DW_AT_decl_column(0x0f)
    1389                    
    1390                    $C$DW$92        .dwtag  DW_TAG_member
    1391                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1392                            .dwattr $C$DW$92, DW_AT_name("bEnaCmd")
    1393                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("bEnaCmd")
    1394                            .dwattr $C$DW$92, DW_AT_bit_offset(0x03)
    1395                            .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1396                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1398                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1399                            .dwattr $C$DW$92, DW_AT_decl_line(0xef)
    1400                            .dwattr $C$DW$92, DW_AT_decl_column(0x0f)
    1401                    
    1402                    $C$DW$93        .dwtag  DW_TAG_member
    1403                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1404                            .dwattr $C$DW$93, DW_AT_name("triggerNo")
    1405                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("triggerNo")
    1406                            .dwattr $C$DW$93, DW_AT_bit_offset(0x01)
    1407                            .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1408                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1410                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1411                            .dwattr $C$DW$93, DW_AT_decl_line(0xf1)
    1412                            .dwattr $C$DW$93, DW_AT_decl_column(0x0f)
    1413                    
    1414                    $C$DW$94        .dwtag  DW_TAG_member
    1415                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1416                            .dwattr $C$DW$94, DW_AT_name("pastTrig")
    1417                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("pastTrig")
    1418                            .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1419                            .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1420                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1422                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1423                            .dwattr $C$DW$94, DW_AT_decl_line(0xf2)
    1424                            .dwattr $C$DW$94, DW_AT_decl_column(0x0f)
    1425                    
    1426                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1427                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xed)
    1428                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    1429                            .dwendtag $C$DW$T$31
    1430                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   27

    1431                    
    1432                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1433                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1434                    $C$DW$95        .dwtag  DW_TAG_member
    1435                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1436                            .dwattr $C$DW$95, DW_AT_name("rule")
    1437                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("rule")
    1438                            .dwattr $C$DW$95, DW_AT_bit_offset(0x04)
    1439                            .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1440                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1442                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1443                            .dwattr $C$DW$95, DW_AT_decl_line(0xf6)
    1444                            .dwattr $C$DW$95, DW_AT_decl_column(0x0f)
    1445                    
    1446                    $C$DW$96        .dwtag  DW_TAG_member
    1447                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1448                            .dwattr $C$DW$96, DW_AT_name("nSkip")
    1449                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("nSkip")
    1450                            .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1451                            .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1452                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1454                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1455                            .dwattr $C$DW$96, DW_AT_decl_line(0xf7)
    1456                            .dwattr $C$DW$96, DW_AT_decl_column(0x0f)
    1457                    
    1458                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1459                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xf5)
    1460                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    1461                            .dwendtag $C$DW$T$32
    1462                    
    1463                    
    1464                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1465                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1466                    $C$DW$97        .dwtag  DW_TAG_member
    1467                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1468                            .dwattr $C$DW$97, DW_AT_name("bTxMode")
    1469                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("bTxMode")
    1470                            .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1471                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1472                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1474                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1475                            .dwattr $C$DW$97, DW_AT_decl_line(0xfc)
    1476                            .dwattr $C$DW$97, DW_AT_decl_column(0x0f)
    1477                    
    1478                    $C$DW$98        .dwtag  DW_TAG_member
    1479                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1480                            .dwattr $C$DW$98, DW_AT_name("refFreq")
    1481                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("refFreq")
    1482                            .dwattr $C$DW$98, DW_AT_bit_offset(0x01)
    1483                            .dwattr $C$DW$98, DW_AT_bit_size(0x06)
    1484                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   28

    1486                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1487                            .dwattr $C$DW$98, DW_AT_decl_line(0xfe)
    1488                            .dwattr $C$DW$98, DW_AT_decl_column(0x0f)
    1489                    
    1490                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1491                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xfb)
    1492                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    1493                            .dwendtag $C$DW$T$33
    1494                    
    1495                    
    1496                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1497                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1498                    $C$DW$99        .dwtag  DW_TAG_member
    1499                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1500                            .dwattr $C$DW$99, DW_AT_name("triggerType")
    1501                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("triggerType")
    1502                            .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1503                            .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1504                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1506                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1507                            .dwattr $C$DW$99, DW_AT_decl_line(0xf5)
    1508                            .dwattr $C$DW$99, DW_AT_decl_column(0x0f)
    1509                    
    1510                    $C$DW$100       .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1512                            .dwattr $C$DW$100, DW_AT_name("bEnaCmd")
    1513                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("bEnaCmd")
    1514                            .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1515                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1516                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1519                            .dwattr $C$DW$100, DW_AT_decl_line(0xf6)
    1520                            .dwattr $C$DW$100, DW_AT_decl_column(0x0f)
    1521                    
    1522                    $C$DW$101       .dwtag  DW_TAG_member
    1523                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1524                            .dwattr $C$DW$101, DW_AT_name("triggerNo")
    1525                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("triggerNo")
    1526                            .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    1527                            .dwattr $C$DW$101, DW_AT_bit_size(0x02)
    1528                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1530                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1531                            .dwattr $C$DW$101, DW_AT_decl_line(0xf8)
    1532                            .dwattr $C$DW$101, DW_AT_decl_column(0x0f)
    1533                    
    1534                    $C$DW$102       .dwtag  DW_TAG_member
    1535                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1536                            .dwattr $C$DW$102, DW_AT_name("pastTrig")
    1537                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("pastTrig")
    1538                            .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1539                            .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1540                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   29

    1541                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1542                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1543                            .dwattr $C$DW$102, DW_AT_decl_line(0xf9)
    1544                            .dwattr $C$DW$102, DW_AT_decl_column(0x0f)
    1545                    
    1546                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1547                            .dwattr $C$DW$T$34, DW_AT_decl_line(0xf4)
    1548                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    1549                            .dwendtag $C$DW$T$34
    1550                    
    1551                    
    1552                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1553                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1554                    $C$DW$103       .dwtag  DW_TAG_member
    1555                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1556                            .dwattr $C$DW$103, DW_AT_name("rule")
    1557                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("rule")
    1558                            .dwattr $C$DW$103, DW_AT_bit_offset(0x04)
    1559                            .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1560                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1562                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1563                            .dwattr $C$DW$103, DW_AT_decl_line(0xfd)
    1564                            .dwattr $C$DW$103, DW_AT_decl_column(0x0f)
    1565                    
    1566                    $C$DW$104       .dwtag  DW_TAG_member
    1567                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1568                            .dwattr $C$DW$104, DW_AT_name("nSkip")
    1569                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("nSkip")
    1570                            .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1571                            .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1572                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1574                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1575                            .dwattr $C$DW$104, DW_AT_decl_line(0xfe)
    1576                            .dwattr $C$DW$104, DW_AT_decl_column(0x0f)
    1577                    
    1578                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1579                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xfc)
    1580                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    1581                            .dwendtag $C$DW$T$35
    1582                    
    1583                    
    1584                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1585                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1586                    $C$DW$105       .dwtag  DW_TAG_member
    1587                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1588                            .dwattr $C$DW$105, DW_AT_name("bFsOff")
    1589                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("bFsOff")
    1590                            .dwattr $C$DW$105, DW_AT_bit_offset(0x07)
    1591                            .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1592                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1594                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1595                            .dwattr $C$DW$105, DW_AT_decl_line(0x101)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   30

    1596                            .dwattr $C$DW$105, DW_AT_decl_column(0x0f)
    1597                    
    1598                    $C$DW$106       .dwtag  DW_TAG_member
    1599                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1600                            .dwattr $C$DW$106, DW_AT_name("bUseCrc")
    1601                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("bUseCrc")
    1602                            .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1603                            .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1604                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1606                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1607                            .dwattr $C$DW$106, DW_AT_decl_line(0x104)
    1608                            .dwattr $C$DW$106, DW_AT_decl_column(0x0f)
    1609                    
    1610                    $C$DW$107       .dwtag  DW_TAG_member
    1611                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1612                            .dwattr $C$DW$107, DW_AT_name("bCrcIncSw")
    1613                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("bCrcIncSw")
    1614                            .dwattr $C$DW$107, DW_AT_bit_offset(0x03)
    1615                            .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1616                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1619                            .dwattr $C$DW$107, DW_AT_decl_line(0x106)
    1620                            .dwattr $C$DW$107, DW_AT_decl_column(0x0f)
    1621                    
    1622                    $C$DW$108       .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1624                            .dwattr $C$DW$108, DW_AT_name("bCrcIncHdr")
    1625                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("bCrcIncHdr")
    1626                            .dwattr $C$DW$108, DW_AT_bit_offset(0x02)
    1627                            .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1628                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1630                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1631                            .dwattr $C$DW$108, DW_AT_decl_line(0x108)
    1632                            .dwattr $C$DW$108, DW_AT_decl_column(0x0f)
    1633                    
    1634                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1635                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x100)
    1636                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    1637                            .dwendtag $C$DW$T$36
    1638                    
    1639                    
    1640                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1641                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1642                    $C$DW$109       .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1644                            .dwattr $C$DW$109, DW_AT_name("bExtTxTrig")
    1645                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("bExtTxTrig")
    1646                            .dwattr $C$DW$109, DW_AT_bit_offset(0x07)
    1647                            .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1648                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1650                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   31

    1651                            .dwattr $C$DW$109, DW_AT_decl_line(0x10e)
    1652                            .dwattr $C$DW$109, DW_AT_decl_column(0x0f)
    1653                    
    1654                    $C$DW$110       .dwtag  DW_TAG_member
    1655                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1656                            .dwattr $C$DW$110, DW_AT_name("inputMode")
    1657                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("inputMode")
    1658                            .dwattr $C$DW$110, DW_AT_bit_offset(0x05)
    1659                            .dwattr $C$DW$110, DW_AT_bit_size(0x02)
    1660                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1662                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1663                            .dwattr $C$DW$110, DW_AT_decl_line(0x110)
    1664                            .dwattr $C$DW$110, DW_AT_decl_column(0x0f)
    1665                    
    1666                    $C$DW$111       .dwtag  DW_TAG_member
    1667                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1668                            .dwattr $C$DW$111, DW_AT_name("source")
    1669                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("source")
    1670                            .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1671                            .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    1672                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1674                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1675                            .dwattr $C$DW$111, DW_AT_decl_line(0x115)
    1676                            .dwattr $C$DW$111, DW_AT_decl_column(0x0f)
    1677                    
    1678                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1679                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x10d)
    1680                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    1681                            .dwendtag $C$DW$T$37
    1682                    
    1683                    
    1684                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1685                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1686                    $C$DW$112       .dwtag  DW_TAG_member
    1687                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1688                            .dwattr $C$DW$112, DW_AT_name("triggerType")
    1689                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("triggerType")
    1690                            .dwattr $C$DW$112, DW_AT_bit_offset(0x04)
    1691                            .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1692                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1694                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1695                            .dwattr $C$DW$112, DW_AT_decl_line(0x118)
    1696                            .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
    1697                    
    1698                    $C$DW$113       .dwtag  DW_TAG_member
    1699                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1700                            .dwattr $C$DW$113, DW_AT_name("bEnaCmd")
    1701                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("bEnaCmd")
    1702                            .dwattr $C$DW$113, DW_AT_bit_offset(0x03)
    1703                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1704                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   32

    1706                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1707                            .dwattr $C$DW$113, DW_AT_decl_line(0x119)
    1708                            .dwattr $C$DW$113, DW_AT_decl_column(0x0f)
    1709                    
    1710                    $C$DW$114       .dwtag  DW_TAG_member
    1711                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1712                            .dwattr $C$DW$114, DW_AT_name("triggerNo")
    1713                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("triggerNo")
    1714                            .dwattr $C$DW$114, DW_AT_bit_offset(0x01)
    1715                            .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1716                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1718                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1719                            .dwattr $C$DW$114, DW_AT_decl_line(0x11b)
    1720                            .dwattr $C$DW$114, DW_AT_decl_column(0x0f)
    1721                    
    1722                    $C$DW$115       .dwtag  DW_TAG_member
    1723                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1724                            .dwattr $C$DW$115, DW_AT_name("pastTrig")
    1725                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("pastTrig")
    1726                            .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1727                            .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1728                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1730                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1731                            .dwattr $C$DW$115, DW_AT_decl_line(0x11c)
    1732                            .dwattr $C$DW$115, DW_AT_decl_column(0x0f)
    1733                    
    1734                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1735                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x117)
    1736                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    1737                            .dwendtag $C$DW$T$38
    1738                    
    1739                    
    1740                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1741                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1742                    $C$DW$116       .dwtag  DW_TAG_member
    1743                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1744                            .dwattr $C$DW$116, DW_AT_name("triggerType")
    1745                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("triggerType")
    1746                            .dwattr $C$DW$116, DW_AT_bit_offset(0x04)
    1747                            .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    1748                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1750                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1751                            .dwattr $C$DW$116, DW_AT_decl_line(0x18b)
    1752                            .dwattr $C$DW$116, DW_AT_decl_column(0x0f)
    1753                    
    1754                    $C$DW$117       .dwtag  DW_TAG_member
    1755                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1756                            .dwattr $C$DW$117, DW_AT_name("bEnaCmd")
    1757                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("bEnaCmd")
    1758                            .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    1759                            .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1760                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   33

    1761                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1762                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1763                            .dwattr $C$DW$117, DW_AT_decl_line(0x18c)
    1764                            .dwattr $C$DW$117, DW_AT_decl_column(0x0f)
    1765                    
    1766                    $C$DW$118       .dwtag  DW_TAG_member
    1767                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1768                            .dwattr $C$DW$118, DW_AT_name("triggerNo")
    1769                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("triggerNo")
    1770                            .dwattr $C$DW$118, DW_AT_bit_offset(0x01)
    1771                            .dwattr $C$DW$118, DW_AT_bit_size(0x02)
    1772                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1774                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1775                            .dwattr $C$DW$118, DW_AT_decl_line(0x18e)
    1776                            .dwattr $C$DW$118, DW_AT_decl_column(0x0f)
    1777                    
    1778                    $C$DW$119       .dwtag  DW_TAG_member
    1779                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1780                            .dwattr $C$DW$119, DW_AT_name("pastTrig")
    1781                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("pastTrig")
    1782                            .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1783                            .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1784                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1786                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1787                            .dwattr $C$DW$119, DW_AT_decl_line(0x18f)
    1788                            .dwattr $C$DW$119, DW_AT_decl_column(0x0f)
    1789                    
    1790                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1791                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x18a)
    1792                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    1793                            .dwendtag $C$DW$T$39
    1794                    
    1795                    
    1796                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1797                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1798                    $C$DW$120       .dwtag  DW_TAG_member
    1799                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1800                            .dwattr $C$DW$120, DW_AT_name("rule")
    1801                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rule")
    1802                            .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1803                            .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    1804                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1806                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1807                            .dwattr $C$DW$120, DW_AT_decl_line(0x193)
    1808                            .dwattr $C$DW$120, DW_AT_decl_column(0x0f)
    1809                    
    1810                    $C$DW$121       .dwtag  DW_TAG_member
    1811                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1812                            .dwattr $C$DW$121, DW_AT_name("nSkip")
    1813                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("nSkip")
    1814                            .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1815                            .dwattr $C$DW$121, DW_AT_bit_size(0x04)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   34

    1816                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1818                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1819                            .dwattr $C$DW$121, DW_AT_decl_line(0x194)
    1820                            .dwattr $C$DW$121, DW_AT_decl_column(0x0f)
    1821                    
    1822                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1823                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x192)
    1824                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    1825                            .dwendtag $C$DW$T$40
    1826                    
    1827                    
    1828                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1829                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1830                    $C$DW$122       .dwtag  DW_TAG_member
    1831                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1832                            .dwattr $C$DW$122, DW_AT_name("bFsOffIdle")
    1833                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("bFsOffIdle")
    1834                            .dwattr $C$DW$122, DW_AT_bit_offset(0x07)
    1835                            .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1836                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1838                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1839                            .dwattr $C$DW$122, DW_AT_decl_line(0x197)
    1840                            .dwattr $C$DW$122, DW_AT_decl_column(0x0f)
    1841                    
    1842                    $C$DW$123       .dwtag  DW_TAG_member
    1843                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1844                            .dwattr $C$DW$123, DW_AT_name("bFsOffBusy")
    1845                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("bFsOffBusy")
    1846                            .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    1847                            .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1848                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1850                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1851                            .dwattr $C$DW$123, DW_AT_decl_line(0x199)
    1852                            .dwattr $C$DW$123, DW_AT_decl_column(0x0f)
    1853                    
    1854                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1855                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x196)
    1856                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    1857                            .dwendtag $C$DW$T$41
    1858                    
    1859                    
    1860                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1861                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1862                    $C$DW$124       .dwtag  DW_TAG_member
    1863                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1864                            .dwattr $C$DW$124, DW_AT_name("bEnaRssi")
    1865                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("bEnaRssi")
    1866                            .dwattr $C$DW$124, DW_AT_bit_offset(0x07)
    1867                            .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1868                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1870                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   35

    1871                            .dwattr $C$DW$124, DW_AT_decl_line(0x19e)
    1872                            .dwattr $C$DW$124, DW_AT_decl_column(0x0f)
    1873                    
    1874                    $C$DW$125       .dwtag  DW_TAG_member
    1875                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1876                            .dwattr $C$DW$125, DW_AT_name("bEnaCorr")
    1877                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("bEnaCorr")
    1878                            .dwattr $C$DW$125, DW_AT_bit_offset(0x06)
    1879                            .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1880                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1882                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1883                            .dwattr $C$DW$125, DW_AT_decl_line(0x19f)
    1884                            .dwattr $C$DW$125, DW_AT_decl_column(0x0f)
    1885                    
    1886                    $C$DW$126       .dwtag  DW_TAG_member
    1887                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1888                            .dwattr $C$DW$126, DW_AT_name("operation")
    1889                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("operation")
    1890                            .dwattr $C$DW$126, DW_AT_bit_offset(0x05)
    1891                            .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1892                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1894                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1895                            .dwattr $C$DW$126, DW_AT_decl_line(0x1a0)
    1896                            .dwattr $C$DW$126, DW_AT_decl_column(0x0f)
    1897                    
    1898                    $C$DW$127       .dwtag  DW_TAG_member
    1899                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1900                            .dwattr $C$DW$127, DW_AT_name("busyOp")
    1901                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("busyOp")
    1902                            .dwattr $C$DW$127, DW_AT_bit_offset(0x04)
    1903                            .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1904                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1906                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1907                            .dwattr $C$DW$127, DW_AT_decl_line(0x1a2)
    1908                            .dwattr $C$DW$127, DW_AT_decl_column(0x0f)
    1909                    
    1910                    $C$DW$128       .dwtag  DW_TAG_member
    1911                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1912                            .dwattr $C$DW$128, DW_AT_name("idleOp")
    1913                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("idleOp")
    1914                            .dwattr $C$DW$128, DW_AT_bit_offset(0x03)
    1915                            .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1916                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1919                            .dwattr $C$DW$128, DW_AT_decl_line(0x1a5)
    1920                            .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    1921                    
    1922                    $C$DW$129       .dwtag  DW_TAG_member
    1923                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1924                            .dwattr $C$DW$129, DW_AT_name("timeoutRes")
    1925                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("timeoutRes")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   36

    1926                            .dwattr $C$DW$129, DW_AT_bit_offset(0x02)
    1927                            .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1928                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1930                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1931                            .dwattr $C$DW$129, DW_AT_decl_line(0x1a7)
    1932                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1933                    
    1934                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1935                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x19d)
    1936                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    1937                            .dwendtag $C$DW$T$42
    1938                    
    1939                    
    1940                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1941                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1942                    $C$DW$130       .dwtag  DW_TAG_member
    1943                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1944                            .dwattr $C$DW$130, DW_AT_name("numCorrInv")
    1945                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("numCorrInv")
    1946                            .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1947                            .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1948                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1950                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1951                            .dwattr $C$DW$130, DW_AT_decl_line(0x1b1)
    1952                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    1953                    
    1954                    $C$DW$131       .dwtag  DW_TAG_member
    1955                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1956                            .dwattr $C$DW$131, DW_AT_name("numCorrBusy")
    1957                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("numCorrBusy")
    1958                            .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1959                            .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    1960                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1962                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1963                            .dwattr $C$DW$131, DW_AT_decl_line(0x1b3)
    1964                            .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    1965                    
    1966                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1967                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1b0)
    1968                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    1969                            .dwendtag $C$DW$T$43
    1970                    
    1971                    
    1972                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1973                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1974                    $C$DW$132       .dwtag  DW_TAG_member
    1975                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1976                            .dwattr $C$DW$132, DW_AT_name("triggerType")
    1977                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("triggerType")
    1978                            .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    1979                            .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    1980                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   37

    1981                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1982                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1983                            .dwattr $C$DW$132, DW_AT_decl_line(0x1b7)
    1984                            .dwattr $C$DW$132, DW_AT_decl_column(0x0f)
    1985                    
    1986                    $C$DW$133       .dwtag  DW_TAG_member
    1987                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1988                            .dwattr $C$DW$133, DW_AT_name("bEnaCmd")
    1989                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("bEnaCmd")
    1990                            .dwattr $C$DW$133, DW_AT_bit_offset(0x03)
    1991                            .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1992                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1993                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1994                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1995                            .dwattr $C$DW$133, DW_AT_decl_line(0x1b8)
    1996                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    1997                    
    1998                    $C$DW$134       .dwtag  DW_TAG_member
    1999                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2000                            .dwattr $C$DW$134, DW_AT_name("triggerNo")
    2001                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("triggerNo")
    2002                            .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    2003                            .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    2004                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2006                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2007                            .dwattr $C$DW$134, DW_AT_decl_line(0x1ba)
    2008                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    2009                    
    2010                    $C$DW$135       .dwtag  DW_TAG_member
    2011                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2012                            .dwattr $C$DW$135, DW_AT_name("pastTrig")
    2013                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("pastTrig")
    2014                            .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2015                            .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2016                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2018                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2019                            .dwattr $C$DW$135, DW_AT_decl_line(0x1bb)
    2020                            .dwattr $C$DW$135, DW_AT_decl_column(0x0f)
    2021                    
    2022                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2023                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1b6)
    2024                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    2025                            .dwendtag $C$DW$T$44
    2026                    
    2027                    
    2028                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2029                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2030                    $C$DW$136       .dwtag  DW_TAG_member
    2031                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2032                            .dwattr $C$DW$136, DW_AT_name("triggerType")
    2033                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("triggerType")
    2034                            .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    2035                            .dwattr $C$DW$136, DW_AT_bit_size(0x04)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{D9FB04A1-8758-4907-B1B9-2B0B7BC0E42A} PAGE   38

    2036                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2038                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2039                            .dwattr $C$DW$136, DW_AT_decl_line(0x135)
    2040                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    2041                    
    2042                    $C$DW$137       .dwtag  DW_TAG_member
    2043                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2044                            .dwattr $C$DW$137, DW_AT_name("bEnaCmd")
    2045                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("bEnaCmd")
    2046                            .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    2047                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2048                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2049                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2050                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2051                            .dwattr $C$DW$137, DW_AT_decl_line(0x136)
    2052                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2053                    
    2054                    $C$DW$138       .dwtag  DW_TAG_member
    2055                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2056                            .dwattr $C$DW$138, DW_AT_name("triggerNo")
    2057                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("triggerNo")
    2058                            .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    2059                            .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2060                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2062                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2063                            .dwattr $C$DW$138, DW_AT_decl_line(0x138)
    2064                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2065                    
    2066                    $C$DW$139       .dwtag  DW_TAG_member
    2067                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2068                            .dwattr $C$DW$139, DW_AT_name("pastTrig")
    2069                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("pastTrig")
    2070                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2071                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2072                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2074                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2075                            .dwattr $C$DW$139, DW_AT_decl_line(0x139)
    2076                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2077                    
    2078                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2079                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x134)
    2080                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    2081                            .dwendtag $C$DW$T$45
    2082                    
    2083                    
    2084                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2085                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2086                    $C$DW$140       .dwtag  DW_TAG_member
    2087                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2088                            .dwattr $C$DW$140, DW_AT_name("rule")
    2089                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("rule")
    2090                            .dwattr $C$DW$140, DW_AT_bit_offset(0x04)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

