TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 17:19:52 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_cfg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\sensor_cc1350lp\sensor_cc1350lp")
      13                            .global macCfg
      14 00000000                   .sect   ".data:macCfg", RW

    2205                    
    2206                    $C$DW$T$525     .dwtag  DW_TAG_typedef
    2207                            .dwattr $C$DW$T$525, DW_AT_name("tFlashStateCommandsType")
    2208                            .dwattr $C$DW$T$525, DW_AT_type(*$C$DW$T$524)
    2209                            .dwattr $C$DW$T$525, DW_AT_language(DW_LANG_C)
    2210                            .dwattr $C$DW$T$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    2211                            .dwattr $C$DW$T$525, DW_AT_decl_line(0xb0)
    2212                            .dwattr $C$DW$T$525, DW_AT_decl_column(0x03)
    2213                    
    2214                    
    2215                    $C$DW$T$526     .dwtag  DW_TAG_enumeration_type
    2216                            .dwattr $C$DW$T$526, DW_AT_byte_size(0x01)
    2217                    $C$DW$241       .dwtag  DW_TAG_enumerator
    2218                            .dwattr $C$DW$241, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    2219                            .dwattr $C$DW$241, DW_AT_const_value(0xe0)
    2220                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2221                            .dwattr $C$DW$241, DW_AT_decl_line(0x3de)
    2222                            .dwattr $C$DW$241, DW_AT_decl_column(0x04)
    2223                    
    2224                    $C$DW$242       .dwtag  DW_TAG_enumerator
    2225                            .dwattr $C$DW$242, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    2226                            .dwattr $C$DW$242, DW_AT_const_value(0xe1)
    2227                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2228                            .dwattr $C$DW$242, DW_AT_decl_line(0x3e0)
    2229                            .dwattr $C$DW$242, DW_AT_decl_column(0x04)
    2230                    
    2231                    $C$DW$243       .dwtag  DW_TAG_enumerator
    2232                            .dwattr $C$DW$243, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    2233                            .dwattr $C$DW$243, DW_AT_const_value(0xe2)
    2234                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2235                            .dwattr $C$DW$243, DW_AT_decl_line(0x3e2)
    2236                            .dwattr $C$DW$243, DW_AT_decl_column(0x04)
    2237                    
    2238                    $C$DW$244       .dwtag  DW_TAG_enumerator
    2239                            .dwattr $C$DW$244, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    2240                            .dwattr $C$DW$244, DW_AT_const_value(0xe3)
    2241                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2242                            .dwattr $C$DW$244, DW_AT_decl_line(0x3e4)
    2243                            .dwattr $C$DW$244, DW_AT_decl_column(0x04)
    2244                    
    2245                    $C$DW$245       .dwtag  DW_TAG_enumerator
    2246                            .dwattr $C$DW$245, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    2247                            .dwattr $C$DW$245, DW_AT_const_value(0xe4)
    2248                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2249                            .dwattr $C$DW$245, DW_AT_decl_line(0x3e6)
    2250                            .dwattr $C$DW$245, DW_AT_decl_column(0x04)
    2251                    
    2252                    $C$DW$246       .dwtag  DW_TAG_enumerator
    2253                            .dwattr $C$DW$246, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    2254                            .dwattr $C$DW$246, DW_AT_const_value(0xe5)
    2255                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   42

    2256                            .dwattr $C$DW$246, DW_AT_decl_line(0x3e8)
    2257                            .dwattr $C$DW$246, DW_AT_decl_column(0x04)
    2258                    
    2259                            .dwattr $C$DW$T$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2260                            .dwattr $C$DW$T$526, DW_AT_decl_line(0x3dc)
    2261                            .dwattr $C$DW$T$526, DW_AT_decl_column(0x01)
    2262                            .dwendtag $C$DW$T$526
    2263                    
    2264                    $C$DW$T$527     .dwtag  DW_TAG_typedef
    2265                            .dwattr $C$DW$T$527, DW_AT_name("ICall_RemotiCmdEvent_t")
    2266                            .dwattr $C$DW$T$527, DW_AT_type(*$C$DW$T$526)
    2267                            .dwattr $C$DW$T$527, DW_AT_language(DW_LANG_C)
    2268                            .dwattr $C$DW$T$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2269                            .dwattr $C$DW$T$527, DW_AT_decl_line(0x3e9)
    2270                            .dwattr $C$DW$T$527, DW_AT_decl_column(0x02)
    2271                    
    2272                    
    2273                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2274                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    2275                    $C$DW$247       .dwtag  DW_TAG_member
    2276                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2277                            .dwattr $C$DW$247, DW_AT_name("txDataMax")
    2278                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("txDataMax")
    2279                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2281                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2282                            .dwattr $C$DW$247, DW_AT_decl_line(0x53c)
    2283                            .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    2284                    
    2285                    $C$DW$248       .dwtag  DW_TAG_member
    2286                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2287                            .dwattr $C$DW$248, DW_AT_name("txMax")
    2288                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("txMax")
    2289                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2290                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2291                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2292                            .dwattr $C$DW$248, DW_AT_decl_line(0x53d)
    2293                            .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    2294                    
    2295                    $C$DW$249       .dwtag  DW_TAG_member
    2296                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2297                            .dwattr $C$DW$249, DW_AT_name("rxMax")
    2298                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("rxMax")
    2299                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2300                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2301                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2302                            .dwattr $C$DW$249, DW_AT_decl_line(0x53e)
    2303                            .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    2304                    
    2305                    $C$DW$250       .dwtag  DW_TAG_member
    2306                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2307                            .dwattr $C$DW$250, DW_AT_name("dataIndOffset")
    2308                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("dataIndOffset")
    2309                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2310                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   43

    2311                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2312                            .dwattr $C$DW$250, DW_AT_decl_line(0x53f)
    2313                            .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    2314                    
    2315                    $C$DW$251       .dwtag  DW_TAG_member
    2316                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    2317                            .dwattr $C$DW$251, DW_AT_name("maxDeviceTableEntries")
    2318                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("maxDeviceTableEntries")
    2319                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2320                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2321                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2322                            .dwattr $C$DW$251, DW_AT_decl_line(0x541)
    2323                            .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    2324                    
    2325                    $C$DW$252       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    2327                            .dwattr $C$DW$252, DW_AT_name("maxKeyDeviceTableEntries")
    2328                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("maxKeyDeviceTableEntries")
    2329                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2330                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2331                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2332                            .dwattr $C$DW$252, DW_AT_decl_line(0x542)
    2333                            .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    2334                    
    2335                    $C$DW$253       .dwtag  DW_TAG_member
    2336                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    2337                            .dwattr $C$DW$253, DW_AT_name("maxKeyTableEntries")
    2338                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("maxKeyTableEntries")
    2339                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2340                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2341                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2342                            .dwattr $C$DW$253, DW_AT_decl_line(0x543)
    2343                            .dwattr $C$DW$253, DW_AT_decl_column(0x11)
    2344                    
    2345                    $C$DW$254       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2347                            .dwattr $C$DW$254, DW_AT_name("maxNodeKeyTableEntries")
    2348                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("maxNodeKeyTableEntries")
    2349                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2350                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2352                            .dwattr $C$DW$254, DW_AT_decl_line(0x544)
    2353                            .dwattr $C$DW$254, DW_AT_decl_column(0x11)
    2354                    
    2355                    $C$DW$255       .dwtag  DW_TAG_member
    2356                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2357                            .dwattr $C$DW$255, DW_AT_name("maxKeyIdLookUpEntries")
    2358                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("maxKeyIdLookUpEntries")
    2359                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2360                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2361                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2362                            .dwattr $C$DW$255, DW_AT_decl_line(0x545)
    2363                            .dwattr $C$DW$255, DW_AT_decl_column(0x11)
    2364                    
    2365                    $C$DW$256       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   44

    2366                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    2367                            .dwattr $C$DW$256, DW_AT_name("appPendingQueue")
    2368                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("appPendingQueue")
    2369                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2370                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2371                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2372                            .dwattr $C$DW$256, DW_AT_decl_line(0x546)
    2373                            .dwattr $C$DW$256, DW_AT_decl_column(0x11)
    2374                    
    2375                    $C$DW$257       .dwtag  DW_TAG_member
    2376                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    2377                            .dwattr $C$DW$257, DW_AT_name("macMaxFrameSize")
    2378                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("macMaxFrameSize")
    2379                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2380                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2381                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2382                            .dwattr $C$DW$257, DW_AT_decl_line(0x548)
    2383                            .dwattr $C$DW$257, DW_AT_decl_column(0x11)
    2384                    
    2385                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2386                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x53b)
    2387                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    2388                            .dwendtag $C$DW$T$25
    2389                    
    2390                    $C$DW$T$528     .dwtag  DW_TAG_typedef
    2391                            .dwattr $C$DW$T$528, DW_AT_name("macCfg_t")
    2392                            .dwattr $C$DW$T$528, DW_AT_type(*$C$DW$T$25)
    2393                            .dwattr $C$DW$T$528, DW_AT_language(DW_LANG_C)
    2394                            .dwattr $C$DW$T$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2395                            .dwattr $C$DW$T$528, DW_AT_decl_line(0x549)
    2396                            .dwattr $C$DW$T$528, DW_AT_decl_column(0x03)
    2397                    
    2398                    
    2399                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2400                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2401                    $C$DW$258       .dwtag  DW_TAG_member
    2402                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$180)
    2403                            .dwattr $C$DW$258, DW_AT_name("addr")
    2404                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("addr")
    2405                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2407                            .dwattr $C$DW$258, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    2408                            .dwattr $C$DW$258, DW_AT_decl_line(0x55)
    2409                            .dwattr $C$DW$258, DW_AT_decl_column(0x05)
    2410                    
    2411                    $C$DW$259       .dwtag  DW_TAG_member
    2412                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$26)
    2413                            .dwattr $C$DW$259, DW_AT_name("addrMode")
    2414                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("addrMode")
    2415                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2416                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2417                            .dwattr $C$DW$259, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    2418                            .dwattr $C$DW$259, DW_AT_decl_line(0x56)
    2419                            .dwattr $C$DW$259, DW_AT_decl_column(0x13)
    2420                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   45

    2421                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    2422                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
    2423                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    2424                            .dwendtag $C$DW$T$27
    2425                    
    2426                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    2427                            .dwattr $C$DW$T$81, DW_AT_name("sAddr_t")
    2428                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$27)
    2429                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2430                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    2431                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x57)
    2432                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    2433                    
    2434                    
    2435                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2436                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2437                    $C$DW$260       .dwtag  DW_TAG_member
    2438                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$28)
    2439                            .dwattr $C$DW$260, DW_AT_name("p")
    2440                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("p")
    2441                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2443                            .dwattr $C$DW$260, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    2444                            .dwattr $C$DW$260, DW_AT_decl_line(0x3d)
    2445                            .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    2446                    
    2447                    $C$DW$261       .dwtag  DW_TAG_member
    2448                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    2449                            .dwattr $C$DW$261, DW_AT_name("len")
    2450                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("len")
    2451                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2452                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$261, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    2454                            .dwattr $C$DW$261, DW_AT_decl_line(0x3e)
    2455                            .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    2456                    
    2457                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    2458                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3c)
    2459                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    2460                            .dwendtag $C$DW$T$29
    2461                    
    2462                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    2463                            .dwattr $C$DW$T$84, DW_AT_name("sData_t")
    2464                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$29)
    2465                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2466                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    2467                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x3f)
    2468                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    2469                    
    2470                    
    2471                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2472                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    2473                    $C$DW$262       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$182)
    2475                            .dwattr $C$DW$262, DW_AT_name("addr")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   46

    2476                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("addr")
    2477                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2478                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$262, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2480                            .dwattr $C$DW$262, DW_AT_decl_line(0x4db)
    2481                            .dwattr $C$DW$262, DW_AT_decl_column(0x07)
    2482                    
    2483                    $C$DW$263       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
    2485                            .dwattr $C$DW$263, DW_AT_name("addrMode")
    2486                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("addrMode")
    2487                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2488                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$263, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2490                            .dwattr $C$DW$263, DW_AT_decl_line(0x4de)
    2491                            .dwattr $C$DW$263, DW_AT_decl_column(0x17)
    2492                    
    2493                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_ma
    2494                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4d0)
    2495                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2496                            .dwendtag $C$DW$T$32
    2497                    
    2498                    $C$DW$T$328     .dwtag  DW_TAG_typedef
    2499                            .dwattr $C$DW$T$328, DW_AT_name("ApiMac_sAddr_t")
    2500                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$32)
    2501                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    2502                            .dwattr $C$DW$T$328, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_m
    2503                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x4df)
    2504                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x03)
    2505                    
    2506                    
    2507                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2508                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    2509                    $C$DW$264       .dwtag  DW_TAG_member
    2510                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$33)
    2511                            .dwattr $C$DW$264, DW_AT_name("frameCounter")
    2512                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("frameCounter")
    2513                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2514                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2515                            .dwattr $C$DW$264, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2516                            .dwattr $C$DW$264, DW_AT_decl_line(0x575)
    2517                            .dwattr $C$DW$264, DW_AT_decl_column(0x1a)
    2518                    
    2519                    $C$DW$265       .dwtag  DW_TAG_member
    2520                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$34)
    2521                            .dwattr $C$DW$265, DW_AT_name("keyIdx")
    2522                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("keyIdx")
    2523                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2524                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2525                            .dwattr $C$DW$265, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2526                            .dwattr $C$DW$265, DW_AT_decl_line(0x576)
    2527                            .dwattr $C$DW$265, DW_AT_decl_column(0x1a)
    2528                    
    2529                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_ma
    2530                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x574)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   47

    2531                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    2532                            .dwendtag $C$DW$T$35
    2533                    
    2534                    $C$DW$T$389     .dwtag  DW_TAG_typedef
    2535                            .dwattr $C$DW$T$389, DW_AT_name("ApiMac_frameCntr_t")
    2536                            .dwattr $C$DW$T$389, DW_AT_type(*$C$DW$T$35)
    2537                            .dwattr $C$DW$T$389, DW_AT_language(DW_LANG_C)
    2538                            .dwattr $C$DW$T$389, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_m
    2539                            .dwattr $C$DW$T$389, DW_AT_decl_line(0x577)
    2540                            .dwattr $C$DW$T$389, DW_AT_decl_column(0x03)
    2541                    
    2542                    $C$DW$T$390     .dwtag  DW_TAG_pointer_type
    2543                            .dwattr $C$DW$T$390, DW_AT_type(*$C$DW$T$389)
    2544                            .dwattr $C$DW$T$390, DW_AT_address_class(0x20)
    2545                    
    2546                    
    2547                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2548                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x40)
    2549                    $C$DW$266       .dwtag  DW_TAG_member
    2550                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$37)
    2551                            .dwattr $C$DW$266, DW_AT_name("beaconType")
    2552                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("beaconType")
    2553                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2554                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2555                            .dwattr $C$DW$266, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2556                            .dwattr $C$DW$266, DW_AT_decl_line(0x886)
    2557                            .dwattr $C$DW$266, DW_AT_decl_column(0x19)
    2558                    
    2559                    $C$DW$267       .dwtag  DW_TAG_member
    2560                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$26)
    2561                            .dwattr $C$DW$267, DW_AT_name("bsn")
    2562                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("bsn")
    2563                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2564                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2565                            .dwattr $C$DW$267, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2566                            .dwattr $C$DW$267, DW_AT_decl_line(0x888)
    2567                            .dwattr $C$DW$267, DW_AT_decl_column(0x0d)
    2568                    
    2569                    $C$DW$268       .dwtag  DW_TAG_member
    2570                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$38)
    2571                            .dwattr $C$DW$268, DW_AT_name("panDesc")
    2572                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("panDesc")
    2573                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2574                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2575                            .dwattr $C$DW$268, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    2576                            .dwattr $C$DW$268, DW_AT_decl_line(0x88a)
    2577                            .dwattr $C$DW$268, DW_AT_decl_column(0x16)
    2578                    
    2579                    $C$DW$269       .dwtag  DW_TAG_member
    2580                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$185)
    2581                            .dwattr $C$DW$269, DW_AT_name("beaconData")
    2582                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("beaconData")
    2583                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2584                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$269, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   48

    2586                            .dwattr $C$DW$269, DW_AT_decl_line(0x895)
    2587                            .dwattr $C$DW$269, DW_AT_decl_column(0x07)
    2588                    
    2589                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_ma
    2590                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x884)
    2591                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2592                            .dwendtag $C$DW$T$39
    2593                    
    2594                    $C$DW$T$242     .dwtag  DW_TAG_typedef
    2595                            .dwattr $C$DW$T$242, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    2596                            .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$39)
    2597                            .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    2598                            .dwattr $C$DW$T$242, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_m
    2599                            .dwattr $C$DW$T$242, DW_AT_decl_line(0x896)
    2600                            .dwattr $C$DW$T$242, DW_AT_decl_column(0x03)
    2601                    
    2602                    $C$DW$T$243     .dwtag  DW_TAG_pointer_type
    2603                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    2604                            .dwattr $C$DW$T$243, DW_AT_address_class(0x20)
    2605                    
    2606                    
    2607                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2608                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    2609                    $C$DW$270       .dwtag  DW_TAG_member
    2610                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$40)
    2611                            .dwattr $C$DW$270, DW_AT_name("firstChCentrFreq")
    2612                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("firstChCentrFreq")
    2613                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2615                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2616                            .dwattr $C$DW$270, DW_AT_decl_line(0x29b)
    2617                            .dwattr $C$DW$270, DW_AT_decl_column(0x0a)
    2618                    
    2619                    $C$DW$271       .dwtag  DW_TAG_member
    2620                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$40)
    2621                            .dwattr $C$DW$271, DW_AT_name("channelSpacing")
    2622                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("channelSpacing")
    2623                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2624                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2625                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2626                            .dwattr $C$DW$271, DW_AT_decl_line(0x29c)
    2627                            .dwattr $C$DW$271, DW_AT_decl_column(0x0a)
    2628                    
    2629                    $C$DW$272       .dwtag  DW_TAG_member
    2630                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    2631                            .dwattr $C$DW$272, DW_AT_name("noOfChannels")
    2632                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("noOfChannels")
    2633                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2634                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2635                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2636                            .dwattr $C$DW$272, DW_AT_decl_line(0x29d)
    2637                            .dwattr $C$DW$272, DW_AT_decl_column(0x0a)
    2638                    
    2639                    $C$DW$273       .dwtag  DW_TAG_member
    2640                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   49

    2641                            .dwattr $C$DW$273, DW_AT_name("fskModScheme")
    2642                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("fskModScheme")
    2643                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2644                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2645                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2646                            .dwattr $C$DW$273, DW_AT_decl_line(0x29f)
    2647                            .dwattr $C$DW$273, DW_AT_decl_column(0x09)
    2648                    
    2649                    $C$DW$274       .dwtag  DW_TAG_member
    2650                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    2651                            .dwattr $C$DW$274, DW_AT_name("symbolRate")
    2652                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("symbolRate")
    2653                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2654                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2655                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2656                            .dwattr $C$DW$274, DW_AT_decl_line(0x2a1)
    2657                            .dwattr $C$DW$274, DW_AT_decl_column(0x0a)
    2658                    
    2659                    $C$DW$275       .dwtag  DW_TAG_member
    2660                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2661                            .dwattr $C$DW$275, DW_AT_name("fskModIndex")
    2662                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("fskModIndex")
    2663                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2664                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2665                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2666                            .dwattr $C$DW$275, DW_AT_decl_line(0x2a2)
    2667                            .dwattr $C$DW$275, DW_AT_decl_column(0x09)
    2668                    
    2669                    $C$DW$276       .dwtag  DW_TAG_member
    2670                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2671                            .dwattr $C$DW$276, DW_AT_name("ccaType")
    2672                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("ccaType")
    2673                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2674                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2675                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2676                            .dwattr $C$DW$276, DW_AT_decl_line(0x2aa)
    2677                            .dwattr $C$DW$276, DW_AT_decl_column(0x09)
    2678                    
    2679                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2680                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x29a)
    2681                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2682                            .dwendtag $C$DW$T$41
    2683                    
    2684                    $C$DW$T$529     .dwtag  DW_TAG_typedef
    2685                            .dwattr $C$DW$T$529, DW_AT_name("macMRFSKPHYDesc_t")
    2686                            .dwattr $C$DW$T$529, DW_AT_type(*$C$DW$T$41)
    2687                            .dwattr $C$DW$T$529, DW_AT_language(DW_LANG_C)
    2688                            .dwattr $C$DW$T$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2689                            .dwattr $C$DW$T$529, DW_AT_decl_line(0x2ab)
    2690                            .dwattr $C$DW$T$529, DW_AT_decl_column(0x03)
    2691                    
    2692                    $C$DW$T$530     .dwtag  DW_TAG_typedef
    2693                            .dwattr $C$DW$T$530, DW_AT_name("macPHYDesc_t")
    2694                            .dwattr $C$DW$T$530, DW_AT_type(*$C$DW$T$529)
    2695                            .dwattr $C$DW$T$530, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   50

    2696                            .dwattr $C$DW$T$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2697                            .dwattr $C$DW$T$530, DW_AT_decl_line(0x2b1)
    2698                            .dwattr $C$DW$T$530, DW_AT_decl_column(0x1b)
    2699                    
    2700                    
    2701                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2702                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2703                    $C$DW$277       .dwtag  DW_TAG_member
    2704                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2705                            .dwattr $C$DW$277, DW_AT_name("event")
    2706                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("event")
    2707                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2708                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2709                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2710                            .dwattr $C$DW$277, DW_AT_decl_line(0x2b6)
    2711                            .dwattr $C$DW$277, DW_AT_decl_column(0x0b)
    2712                    
    2713                    $C$DW$278       .dwtag  DW_TAG_member
    2714                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2715                            .dwattr $C$DW$278, DW_AT_name("status")
    2716                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("status")
    2717                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2718                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2719                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2720                            .dwattr $C$DW$278, DW_AT_decl_line(0x2b7)
    2721                            .dwattr $C$DW$278, DW_AT_decl_column(0x0b)
    2722                    
    2723                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2724                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2b5)
    2725                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2726                            .dwendtag $C$DW$T$42
    2727                    
    2728                    $C$DW$T$83      .dwtag  DW_TAG_typedef
    2729                            .dwattr $C$DW$T$83, DW_AT_name("macEventHdr_t")
    2730                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    2731                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2732                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2733                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x2b8)
    2734                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    2735                    
    2736                    
    2737                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2738                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x0c)
    2739                    $C$DW$279       .dwtag  DW_TAG_member
    2740                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$43)
    2741                            .dwattr $C$DW$279, DW_AT_name("keySource")
    2742                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("keySource")
    2743                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2745                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2746                            .dwattr $C$DW$279, DW_AT_decl_line(0x2bd)
    2747                            .dwattr $C$DW$279, DW_AT_decl_column(0x0b)
    2748                    
    2749                    $C$DW$280       .dwtag  DW_TAG_member
    2750                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   51

    2751                            .dwattr $C$DW$280, DW_AT_name("securityLevel")
    2752                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("securityLevel")
    2753                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2754                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2755                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2756                            .dwattr $C$DW$280, DW_AT_decl_line(0x2be)
    2757                            .dwattr $C$DW$280, DW_AT_decl_column(0x0b)
    2758                    
    2759                    $C$DW$281       .dwtag  DW_TAG_member
    2760                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2761                            .dwattr $C$DW$281, DW_AT_name("keyIdMode")
    2762                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("keyIdMode")
    2763                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2764                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2765                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2766                            .dwattr $C$DW$281, DW_AT_decl_line(0x2bf)
    2767                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    2768                    
    2769                    $C$DW$282       .dwtag  DW_TAG_member
    2770                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    2771                            .dwattr $C$DW$282, DW_AT_name("keyIndex")
    2772                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("keyIndex")
    2773                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2774                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2775                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2776                            .dwattr $C$DW$282, DW_AT_decl_line(0x2c0)
    2777                            .dwattr $C$DW$282, DW_AT_decl_column(0x0b)
    2778                    
    2779                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2780                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2bc)
    2781                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2782                            .dwendtag $C$DW$T$44
    2783                    
    2784                    $C$DW$T$531     .dwtag  DW_TAG_typedef
    2785                            .dwattr $C$DW$T$531, DW_AT_name("macSec_t")
    2786                            .dwattr $C$DW$T$531, DW_AT_type(*$C$DW$T$44)
    2787                            .dwattr $C$DW$T$531, DW_AT_language(DW_LANG_C)
    2788                            .dwattr $C$DW$T$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2789                            .dwattr $C$DW$T$531, DW_AT_decl_line(0x2c1)
    2790                            .dwattr $C$DW$T$531, DW_AT_decl_column(0x03)
    2791                    
    2792                    
    2793                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2794                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0a)
    2795                    $C$DW$283       .dwtag  DW_TAG_member
    2796                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$45)
    2797                            .dwattr $C$DW$283, DW_AT_name("lookupData")
    2798                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("lookupData")
    2799                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2801                            .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2802                            .dwattr $C$DW$283, DW_AT_decl_line(0x2c6)
    2803                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
    2804                    
    2805                    $C$DW$284       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   52

    2806                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    2807                            .dwattr $C$DW$284, DW_AT_name("lookupDataSize")
    2808                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("lookupDataSize")
    2809                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2810                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2811                            .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2812                            .dwattr $C$DW$284, DW_AT_decl_line(0x2c7)
    2813                            .dwattr $C$DW$284, DW_AT_decl_column(0x16)
    2814                    
    2815                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2816                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c5)
    2817                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2818                            .dwendtag $C$DW$T$46
    2819                    
    2820                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2821                            .dwattr $C$DW$T$49, DW_AT_name("keyIdLookupDescriptor_t")
    2822                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$46)
    2823                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2824                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2825                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2c8)
    2826                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    2827                    
    2828                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2829                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2830                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2831                    
    2832                    
    2833                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2834                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    2835                    $C$DW$285       .dwtag  DW_TAG_member
    2836                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    2837                            .dwattr $C$DW$285, DW_AT_name("deviceDescriptorHandle")
    2838                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    2839                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2841                            .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2842                            .dwattr $C$DW$285, DW_AT_decl_line(0x2cd)
    2843                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    2844                    
    2845                    $C$DW$286       .dwtag  DW_TAG_member
    2846                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
    2847                            .dwattr $C$DW$286, DW_AT_name("uniqueDevice")
    2848                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("uniqueDevice")
    2849                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2850                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2851                            .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2852                            .dwattr $C$DW$286, DW_AT_decl_line(0x2ce)
    2853                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    2854                    
    2855                    $C$DW$287       .dwtag  DW_TAG_member
    2856                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    2857                            .dwattr $C$DW$287, DW_AT_name("blackListed")
    2858                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("blackListed")
    2859                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2860                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   53

    2861                            .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2862                            .dwattr $C$DW$287, DW_AT_decl_line(0x2cf)
    2863                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    2864                    
    2865                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2866                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2cc)
    2867                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2868                            .dwendtag $C$DW$T$47
    2869                    
    2870                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    2871                            .dwattr $C$DW$T$51, DW_AT_name("keyDeviceDescriptor_t")
    2872                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$47)
    2873                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2874                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2875                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2d0)
    2876                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2877                    
    2878                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2879                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2880                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2881                    
    2882                    
    2883                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2884                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2885                    $C$DW$288       .dwtag  DW_TAG_member
    2886                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    2887                            .dwattr $C$DW$288, DW_AT_name("frameType")
    2888                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("frameType")
    2889                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2891                            .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2892                            .dwattr $C$DW$288, DW_AT_decl_line(0x2d5)
    2893                            .dwattr $C$DW$288, DW_AT_decl_column(0x16)
    2894                    
    2895                    $C$DW$289       .dwtag  DW_TAG_member
    2896                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    2897                            .dwattr $C$DW$289, DW_AT_name("cmdFrameId")
    2898                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("cmdFrameId")
    2899                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2900                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2901                            .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2902                            .dwattr $C$DW$289, DW_AT_decl_line(0x2d6)
    2903                            .dwattr $C$DW$289, DW_AT_decl_column(0x16)
    2904                    
    2905                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2906                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d4)
    2907                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2908                            .dwendtag $C$DW$T$48
    2909                    
    2910                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    2911                            .dwattr $C$DW$T$53, DW_AT_name("keyUsageDescriptor_t")
    2912                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$48)
    2913                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2914                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2915                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2d7)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   54

    2916                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    2917                    
    2918                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    2919                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2920                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    2921                    
    2922                    
    2923                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2924                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x2c)
    2925                    $C$DW$290       .dwtag  DW_TAG_member
    2926                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$50)
    2927                            .dwattr $C$DW$290, DW_AT_name("keyIdLookupList")
    2928                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("keyIdLookupList")
    2929                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2931                            .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2932                            .dwattr $C$DW$290, DW_AT_decl_line(0x2dc)
    2933                            .dwattr $C$DW$290, DW_AT_decl_column(0x1d)
    2934                    
    2935                    $C$DW$291       .dwtag  DW_TAG_member
    2936                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    2937                            .dwattr $C$DW$291, DW_AT_name("keyIdLookupEntries")
    2938                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("keyIdLookupEntries")
    2939                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2940                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2941                            .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2942                            .dwattr $C$DW$291, DW_AT_decl_line(0x2dd)
    2943                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    2944                    
    2945                    $C$DW$292       .dwtag  DW_TAG_member
    2946                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$52)
    2947                            .dwattr $C$DW$292, DW_AT_name("keyDeviceList")
    2948                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("keyDeviceList")
    2949                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2950                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2951                            .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2952                            .dwattr $C$DW$292, DW_AT_decl_line(0x2df)
    2953                            .dwattr $C$DW$292, DW_AT_decl_column(0x1d)
    2954                    
    2955                    $C$DW$293       .dwtag  DW_TAG_member
    2956                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    2957                            .dwattr $C$DW$293, DW_AT_name("keyDeviceListEntries")
    2958                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("keyDeviceListEntries")
    2959                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2960                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2961                            .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2962                            .dwattr $C$DW$293, DW_AT_decl_line(0x2e2)
    2963                            .dwattr $C$DW$293, DW_AT_decl_column(0x1d)
    2964                    
    2965                    $C$DW$294       .dwtag  DW_TAG_member
    2966                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$54)
    2967                            .dwattr $C$DW$294, DW_AT_name("keyUsageList")
    2968                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("keyUsageList")
    2969                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2970                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   55

    2971                            .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2972                            .dwattr $C$DW$294, DW_AT_decl_line(0x2e4)
    2973                            .dwattr $C$DW$294, DW_AT_decl_column(0x1d)
    2974                    
    2975                    $C$DW$295       .dwtag  DW_TAG_member
    2976                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    2977                            .dwattr $C$DW$295, DW_AT_name("keyUsageListEntries")
    2978                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("keyUsageListEntries")
    2979                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2980                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2981                            .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2982                            .dwattr $C$DW$295, DW_AT_decl_line(0x2e6)
    2983                            .dwattr $C$DW$295, DW_AT_decl_column(0x1c)
    2984                    
    2985                    $C$DW$296       .dwtag  DW_TAG_member
    2986                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$55)
    2987                            .dwattr $C$DW$296, DW_AT_name("key")
    2988                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("key")
    2989                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2990                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2991                            .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2992                            .dwattr $C$DW$296, DW_AT_decl_line(0x2e8)
    2993                            .dwattr $C$DW$296, DW_AT_decl_column(0x1c)
    2994                    
    2995                    $C$DW$297       .dwtag  DW_TAG_member
    2996                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$40)
    2997                            .dwattr $C$DW$297, DW_AT_name("frameCounter")
    2998                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("frameCounter")
    2999                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3000                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3001                            .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3002                            .dwattr $C$DW$297, DW_AT_decl_line(0x2e9)
    3003                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3004                    
    3005                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3006                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x2db)
    3007                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    3008                            .dwendtag $C$DW$T$56
    3009                    
    3010                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    3011                            .dwattr $C$DW$T$73, DW_AT_name("keyDescriptor_t")
    3012                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$56)
    3013                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3014                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3015                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x2ec)
    3016                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3017                    
    3018                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    3019                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3020                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    3021                    
    3022                    
    3023                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3024                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    3025                    $C$DW$298       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   56

    3026                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$40)
    3027                            .dwattr $C$DW$298, DW_AT_name("frameCounter")
    3028                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("frameCounter")
    3029                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3030                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3031                            .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3032                            .dwattr $C$DW$298, DW_AT_decl_line(0x2f1)
    3033                            .dwattr $C$DW$298, DW_AT_decl_column(0x18)
    3034                    
    3035                    $C$DW$299       .dwtag  DW_TAG_member
    3036                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    3037                            .dwattr $C$DW$299, DW_AT_name("frameCntrIdx")
    3038                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("frameCntrIdx")
    3039                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3040                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3041                            .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3042                            .dwattr $C$DW$299, DW_AT_decl_line(0x2f2)
    3043                            .dwattr $C$DW$299, DW_AT_decl_column(0x18)
    3044                    
    3045                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3046                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2f0)
    3047                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    3048                            .dwendtag $C$DW$T$57
    3049                    
    3050                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    3051                            .dwattr $C$DW$T$60, DW_AT_name("frameCntr_t")
    3052                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    3053                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3054                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3055                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x2f3)
    3056                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3057                    
    3058                    $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3059                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3060                            .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3061                    
    3062                    
    3063                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    3064                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x14)
    3065                    $C$DW$300       .dwtag  DW_TAG_member
    3066                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    3067                            .dwattr $C$DW$300, DW_AT_name("panID")
    3068                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("panID")
    3069                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3070                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3071                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3072                            .dwattr $C$DW$300, DW_AT_decl_line(0x2f8)
    3073                            .dwattr $C$DW$300, DW_AT_decl_column(0x16)
    3074                    
    3075                    $C$DW$301       .dwtag  DW_TAG_member
    3076                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    3077                            .dwattr $C$DW$301, DW_AT_name("shortAddress")
    3078                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("shortAddress")
    3079                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3080                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   57

    3081                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3082                            .dwattr $C$DW$301, DW_AT_decl_line(0x2f9)
    3083                            .dwattr $C$DW$301, DW_AT_decl_column(0x16)
    3084                    
    3085                    $C$DW$302       .dwtag  DW_TAG_member
    3086                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$59)
    3087                            .dwattr $C$DW$302, DW_AT_name("extAddress")
    3088                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("extAddress")
    3089                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3090                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3091                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3092                            .dwattr $C$DW$302, DW_AT_decl_line(0x2fa)
    3093                            .dwattr $C$DW$302, DW_AT_decl_column(0x16)
    3094                    
    3095                    $C$DW$303       .dwtag  DW_TAG_member
    3096                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$61)
    3097                            .dwattr $C$DW$303, DW_AT_name("frameCtr")
    3098                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("frameCtr")
    3099                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3100                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3101                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3102                            .dwattr $C$DW$303, DW_AT_decl_line(0x2fd)
    3103                            .dwattr $C$DW$303, DW_AT_decl_column(0x19)
    3104                    
    3105                    $C$DW$304       .dwtag  DW_TAG_member
    3106                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
    3107                            .dwattr $C$DW$304, DW_AT_name("exempt")
    3108                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("exempt")
    3109                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3110                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3111                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3112                            .dwattr $C$DW$304, DW_AT_decl_line(0x303)
    3113                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3114                    
    3115                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3116                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2f7)
    3117                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    3118                            .dwendtag $C$DW$T$62
    3119                    
    3120                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    3121                            .dwattr $C$DW$T$68, DW_AT_name("deviceDescriptor_t")
    3122                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$62)
    3123                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3124                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3125                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x305)
    3126                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3127                    
    3128                    $C$DW$T$177     .dwtag  DW_TAG_pointer_type
    3129                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$68)
    3130                            .dwattr $C$DW$T$177, DW_AT_address_class(0x20)
    3131                    
    3132                    
    3133                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3134                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3135                    $C$DW$305       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   58

    3136                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    3137                            .dwattr $C$DW$305, DW_AT_name("frameType")
    3138                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("frameType")
    3139                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3140                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3141                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3142                            .dwattr $C$DW$305, DW_AT_decl_line(0x30a)
    3143                            .dwattr $C$DW$305, DW_AT_decl_column(0x16)
    3144                    
    3145                    $C$DW$306       .dwtag  DW_TAG_member
    3146                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    3147                            .dwattr $C$DW$306, DW_AT_name("commandFrameIdentifier")
    3148                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3149                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3150                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3151                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3152                            .dwattr $C$DW$306, DW_AT_decl_line(0x30b)
    3153                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3154                    
    3155                    $C$DW$307       .dwtag  DW_TAG_member
    3156                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    3157                            .dwattr $C$DW$307, DW_AT_name("securityMinimum")
    3158                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("securityMinimum")
    3159                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3160                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3161                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3162                            .dwattr $C$DW$307, DW_AT_decl_line(0x30c)
    3163                            .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    3164                    
    3165                    $C$DW$308       .dwtag  DW_TAG_member
    3166                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
    3167                            .dwattr $C$DW$308, DW_AT_name("securityOverrideSecurityMinimum")
    3168                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3169                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3170                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3171                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3172                            .dwattr $C$DW$308, DW_AT_decl_line(0x30e)
    3173                            .dwattr $C$DW$308, DW_AT_decl_column(0x16)
    3174                    
    3175                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3176                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x309)
    3177                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    3178                            .dwendtag $C$DW$T$63
    3179                    
    3180                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    3181                            .dwattr $C$DW$T$70, DW_AT_name("securityLevelDescriptor_t")
    3182                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$63)
    3183                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3184                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3185                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x317)
    3186                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3187                    
    3188                    
    3189                    $C$DW$T$178     .dwtag  DW_TAG_array_type
    3190                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$70)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   59

    3191                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    3192                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x08)
    3193                    $C$DW$309       .dwtag  DW_TAG_subrange_type
    3194                            .dwattr $C$DW$309, DW_AT_upper_bound(0x01)
    3195                    
    3196                            .dwendtag $C$DW$T$178
    3197                    
    3198                    
    3199                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    3200                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
    3201                    $C$DW$310       .dwtag  DW_TAG_member
    3202                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    3203                            .dwattr $C$DW$310, DW_AT_name("key_index")
    3204                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("key_index")
    3205                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3206                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3207                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3208                            .dwattr $C$DW$310, DW_AT_decl_line(0x31c)
    3209                            .dwattr $C$DW$310, DW_AT_decl_column(0x1b)
    3210                    
    3211                    $C$DW$311       .dwtag  DW_TAG_member
    3212                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    3213                            .dwattr $C$DW$311, DW_AT_name("key_id_lookup_index")
    3214                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("key_id_lookup_index")
    3215                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3216                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3217                            .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3218                            .dwattr $C$DW$311, DW_AT_decl_line(0x31d)
    3219                            .dwattr $C$DW$311, DW_AT_decl_column(0x1b)
    3220                    
    3221                    $C$DW$312       .dwtag  DW_TAG_member
    3222                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$49)
    3223                            .dwattr $C$DW$312, DW_AT_name("macKeyIdLookupEntry")
    3224                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3225                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3226                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3227                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3228                            .dwattr $C$DW$312, DW_AT_decl_line(0x31e)
    3229                            .dwattr $C$DW$312, DW_AT_decl_column(0x1b)
    3230                    
    3231                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3232                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x31b)
    3233                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
    3234                            .dwendtag $C$DW$T$64
    3235                    
    3236                    $C$DW$T$532     .dwtag  DW_TAG_typedef
    3237                            .dwattr $C$DW$T$532, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3238                            .dwattr $C$DW$T$532, DW_AT_type(*$C$DW$T$64)
    3239                            .dwattr $C$DW$T$532, DW_AT_language(DW_LANG_C)
    3240                            .dwattr $C$DW$T$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3241                            .dwattr $C$DW$T$532, DW_AT_decl_line(0x31f)
    3242                            .dwattr $C$DW$T$532, DW_AT_decl_column(0x03)
    3243                    
    3244                    
    3245                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   60

    3246                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
    3247                    $C$DW$313       .dwtag  DW_TAG_member
    3248                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    3249                            .dwattr $C$DW$313, DW_AT_name("key_index")
    3250                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("key_index")
    3251                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3252                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3253                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3254                            .dwattr $C$DW$313, DW_AT_decl_line(0x323)
    3255                            .dwattr $C$DW$313, DW_AT_decl_column(0x1b)
    3256                    
    3257                    $C$DW$314       .dwtag  DW_TAG_member
    3258                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    3259                            .dwattr $C$DW$314, DW_AT_name("key_device_index")
    3260                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("key_device_index")
    3261                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3262                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3263                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3264                            .dwattr $C$DW$314, DW_AT_decl_line(0x324)
    3265                            .dwattr $C$DW$314, DW_AT_decl_column(0x1b)
    3266                    
    3267                    $C$DW$315       .dwtag  DW_TAG_member
    3268                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$51)
    3269                            .dwattr $C$DW$315, DW_AT_name("macKeyDeviceEntry")
    3270                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3271                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3272                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3274                            .dwattr $C$DW$315, DW_AT_decl_line(0x325)
    3275                            .dwattr $C$DW$315, DW_AT_decl_column(0x1b)
    3276                    
    3277                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3278                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x322)
    3279                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
    3280                            .dwendtag $C$DW$T$65
    3281                    
    3282                    $C$DW$T$533     .dwtag  DW_TAG_typedef
    3283                            .dwattr $C$DW$T$533, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3284                            .dwattr $C$DW$T$533, DW_AT_type(*$C$DW$T$65)
    3285                            .dwattr $C$DW$T$533, DW_AT_language(DW_LANG_C)
    3286                            .dwattr $C$DW$T$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3287                            .dwattr $C$DW$T$533, DW_AT_decl_line(0x326)
    3288                            .dwattr $C$DW$T$533, DW_AT_decl_column(0x03)
    3289                    
    3290                    
    3291                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3292                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x06)
    3293                    $C$DW$316       .dwtag  DW_TAG_member
    3294                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    3295                            .dwattr $C$DW$316, DW_AT_name("key_index")
    3296                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("key_index")
    3297                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3298                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3299                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3300                            .dwattr $C$DW$316, DW_AT_decl_line(0x32a)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   61

    3301                            .dwattr $C$DW$316, DW_AT_decl_column(0x1b)
    3302                    
    3303                    $C$DW$317       .dwtag  DW_TAG_member
    3304                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    3305                            .dwattr $C$DW$317, DW_AT_name("key_key_usage_index")
    3306                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("key_key_usage_index")
    3307                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3308                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3309                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3310                            .dwattr $C$DW$317, DW_AT_decl_line(0x32b)
    3311                            .dwattr $C$DW$317, DW_AT_decl_column(0x1b)
    3312                    
    3313                    $C$DW$318       .dwtag  DW_TAG_member
    3314                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$53)
    3315                            .dwattr $C$DW$318, DW_AT_name("macKeyUsageEntry")
    3316                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("macKeyUsageEntry")
    3317                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3318                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3319                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3320                            .dwattr $C$DW$318, DW_AT_decl_line(0x32c)
    3321                            .dwattr $C$DW$318, DW_AT_decl_column(0x1b)
    3322                    
    3323                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3324                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x329)
    3325                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    3326                            .dwendtag $C$DW$T$66
    3327                    
    3328                    $C$DW$T$534     .dwtag  DW_TAG_typedef
    3329                            .dwattr $C$DW$T$534, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3330                            .dwattr $C$DW$T$534, DW_AT_type(*$C$DW$T$66)
    3331                            .dwattr $C$DW$T$534, DW_AT_language(DW_LANG_C)
    3332                            .dwattr $C$DW$T$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3333                            .dwattr $C$DW$T$534, DW_AT_decl_line(0x32d)
    3334                            .dwattr $C$DW$T$534, DW_AT_decl_column(0x03)
    3335                    
    3336                    
    3337                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3338                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x18)
    3339                    $C$DW$319       .dwtag  DW_TAG_member
    3340                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    3341                            .dwattr $C$DW$319, DW_AT_name("key_index")
    3342                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("key_index")
    3343                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3344                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3345                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3346                            .dwattr $C$DW$319, DW_AT_decl_line(0x331)
    3347                            .dwattr $C$DW$319, DW_AT_decl_column(0x1b)
    3348                    
    3349                    $C$DW$320       .dwtag  DW_TAG_member
    3350                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$55)
    3351                            .dwattr $C$DW$320, DW_AT_name("keyEntry")
    3352                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("keyEntry")
    3353                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3354                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3355                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{DB65DA2B-52AA-4570-A655-E7779499581D} PAGE   62

    3356                            .dwattr $C$DW$320, DW_AT_decl_line(0x332)
    3357                            .dwattr $C$DW$320, DW_AT_decl_column(0x1b)
    3358                    
    3359                    $C$DW$321       .dwtag  DW_TAG_member
    3360                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$40)
    3361                            .dwattr $C$DW$321, DW_AT_name("frameCounter")
    3362                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("frameCounter")
    3363                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3364                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3365                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3366                            .dwattr $C$DW$321, DW_AT_decl_line(0x333)
    3367                            .dwattr $C$DW$321, DW_AT_decl_column(0x1b)
    3368                    
    3369                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3370                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x330)
    3371                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    3372                            .dwendtag $C$DW$T$67
    3373                    
    3374                    $C$DW$T$535     .dwtag  DW_TAG_typedef
    3375                            .dwattr $C$DW$T$535, DW_AT_name("macSecurityPibKeyEntry_t")
    3376                            .dwattr $C$DW$T$535, DW_AT_type(*$C$DW$T$67)
    3377                            .dwattr $C$DW$T$535, DW_AT_language(DW_LANG_C)
    3378                            .dwattr $C$DW$T$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3379                            .dwattr $C$DW$T$535, DW_AT_decl_line(0x334)
    3380                            .dwattr $C$DW$T$535, DW_AT_decl_column(0x03)
    3381                    
    3382                    
