TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 17:19:53 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/macstack.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    6363                            .dwattr $C$DW$643, DW_AT_decl_column(0x05)
    6364                    
    6365                    $C$DW$644       .dwtag  DW_TAG_enumerator
    6366                            .dwattr $C$DW$644, DW_AT_name("MAC_RADIO_CC1352P")
    6367                            .dwattr $C$DW$644, DW_AT_const_value(0x02)
    6368                            .dwattr $C$DW$644, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_use
    6369                            .dwattr $C$DW$644, DW_AT_decl_line(0x11e)
    6370                            .dwattr $C$DW$644, DW_AT_decl_column(0x05)
    6371                    
    6372                    $C$DW$645       .dwtag  DW_TAG_enumerator
    6373                            .dwattr $C$DW$645, DW_AT_name("MAC_RADIO_CCXXX2")
    6374                            .dwattr $C$DW$645, DW_AT_const_value(0x00)
    6375                            .dwattr $C$DW$645, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_use
    6376                            .dwattr $C$DW$645, DW_AT_decl_line(0x11f)
    6377                            .dwattr $C$DW$645, DW_AT_decl_column(0x05)
    6378                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  117

    6379                            .dwattr $C$DW$T$1219, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_
    6380                            .dwattr $C$DW$T$1219, DW_AT_decl_line(0x118)
    6381                            .dwattr $C$DW$T$1219, DW_AT_decl_column(0x01)
    6382                            .dwendtag $C$DW$T$1219
    6383                    
    6384                    $C$DW$T$1220    .dwtag  DW_TAG_typedef
    6385                            .dwattr $C$DW$T$1220, DW_AT_name("macChipType_t")
    6386                            .dwattr $C$DW$T$1220, DW_AT_type(*$C$DW$T$1219)
    6387                            .dwattr $C$DW$T$1220, DW_AT_language(DW_LANG_C)
    6388                            .dwattr $C$DW$T$1220, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_
    6389                            .dwattr $C$DW$T$1220, DW_AT_decl_line(0x120)
    6390                            .dwattr $C$DW$T$1220, DW_AT_decl_column(0x03)
    6391                    
    6392                    
    6393                    $C$DW$T$1221    .dwtag  DW_TAG_enumeration_type
    6394                            .dwattr $C$DW$T$1221, DW_AT_byte_size(0x01)
    6395                    $C$DW$646       .dwtag  DW_TAG_enumerator
    6396                            .dwattr $C$DW$646, DW_AT_name("MAC_HW_REV_21")
    6397                            .dwattr $C$DW$646, DW_AT_const_value(0x00)
    6398                            .dwattr $C$DW$646, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_use
    6399                            .dwattr $C$DW$646, DW_AT_decl_line(0x125)
    6400                            .dwattr $C$DW$646, DW_AT_decl_column(0x05)
    6401                    
    6402                    $C$DW$647       .dwtag  DW_TAG_enumerator
    6403                            .dwattr $C$DW$647, DW_AT_name("MAC_HW_REV_20")
    6404                            .dwattr $C$DW$647, DW_AT_const_value(0x01)
    6405                            .dwattr $C$DW$647, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_use
    6406                            .dwattr $C$DW$647, DW_AT_decl_line(0x126)
    6407                            .dwattr $C$DW$647, DW_AT_decl_column(0x05)
    6408                    
    6409                    $C$DW$648       .dwtag  DW_TAG_enumerator
    6410                            .dwattr $C$DW$648, DW_AT_name("MAC_HW_MAX_REVS")
    6411                            .dwattr $C$DW$648, DW_AT_const_value(0x02)
    6412                            .dwattr $C$DW$648, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_use
    6413                            .dwattr $C$DW$648, DW_AT_decl_line(0x127)
    6414                            .dwattr $C$DW$648, DW_AT_decl_column(0x05)
    6415                    
    6416                            .dwattr $C$DW$T$1221, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_
    6417                            .dwattr $C$DW$T$1221, DW_AT_decl_line(0x124)
    6418                            .dwattr $C$DW$T$1221, DW_AT_decl_column(0x01)
    6419                            .dwendtag $C$DW$T$1221
    6420                    
    6421                    $C$DW$T$1222    .dwtag  DW_TAG_typedef
    6422                            .dwattr $C$DW$T$1222, DW_AT_name("macHwRevision_t")
    6423                            .dwattr $C$DW$T$1222, DW_AT_type(*$C$DW$T$1221)
    6424                            .dwattr $C$DW$T$1222, DW_AT_language(DW_LANG_C)
    6425                            .dwattr $C$DW$T$1222, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/mac_
    6426                            .dwattr $C$DW$T$1222, DW_AT_decl_line(0x128)
    6427                            .dwattr $C$DW$T$1222, DW_AT_decl_column(0x03)
    6428                    
    6429                    
    6430                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6431                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    6432                    $C$DW$649       .dwtag  DW_TAG_member
    6433                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  118

    6434                            .dwattr $C$DW$649, DW_AT_name("event")
    6435                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("event")
    6436                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6437                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6438                            .dwattr $C$DW$649, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6439                            .dwattr $C$DW$649, DW_AT_decl_line(0x2b6)
    6440                            .dwattr $C$DW$649, DW_AT_decl_column(0x0b)
    6441                    
    6442                    $C$DW$650       .dwtag  DW_TAG_member
    6443                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$19)
    6444                            .dwattr $C$DW$650, DW_AT_name("status")
    6445                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("status")
    6446                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6447                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6448                            .dwattr $C$DW$650, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6449                            .dwattr $C$DW$650, DW_AT_decl_line(0x2b7)
    6450                            .dwattr $C$DW$650, DW_AT_decl_column(0x0b)
    6451                    
    6452                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6453                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b5)
    6454                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    6455                            .dwendtag $C$DW$T$20
    6456                    
    6457                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    6458                            .dwattr $C$DW$T$35, DW_AT_name("macEventHdr_t")
    6459                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$20)
    6460                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6461                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6462                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x2b8)
    6463                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    6464                    
    6465                    
    6466                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6467                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    6468                    $C$DW$651       .dwtag  DW_TAG_member
    6469                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$549)
    6470                            .dwattr $C$DW$651, DW_AT_name("addr")
    6471                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("addr")
    6472                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6473                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6474                            .dwattr $C$DW$651, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    6475                            .dwattr $C$DW$651, DW_AT_decl_line(0x4db)
    6476                            .dwattr $C$DW$651, DW_AT_decl_column(0x07)
    6477                    
    6478                    $C$DW$652       .dwtag  DW_TAG_member
    6479                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$22)
    6480                            .dwattr $C$DW$652, DW_AT_name("addrMode")
    6481                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("addrMode")
    6482                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6483                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6484                            .dwattr $C$DW$652, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_mac
    6485                            .dwattr $C$DW$652, DW_AT_decl_line(0x4de)
    6486                            .dwattr $C$DW$652, DW_AT_decl_column(0x17)
    6487                    
    6488                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_ma
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  119

    6489                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d0)
    6490                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    6491                            .dwendtag $C$DW$T$23
    6492                    
    6493                    $C$DW$T$801     .dwtag  DW_TAG_typedef
    6494                            .dwattr $C$DW$T$801, DW_AT_name("ApiMac_sAddr_t")
    6495                            .dwattr $C$DW$T$801, DW_AT_type(*$C$DW$T$23)
    6496                            .dwattr $C$DW$T$801, DW_AT_language(DW_LANG_C)
    6497                            .dwattr $C$DW$T$801, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/api_m
    6498                            .dwattr $C$DW$T$801, DW_AT_decl_line(0x4df)
    6499                            .dwattr $C$DW$T$801, DW_AT_decl_column(0x03)
    6500                    
    6501                    
    6502                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6503                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    6504                    $C$DW$653       .dwtag  DW_TAG_member
    6505                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$550)
    6506                            .dwattr $C$DW$653, DW_AT_name("addr")
    6507                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("addr")
    6508                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6509                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6510                            .dwattr $C$DW$653, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    6511                            .dwattr $C$DW$653, DW_AT_decl_line(0x55)
    6512                            .dwattr $C$DW$653, DW_AT_decl_column(0x05)
    6513                    
    6514                    $C$DW$654       .dwtag  DW_TAG_member
    6515                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    6516                            .dwattr $C$DW$654, DW_AT_name("addrMode")
    6517                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("addrMode")
    6518                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6519                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6520                            .dwattr $C$DW$654, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    6521                            .dwattr $C$DW$654, DW_AT_decl_line(0x56)
    6522                            .dwattr $C$DW$654, DW_AT_decl_column(0x13)
    6523                    
    6524                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    6525                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x50)
    6526                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6527                            .dwendtag $C$DW$T$25
    6528                    
    6529                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    6530                            .dwattr $C$DW$T$26, DW_AT_name("sAddr_t")
    6531                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    6532                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    6533                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    6534                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x57)
    6535                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    6536                    
    6537                    $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    6538                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$26)
    6539                            .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    6540                    
    6541                    
    6542                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6543                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x24)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  120

    6544                    $C$DW$655       .dwtag  DW_TAG_member
    6545                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$26)
    6546                            .dwattr $C$DW$655, DW_AT_name("coordAddress")
    6547                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("coordAddress")
    6548                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6549                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6550                            .dwattr $C$DW$655, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6551                            .dwattr $C$DW$655, DW_AT_decl_line(0x3e1)
    6552                            .dwattr $C$DW$655, DW_AT_decl_column(0x11)
    6553                    
    6554                    $C$DW$656       .dwtag  DW_TAG_member
    6555                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    6556                            .dwattr $C$DW$656, DW_AT_name("coordPanId")
    6557                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("coordPanId")
    6558                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6559                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6560                            .dwattr $C$DW$656, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6561                            .dwattr $C$DW$656, DW_AT_decl_line(0x3e2)
    6562                            .dwattr $C$DW$656, DW_AT_decl_column(0x11)
    6563                    
    6564                    $C$DW$657       .dwtag  DW_TAG_member
    6565                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$27)
    6566                            .dwattr $C$DW$657, DW_AT_name("superframeSpec")
    6567                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("superframeSpec")
    6568                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6569                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6570                            .dwattr $C$DW$657, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6571                            .dwattr $C$DW$657, DW_AT_decl_line(0x3e3)
    6572                            .dwattr $C$DW$657, DW_AT_decl_column(0x11)
    6573                    
    6574                    $C$DW$658       .dwtag  DW_TAG_member
    6575                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$19)
    6576                            .dwattr $C$DW$658, DW_AT_name("logicalChannel")
    6577                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("logicalChannel")
    6578                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6579                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6580                            .dwattr $C$DW$658, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6581                            .dwattr $C$DW$658, DW_AT_decl_line(0x3e4)
    6582                            .dwattr $C$DW$658, DW_AT_decl_column(0x11)
    6583                    
    6584                    $C$DW$659       .dwtag  DW_TAG_member
    6585                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$19)
    6586                            .dwattr $C$DW$659, DW_AT_name("channelPage")
    6587                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("channelPage")
    6588                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6589                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6590                            .dwattr $C$DW$659, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6591                            .dwattr $C$DW$659, DW_AT_decl_line(0x3e5)
    6592                            .dwattr $C$DW$659, DW_AT_decl_column(0x11)
    6593                    
    6594                    $C$DW$660       .dwtag  DW_TAG_member
    6595                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$28)
    6596                            .dwattr $C$DW$660, DW_AT_name("gtsPermit")
    6597                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("gtsPermit")
    6598                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  121

    6599                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6600                            .dwattr $C$DW$660, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6601                            .dwattr $C$DW$660, DW_AT_decl_line(0x3e6)
    6602                            .dwattr $C$DW$660, DW_AT_decl_column(0x11)
    6603                    
    6604                    $C$DW$661       .dwtag  DW_TAG_member
    6605                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$19)
    6606                            .dwattr $C$DW$661, DW_AT_name("linkQuality")
    6607                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("linkQuality")
    6608                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6609                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6610                            .dwattr $C$DW$661, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6611                            .dwattr $C$DW$661, DW_AT_decl_line(0x3e7)
    6612                            .dwattr $C$DW$661, DW_AT_decl_column(0x11)
    6613                    
    6614                    $C$DW$662       .dwtag  DW_TAG_member
    6615                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$29)
    6616                            .dwattr $C$DW$662, DW_AT_name("timestamp")
    6617                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("timestamp")
    6618                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6619                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6620                            .dwattr $C$DW$662, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6621                            .dwattr $C$DW$662, DW_AT_decl_line(0x3e8)
    6622                            .dwattr $C$DW$662, DW_AT_decl_column(0x11)
    6623                    
    6624                    $C$DW$663       .dwtag  DW_TAG_member
    6625                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$28)
    6626                            .dwattr $C$DW$663, DW_AT_name("securityFailure")
    6627                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("securityFailure")
    6628                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6629                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6630                            .dwattr $C$DW$663, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6631                            .dwattr $C$DW$663, DW_AT_decl_line(0x3e9)
    6632                            .dwattr $C$DW$663, DW_AT_decl_column(0x11)
    6633                    
    6634                    $C$DW$664       .dwtag  DW_TAG_member
    6635                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$30)
    6636                            .dwattr $C$DW$664, DW_AT_name("sec")
    6637                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("sec")
    6638                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6639                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6640                            .dwattr $C$DW$664, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6641                            .dwattr $C$DW$664, DW_AT_decl_line(0x3ea)
    6642                            .dwattr $C$DW$664, DW_AT_decl_column(0x11)
    6643                    
    6644                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6645                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3e0)
    6646                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    6647                            .dwendtag $C$DW$T$31
    6648                    
    6649                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    6650                            .dwattr $C$DW$T$73, DW_AT_name("macPanDesc_t")
    6651                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$31)
    6652                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6653                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  122

    6654                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x3eb)
    6655                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    6656                    
    6657                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    6658                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    6659                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    6660                    
    6661                    
    6662                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6663                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x2c)
    6664                    $C$DW$665       .dwtag  DW_TAG_member
    6665                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$32)
    6666                            .dwattr $C$DW$665, DW_AT_name("scanChannels")
    6667                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("scanChannels")
    6668                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6669                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6670                            .dwattr $C$DW$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6671                            .dwattr $C$DW$665, DW_AT_decl_line(0x421)
    6672                            .dwattr $C$DW$665, DW_AT_decl_column(0x14)
    6673                    
    6674                    $C$DW$666       .dwtag  DW_TAG_member
    6675                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$19)
    6676                            .dwattr $C$DW$666, DW_AT_name("scanType")
    6677                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("scanType")
    6678                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6679                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6680                            .dwattr $C$DW$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6681                            .dwattr $C$DW$666, DW_AT_decl_line(0x422)
    6682                            .dwattr $C$DW$666, DW_AT_decl_column(0x14)
    6683                    
    6684                    $C$DW$667       .dwtag  DW_TAG_member
    6685                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$19)
    6686                            .dwattr $C$DW$667, DW_AT_name("scanDuration")
    6687                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("scanDuration")
    6688                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6689                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6690                            .dwattr $C$DW$667, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6691                            .dwattr $C$DW$667, DW_AT_decl_line(0x423)
    6692                            .dwattr $C$DW$667, DW_AT_decl_column(0x14)
    6693                    
    6694                    $C$DW$668       .dwtag  DW_TAG_member
    6695                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$19)
    6696                            .dwattr $C$DW$668, DW_AT_name("channelPage")
    6697                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("channelPage")
    6698                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6699                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6700                            .dwattr $C$DW$668, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6701                            .dwattr $C$DW$668, DW_AT_decl_line(0x424)
    6702                            .dwattr $C$DW$668, DW_AT_decl_column(0x14)
    6703                    
    6704                    $C$DW$669       .dwtag  DW_TAG_member
    6705                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$19)
    6706                            .dwattr $C$DW$669, DW_AT_name("phyID")
    6707                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("phyID")
    6708                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  123

    6709                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6710                            .dwattr $C$DW$669, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6711                            .dwattr $C$DW$669, DW_AT_decl_line(0x425)
    6712                            .dwattr $C$DW$669, DW_AT_decl_column(0x14)
    6713                    
    6714                    $C$DW$670       .dwtag  DW_TAG_member
    6715                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$19)
    6716                            .dwattr $C$DW$670, DW_AT_name("maxResults")
    6717                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("maxResults")
    6718                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6719                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6720                            .dwattr $C$DW$670, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6721                            .dwattr $C$DW$670, DW_AT_decl_line(0x426)
    6722                            .dwattr $C$DW$670, DW_AT_decl_column(0x14)
    6723                    
    6724                    $C$DW$671       .dwtag  DW_TAG_member
    6725                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$28)
    6726                            .dwattr $C$DW$671, DW_AT_name("permitJoining")
    6727                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("permitJoining")
    6728                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6729                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6730                            .dwattr $C$DW$671, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6731                            .dwattr $C$DW$671, DW_AT_decl_line(0x427)
    6732                            .dwattr $C$DW$671, DW_AT_decl_column(0x14)
    6733                    
    6734                    $C$DW$672       .dwtag  DW_TAG_member
    6735                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$19)
    6736                            .dwattr $C$DW$672, DW_AT_name("linkQuality")
    6737                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("linkQuality")
    6738                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6739                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6740                            .dwattr $C$DW$672, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6741                            .dwattr $C$DW$672, DW_AT_decl_line(0x429)
    6742                            .dwattr $C$DW$672, DW_AT_decl_column(0x14)
    6743                    
    6744                    $C$DW$673       .dwtag  DW_TAG_member
    6745                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$19)
    6746                            .dwattr $C$DW$673, DW_AT_name("percentFilter")
    6747                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("percentFilter")
    6748                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6749                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6750                            .dwattr $C$DW$673, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6751                            .dwattr $C$DW$673, DW_AT_decl_line(0x42b)
    6752                            .dwattr $C$DW$673, DW_AT_decl_column(0x14)
    6753                    
    6754                    $C$DW$674       .dwtag  DW_TAG_member
    6755                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$30)
    6756                            .dwattr $C$DW$674, DW_AT_name("sec")
    6757                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("sec")
    6758                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6759                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6760                            .dwattr $C$DW$674, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6761                            .dwattr $C$DW$674, DW_AT_decl_line(0x42e)
    6762                            .dwattr $C$DW$674, DW_AT_decl_column(0x14)
    6763                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  124

    6764                    $C$DW$675       .dwtag  DW_TAG_member
    6765                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$28)
    6766                            .dwattr $C$DW$675, DW_AT_name("MPMScan")
    6767                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("MPMScan")
    6768                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6769                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6770                            .dwattr $C$DW$675, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6771                            .dwattr $C$DW$675, DW_AT_decl_line(0x42f)
    6772                            .dwattr $C$DW$675, DW_AT_decl_column(0x14)
    6773                    
    6774                    $C$DW$676       .dwtag  DW_TAG_member
    6775                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$19)
    6776                            .dwattr $C$DW$676, DW_AT_name("MPMScanType")
    6777                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("MPMScanType")
    6778                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6779                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6780                            .dwattr $C$DW$676, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6781                            .dwattr $C$DW$676, DW_AT_decl_line(0x431)
    6782                            .dwattr $C$DW$676, DW_AT_decl_column(0x14)
    6783                    
    6784                    $C$DW$677       .dwtag  DW_TAG_member
    6785                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$27)
    6786                            .dwattr $C$DW$677, DW_AT_name("MPMScanDuration")
    6787                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("MPMScanDuration")
    6788                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6789                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6790                            .dwattr $C$DW$677, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6791                            .dwattr $C$DW$677, DW_AT_decl_line(0x432)
    6792                            .dwattr $C$DW$677, DW_AT_decl_column(0x14)
    6793                    
    6794                    $C$DW$678       .dwtag  DW_TAG_member
    6795                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$551)
    6796                            .dwattr $C$DW$678, DW_AT_name("result")
    6797                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("result")
    6798                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6799                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6800                            .dwattr $C$DW$678, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6801                            .dwattr $C$DW$678, DW_AT_decl_line(0x440)
    6802                            .dwattr $C$DW$678, DW_AT_decl_column(0x05)
    6803                    
    6804                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6805                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x420)
    6806                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6807                            .dwendtag $C$DW$T$33
    6808                    
    6809                    $C$DW$T$552     .dwtag  DW_TAG_typedef
    6810                            .dwattr $C$DW$T$552, DW_AT_name("macMlmeScanReq_t")
    6811                            .dwattr $C$DW$T$552, DW_AT_type(*$C$DW$T$33)
    6812                            .dwattr $C$DW$T$552, DW_AT_language(DW_LANG_C)
    6813                            .dwattr $C$DW$T$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6814                            .dwattr $C$DW$T$552, DW_AT_decl_line(0x441)
    6815                            .dwattr $C$DW$T$552, DW_AT_decl_column(0x03)
    6816                    
    6817                    
    6818                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  125

    6819                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6820                    $C$DW$679       .dwtag  DW_TAG_member
    6821                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$19)
    6822                            .dwattr $C$DW$679, DW_AT_name("msduHandle")
    6823                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("msduHandle")
    6824                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6825                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6826                            .dwattr $C$DW$679, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6827                            .dwattr $C$DW$679, DW_AT_decl_line(0x160)
    6828                            .dwattr $C$DW$679, DW_AT_decl_column(0x1f)
    6829                    
    6830                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6831                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x15f)
    6832                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6833                            .dwendtag $C$DW$T$34
    6834                    
    6835                    $C$DW$T$553     .dwtag  DW_TAG_typedef
    6836                            .dwattr $C$DW$T$553, DW_AT_name("macMcpsPurgeReq_t")
    6837                            .dwattr $C$DW$T$553, DW_AT_type(*$C$DW$T$34)
    6838                            .dwattr $C$DW$T$553, DW_AT_language(DW_LANG_C)
    6839                            .dwattr $C$DW$T$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6840                            .dwattr $C$DW$T$553, DW_AT_decl_line(0x161)
    6841                            .dwattr $C$DW$T$553, DW_AT_decl_column(0x03)
    6842                    
    6843                    
    6844                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6845                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x38)
    6846                    $C$DW$680       .dwtag  DW_TAG_member
    6847                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$35)
    6848                            .dwattr $C$DW$680, DW_AT_name("hdr")
    6849                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("hdr")
    6850                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6851                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6852                            .dwattr $C$DW$680, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6853                            .dwattr $C$DW$680, DW_AT_decl_line(0x167)
    6854                            .dwattr $C$DW$680, DW_AT_decl_column(0x1f)
    6855                    
    6856                    $C$DW$681       .dwtag  DW_TAG_member
    6857                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$554)
    6858                            .dwattr $C$DW$681, DW_AT_name("mac")
    6859                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("mac")
    6860                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6861                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6862                            .dwattr $C$DW$681, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6863                            .dwattr $C$DW$681, DW_AT_decl_line(0x170)
    6864                            .dwattr $C$DW$681, DW_AT_decl_column(0x05)
    6865                    
    6866                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6867                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x166)
    6868                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6869                            .dwendtag $C$DW$T$36
    6870                    
    6871                    $C$DW$T$562     .dwtag  DW_TAG_typedef
    6872                            .dwattr $C$DW$T$562, DW_AT_name("macApiEvent_t")
    6873                            .dwattr $C$DW$T$562, DW_AT_type(*$C$DW$T$36)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  126

    6874                            .dwattr $C$DW$T$562, DW_AT_language(DW_LANG_C)
    6875                            .dwattr $C$DW$T$562, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6876                            .dwattr $C$DW$T$562, DW_AT_decl_line(0x171)
    6877                            .dwattr $C$DW$T$562, DW_AT_decl_column(0x03)
    6878                    
    6879                    
    6880                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6881                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    6882                    $C$DW$682       .dwtag  DW_TAG_member
    6883                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$37)
    6884                            .dwattr $C$DW$682, DW_AT_name("p")
    6885                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("p")
    6886                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6887                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6888                            .dwattr $C$DW$682, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    6889                            .dwattr $C$DW$682, DW_AT_decl_line(0x3d)
    6890                            .dwattr $C$DW$682, DW_AT_decl_column(0x0e)
    6891                    
    6892                    $C$DW$683       .dwtag  DW_TAG_member
    6893                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$27)
    6894                            .dwattr $C$DW$683, DW_AT_name("len")
    6895                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("len")
    6896                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6897                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6898                            .dwattr $C$DW$683, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Service
    6899                            .dwattr $C$DW$683, DW_AT_decl_line(0x3e)
    6900                            .dwattr $C$DW$683, DW_AT_decl_column(0x0e)
    6901                    
    6902                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    6903                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x3c)
    6904                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    6905                            .dwendtag $C$DW$T$38
    6906                    
    6907                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    6908                            .dwattr $C$DW$T$59, DW_AT_name("sData_t")
    6909                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$38)
    6910                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6911                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/CCSWorkspace/ECG603/sensor_cc1350lp/Application/Servic
    6912                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3f)
    6913                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    6914                    
    6915                    
    6916                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6917                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    6918                    $C$DW$684       .dwtag  DW_TAG_member
    6919                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$39)
    6920                            .dwattr $C$DW$684, DW_AT_name("lookupData")
    6921                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("lookupData")
    6922                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6923                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6924                            .dwattr $C$DW$684, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6925                            .dwattr $C$DW$684, DW_AT_decl_line(0x2c6)
    6926                            .dwattr $C$DW$684, DW_AT_decl_column(0x16)
    6927                    
    6928                    $C$DW$685       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  127

    6929                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$19)
    6930                            .dwattr $C$DW$685, DW_AT_name("lookupDataSize")
    6931                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("lookupDataSize")
    6932                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6933                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6934                            .dwattr $C$DW$685, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6935                            .dwattr $C$DW$685, DW_AT_decl_line(0x2c7)
    6936                            .dwattr $C$DW$685, DW_AT_decl_column(0x16)
    6937                    
    6938                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6939                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x2c5)
    6940                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    6941                            .dwendtag $C$DW$T$40
    6942                    
    6943                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    6944                            .dwattr $C$DW$T$43, DW_AT_name("keyIdLookupDescriptor_t")
    6945                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
    6946                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6947                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6948                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c8)
    6949                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    6950                    
    6951                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    6952                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6953                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    6954                    
    6955                    
    6956                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6957                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    6958                    $C$DW$686       .dwtag  DW_TAG_member
    6959                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$27)
    6960                            .dwattr $C$DW$686, DW_AT_name("deviceDescriptorHandle")
    6961                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    6962                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6963                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6964                            .dwattr $C$DW$686, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6965                            .dwattr $C$DW$686, DW_AT_decl_line(0x2cd)
    6966                            .dwattr $C$DW$686, DW_AT_decl_column(0x16)
    6967                    
    6968                    $C$DW$687       .dwtag  DW_TAG_member
    6969                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$28)
    6970                            .dwattr $C$DW$687, DW_AT_name("uniqueDevice")
    6971                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("uniqueDevice")
    6972                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6973                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6974                            .dwattr $C$DW$687, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6975                            .dwattr $C$DW$687, DW_AT_decl_line(0x2ce)
    6976                            .dwattr $C$DW$687, DW_AT_decl_column(0x16)
    6977                    
    6978                    $C$DW$688       .dwtag  DW_TAG_member
    6979                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$28)
    6980                            .dwattr $C$DW$688, DW_AT_name("blackListed")
    6981                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("blackListed")
    6982                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6983                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  128

    6984                            .dwattr $C$DW$688, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6985                            .dwattr $C$DW$688, DW_AT_decl_line(0x2cf)
    6986                            .dwattr $C$DW$688, DW_AT_decl_column(0x16)
    6987                    
    6988                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6989                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2cc)
    6990                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6991                            .dwendtag $C$DW$T$41
    6992                    
    6993                    $C$DW$T$45      .dwtag  DW_TAG_typedef
    6994                            .dwattr $C$DW$T$45, DW_AT_name("keyDeviceDescriptor_t")
    6995                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    6996                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6997                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6998                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2d0)
    6999                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    7000                    
    7001                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7002                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    7003                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    7004                    
    7005                    
    7006                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7007                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    7008                    $C$DW$689       .dwtag  DW_TAG_member
    7009                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$19)
    7010                            .dwattr $C$DW$689, DW_AT_name("frameType")
    7011                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("frameType")
    7012                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7013                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7014                            .dwattr $C$DW$689, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7015                            .dwattr $C$DW$689, DW_AT_decl_line(0x2d5)
    7016                            .dwattr $C$DW$689, DW_AT_decl_column(0x16)
    7017                    
    7018                    $C$DW$690       .dwtag  DW_TAG_member
    7019                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$19)
    7020                            .dwattr $C$DW$690, DW_AT_name("cmdFrameId")
    7021                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("cmdFrameId")
    7022                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7023                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7024                            .dwattr $C$DW$690, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7025                            .dwattr $C$DW$690, DW_AT_decl_line(0x2d6)
    7026                            .dwattr $C$DW$690, DW_AT_decl_column(0x16)
    7027                    
    7028                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7029                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2d4)
    7030                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    7031                            .dwendtag $C$DW$T$42
    7032                    
    7033                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    7034                            .dwattr $C$DW$T$47, DW_AT_name("keyUsageDescriptor_t")
    7035                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$42)
    7036                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7037                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7038                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2d7)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  129

    7039                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    7040                    
    7041                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    7042                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    7043                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    7044                    
    7045                    
    7046                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7047                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x2c)
    7048                    $C$DW$691       .dwtag  DW_TAG_member
    7049                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$44)
    7050                            .dwattr $C$DW$691, DW_AT_name("keyIdLookupList")
    7051                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("keyIdLookupList")
    7052                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7053                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7054                            .dwattr $C$DW$691, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7055                            .dwattr $C$DW$691, DW_AT_decl_line(0x2dc)
    7056                            .dwattr $C$DW$691, DW_AT_decl_column(0x1d)
    7057                    
    7058                    $C$DW$692       .dwtag  DW_TAG_member
    7059                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$19)
    7060                            .dwattr $C$DW$692, DW_AT_name("keyIdLookupEntries")
    7061                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("keyIdLookupEntries")
    7062                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7063                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7064                            .dwattr $C$DW$692, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7065                            .dwattr $C$DW$692, DW_AT_decl_line(0x2dd)
    7066                            .dwattr $C$DW$692, DW_AT_decl_column(0x1c)
    7067                    
    7068                    $C$DW$693       .dwtag  DW_TAG_member
    7069                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$46)
    7070                            .dwattr $C$DW$693, DW_AT_name("keyDeviceList")
    7071                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("keyDeviceList")
    7072                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7073                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7074                            .dwattr $C$DW$693, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7075                            .dwattr $C$DW$693, DW_AT_decl_line(0x2df)
    7076                            .dwattr $C$DW$693, DW_AT_decl_column(0x1d)
    7077                    
    7078                    $C$DW$694       .dwtag  DW_TAG_member
    7079                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$27)
    7080                            .dwattr $C$DW$694, DW_AT_name("keyDeviceListEntries")
    7081                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("keyDeviceListEntries")
    7082                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7083                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7084                            .dwattr $C$DW$694, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7085                            .dwattr $C$DW$694, DW_AT_decl_line(0x2e2)
    7086                            .dwattr $C$DW$694, DW_AT_decl_column(0x1d)
    7087                    
    7088                    $C$DW$695       .dwtag  DW_TAG_member
    7089                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$48)
    7090                            .dwattr $C$DW$695, DW_AT_name("keyUsageList")
    7091                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("keyUsageList")
    7092                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7093                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  130

    7094                            .dwattr $C$DW$695, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7095                            .dwattr $C$DW$695, DW_AT_decl_line(0x2e4)
    7096                            .dwattr $C$DW$695, DW_AT_decl_column(0x1d)
    7097                    
    7098                    $C$DW$696       .dwtag  DW_TAG_member
    7099                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$19)
    7100                            .dwattr $C$DW$696, DW_AT_name("keyUsageListEntries")
    7101                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("keyUsageListEntries")
    7102                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7103                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7104                            .dwattr $C$DW$696, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7105                            .dwattr $C$DW$696, DW_AT_decl_line(0x2e6)
    7106                            .dwattr $C$DW$696, DW_AT_decl_column(0x1c)
    7107                    
    7108                    $C$DW$697       .dwtag  DW_TAG_member
    7109                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$49)
    7110                            .dwattr $C$DW$697, DW_AT_name("key")
    7111                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("key")
    7112                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7113                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7114                            .dwattr $C$DW$697, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7115                            .dwattr $C$DW$697, DW_AT_decl_line(0x2e8)
    7116                            .dwattr $C$DW$697, DW_AT_decl_column(0x1c)
    7117                    
    7118                    $C$DW$698       .dwtag  DW_TAG_member
    7119                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$29)
    7120                            .dwattr $C$DW$698, DW_AT_name("frameCounter")
    7121                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("frameCounter")
    7122                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7123                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7124                            .dwattr $C$DW$698, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7125                            .dwattr $C$DW$698, DW_AT_decl_line(0x2e9)
    7126                            .dwattr $C$DW$698, DW_AT_decl_column(0x1c)
    7127                    
    7128                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7129                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2db)
    7130                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    7131                            .dwendtag $C$DW$T$50
    7132                    
    7133                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    7134                            .dwattr $C$DW$T$52, DW_AT_name("keyDescriptor_t")
    7135                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
    7136                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7137                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7138                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2ec)
    7139                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    7140                    
    7141                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    7142                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    7143                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    7144                    
    7145                    
    7146                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    7147                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x78)
    7148                    $C$DW$699       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  131

    7149                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$29)
    7150                            .dwattr $C$DW$699, DW_AT_name("timestamp")
    7151                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("timestamp")
    7152                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7153                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7154                            .dwattr $C$DW$699, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7155                            .dwattr $C$DW$699, DW_AT_decl_line(0x356)
    7156                            .dwattr $C$DW$699, DW_AT_decl_column(0x19)
    7157                    
    7158                    $C$DW$700       .dwtag  DW_TAG_member
    7159                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$27)
    7160                            .dwattr $C$DW$700, DW_AT_name("timestamp2")
    7161                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("timestamp2")
    7162                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7163                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7164                            .dwattr $C$DW$700, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7165                            .dwattr $C$DW$700, DW_AT_decl_line(0x357)
    7166                            .dwattr $C$DW$700, DW_AT_decl_column(0x19)
    7167                    
    7168                    $C$DW$701       .dwtag  DW_TAG_member
    7169                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$27)
    7170                            .dwattr $C$DW$701, DW_AT_name("timeToLive")
    7171                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("timeToLive")
    7172                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7173                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7174                            .dwattr $C$DW$701, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7175                            .dwattr $C$DW$701, DW_AT_decl_line(0x358)
    7176                            .dwattr $C$DW$701, DW_AT_decl_column(0x19)
    7177                    
    7178                    $C$DW$702       .dwtag  DW_TAG_member
    7179                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$19)
    7180                            .dwattr $C$DW$702, DW_AT_name("frameType")
    7181                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("frameType")
    7182                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7183                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7184                            .dwattr $C$DW$702, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7185                            .dwattr $C$DW$702, DW_AT_decl_line(0x359)
    7186                            .dwattr $C$DW$702, DW_AT_decl_column(0x19)
    7187                    
    7188                    $C$DW$703       .dwtag  DW_TAG_member
    7189                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$27)
    7190                            .dwattr $C$DW$703, DW_AT_name("txOptions")
    7191                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("txOptions")
    7192                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7193                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7194                            .dwattr $C$DW$703, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7195                            .dwattr $C$DW$703, DW_AT_decl_line(0x35a)
    7196                            .dwattr $C$DW$703, DW_AT_decl_column(0x19)
    7197                    
    7198                    $C$DW$704       .dwtag  DW_TAG_member
    7199                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$19)
    7200                            .dwattr $C$DW$704, DW_AT_name("txMode")
    7201                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("txMode")
    7202                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7203                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  132

    7204                            .dwattr $C$DW$704, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7205                            .dwattr $C$DW$704, DW_AT_decl_line(0x35b)
    7206                            .dwattr $C$DW$704, DW_AT_decl_column(0x19)
    7207                    
    7208                    $C$DW$705       .dwtag  DW_TAG_member
    7209                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$19)
    7210                            .dwattr $C$DW$705, DW_AT_name("txSched")
    7211                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("txSched")
    7212                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7213                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7214                            .dwattr $C$DW$705, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7215                            .dwattr $C$DW$705, DW_AT_decl_line(0x35c)
    7216                            .dwattr $C$DW$705, DW_AT_decl_column(0x19)
    7217                    
    7218                    $C$DW$706       .dwtag  DW_TAG_member
    7219                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$19)
    7220                            .dwattr $C$DW$706, DW_AT_name("retries")
    7221                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("retries")
    7222                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7223                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7224                            .dwattr $C$DW$706, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7225                            .dwattr $C$DW$706, DW_AT_decl_line(0x35d)
    7226                            .dwattr $C$DW$706, DW_AT_decl_column(0x19)
    7227                    
    7228                    $C$DW$707       .dwtag  DW_TAG_member
    7229                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$19)
    7230                            .dwattr $C$DW$707, DW_AT_name("channel")
    7231                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("channel")
    7232                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7233                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7234                            .dwattr $C$DW$707, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7235                            .dwattr $C$DW$707, DW_AT_decl_line(0x35e)
    7236                            .dwattr $C$DW$707, DW_AT_decl_column(0x19)
    7237                    
    7238                    $C$DW$708       .dwtag  DW_TAG_member
    7239                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$19)
    7240                            .dwattr $C$DW$708, DW_AT_name("power")
    7241                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("power")
    7242                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7243                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7244                            .dwattr $C$DW$708, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7245                            .dwattr $C$DW$708, DW_AT_decl_line(0x35f)
    7246                            .dwattr $C$DW$708, DW_AT_decl_column(0x19)
    7247                    
    7248                    $C$DW$709       .dwtag  DW_TAG_member
    7249                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$19)
    7250                            .dwattr $C$DW$709, DW_AT_name("mpduLinkQuality")
    7251                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("mpduLinkQuality")
    7252                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7253                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7254                            .dwattr $C$DW$709, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7255                            .dwattr $C$DW$709, DW_AT_decl_line(0x360)
    7256                            .dwattr $C$DW$709, DW_AT_decl_column(0x19)
    7257                    
    7258                    $C$DW$710       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  133

    7259                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$19)
    7260                            .dwattr $C$DW$710, DW_AT_name("correlation")
    7261                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("correlation")
    7262                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7263                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7264                            .dwattr $C$DW$710, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7265                            .dwattr $C$DW$710, DW_AT_decl_line(0x361)
    7266                            .dwattr $C$DW$710, DW_AT_decl_column(0x19)
    7267                    
    7268                    $C$DW$711       .dwtag  DW_TAG_member
    7269                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$51)
    7270                            .dwattr $C$DW$711, DW_AT_name("rssi")
    7271                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("rssi")
    7272                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7273                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7274                            .dwattr $C$DW$711, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7275                            .dwattr $C$DW$711, DW_AT_decl_line(0x362)
    7276                            .dwattr $C$DW$711, DW_AT_decl_column(0x19)
    7277                    
    7278                    $C$DW$712       .dwtag  DW_TAG_member
    7279                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$37)
    7280                            .dwattr $C$DW$712, DW_AT_name("ptrMData")
    7281                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("ptrMData")
    7282                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7283                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7284                            .dwattr $C$DW$712, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7285                            .dwattr $C$DW$712, DW_AT_decl_line(0x364)
    7286                            .dwattr $C$DW$712, DW_AT_decl_column(0x19)
    7287                    
    7288                    $C$DW$713       .dwtag  DW_TAG_member
    7289                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$53)
    7290                            .dwattr $C$DW$713, DW_AT_name("pKeyDesc")
    7291                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("pKeyDesc")
    7292                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7293                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7294                            .dwattr $C$DW$713, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7295                            .dwattr $C$DW$713, DW_AT_decl_line(0x365)
    7296                            .dwattr $C$DW$713, DW_AT_decl_column(0x19)
    7297                    
    7298                    $C$DW$714       .dwtag  DW_TAG_member
    7299                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$29)
    7300                            .dwattr $C$DW$714, DW_AT_name("frameCntr")
    7301                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("frameCntr")
    7302                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7303                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7304                            .dwattr $C$DW$714, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7305                            .dwattr $C$DW$714, DW_AT_decl_line(0x366)
    7306                            .dwattr $C$DW$714, DW_AT_decl_column(0x19)
    7307                    
    7308                    $C$DW$715       .dwtag  DW_TAG_member
    7309                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$55)
    7310                            .dwattr $C$DW$715, DW_AT_name("payloadIeInfo")
    7311                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("payloadIeInfo")
    7312                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7313                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  134

    7314                            .dwattr $C$DW$715, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7315                            .dwattr $C$DW$715, DW_AT_decl_line(0x368)
    7316                            .dwattr $C$DW$715, DW_AT_decl_column(0x19)
    7317                    
    7318                    $C$DW$716       .dwtag  DW_TAG_member
    7319                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$57)
    7320                            .dwattr $C$DW$716, DW_AT_name("headerIeInfo")
    7321                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("headerIeInfo")
    7322                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7323                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7324                            .dwattr $C$DW$716, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7325                            .dwattr $C$DW$716, DW_AT_decl_line(0x369)
    7326                            .dwattr $C$DW$716, DW_AT_decl_column(0x19)
    7327                    
    7328                    $C$DW$717       .dwtag  DW_TAG_member
    7329                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$27)
    7330                            .dwattr $C$DW$717, DW_AT_name("totalLen")
    7331                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("totalLen")
    7332                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7333                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7334                            .dwattr $C$DW$717, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7335                            .dwattr $C$DW$717, DW_AT_decl_line(0x36a)
    7336                            .dwattr $C$DW$717, DW_AT_decl_column(0x19)
    7337                    
    7338                    $C$DW$718       .dwtag  DW_TAG_member
    7339                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$37)
    7340                            .dwattr $C$DW$718, DW_AT_name("ptrHeaderIE")
    7341                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("ptrHeaderIE")
    7342                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7343                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7344                            .dwattr $C$DW$718, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7345                            .dwattr $C$DW$718, DW_AT_decl_line(0x36b)
    7346                            .dwattr $C$DW$718, DW_AT_decl_column(0x19)
    7347                    
    7348                    $C$DW$719       .dwtag  DW_TAG_member
    7349                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$27)
    7350                            .dwattr $C$DW$719, DW_AT_name("headerIesLen")
    7351                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("headerIesLen")
    7352                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7353                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7354                            .dwattr $C$DW$719, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7355                            .dwattr $C$DW$719, DW_AT_decl_line(0x36c)
    7356                            .dwattr $C$DW$719, DW_AT_decl_column(0x19)
    7357                    
    7358                    $C$DW$720       .dwtag  DW_TAG_member
    7359                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$37)
    7360                            .dwattr $C$DW$720, DW_AT_name("ptrPayloadIE")
    7361                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("ptrPayloadIE")
    7362                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7363                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7364                            .dwattr $C$DW$720, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7365                            .dwattr $C$DW$720, DW_AT_decl_line(0x36d)
    7366                            .dwattr $C$DW$720, DW_AT_decl_column(0x19)
    7367                    
    7368                    $C$DW$721       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  135

    7369                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$37)
    7370                            .dwattr $C$DW$721, DW_AT_name("ptrUTIE")
    7371                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("ptrUTIE")
    7372                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7373                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7374                            .dwattr $C$DW$721, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7375                            .dwattr $C$DW$721, DW_AT_decl_line(0x36e)
    7376                            .dwattr $C$DW$721, DW_AT_decl_column(0x19)
    7377                    
    7378                    $C$DW$722       .dwtag  DW_TAG_member
    7379                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$37)
    7380                            .dwattr $C$DW$722, DW_AT_name("ptrBTIE")
    7381                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("ptrBTIE")
    7382                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    7383                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7384                            .dwattr $C$DW$722, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7385                            .dwattr $C$DW$722, DW_AT_decl_line(0x36f)
    7386                            .dwattr $C$DW$722, DW_AT_decl_column(0x19)
    7387                    
    7388                    $C$DW$723       .dwtag  DW_TAG_member
    7389                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$37)
    7390                            .dwattr $C$DW$723, DW_AT_name("ptrFrameCnt")
    7391                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("ptrFrameCnt")
    7392                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7393                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7394                            .dwattr $C$DW$723, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7395                            .dwattr $C$DW$723, DW_AT_decl_line(0x370)
    7396                            .dwattr $C$DW$723, DW_AT_decl_column(0x19)
    7397                    
    7398                    $C$DW$724       .dwtag  DW_TAG_member
    7399                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$19)
    7400                            .dwattr $C$DW$724, DW_AT_name("rsl")
    7401                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("rsl")
    7402                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7403                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7404                            .dwattr $C$DW$724, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7405                            .dwattr $C$DW$724, DW_AT_decl_line(0x371)
    7406                            .dwattr $C$DW$724, DW_AT_decl_column(0x19)
    7407                    
    7408                    $C$DW$725       .dwtag  DW_TAG_member
    7409                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$19)
    7410                            .dwattr $C$DW$725, DW_AT_name("nb")
    7411                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("nb")
    7412                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    7413                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7414                            .dwattr $C$DW$725, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7415                            .dwattr $C$DW$725, DW_AT_decl_line(0x372)
    7416                            .dwattr $C$DW$725, DW_AT_decl_column(0x19)
    7417                    
    7418                    $C$DW$726       .dwtag  DW_TAG_member
    7419                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$19)
    7420                            .dwattr $C$DW$726, DW_AT_name("be")
    7421                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("be")
    7422                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7423                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  136

    7424                            .dwattr $C$DW$726, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7425                            .dwattr $C$DW$726, DW_AT_decl_line(0x373)
    7426                            .dwattr $C$DW$726, DW_AT_decl_column(0x19)
    7427                    
    7428                    $C$DW$727       .dwtag  DW_TAG_member
    7429                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$19)
    7430                            .dwattr $C$DW$727, DW_AT_name("fhFrameType")
    7431                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("fhFrameType")
    7432                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    7433                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7434                            .dwattr $C$DW$727, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7435                            .dwattr $C$DW$727, DW_AT_decl_line(0x374)
    7436                            .dwattr $C$DW$727, DW_AT_decl_column(0x19)
    7437                    
    7438                    $C$DW$728       .dwtag  DW_TAG_member
    7439                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$19)
    7440                            .dwattr $C$DW$728, DW_AT_name("gpDuration")
    7441                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("gpDuration")
    7442                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7443                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7444                            .dwattr $C$DW$728, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7445                            .dwattr $C$DW$728, DW_AT_decl_line(0x375)
    7446                            .dwattr $C$DW$728, DW_AT_decl_column(0x19)
    7447                    
    7448                    $C$DW$729       .dwtag  DW_TAG_member
    7449                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$19)
    7450                            .dwattr $C$DW$729, DW_AT_name("gpNumOfTx")
    7451                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("gpNumOfTx")
    7452                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    7453                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7454                            .dwattr $C$DW$729, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7455                            .dwattr $C$DW$729, DW_AT_decl_line(0x376)
    7456                            .dwattr $C$DW$729, DW_AT_decl_column(0x19)
    7457                    
    7458                    $C$DW$730       .dwtag  DW_TAG_member
    7459                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$19)
    7460                            .dwattr $C$DW$730, DW_AT_name("gpInterframeDelay")
    7461                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("gpInterframeDelay")
    7462                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7463                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7464                            .dwattr $C$DW$730, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7465                            .dwattr $C$DW$730, DW_AT_decl_line(0x377)
    7466                            .dwattr $C$DW$730, DW_AT_decl_column(0x19)
    7467                    
    7468                    $C$DW$731       .dwtag  DW_TAG_member
    7469                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$557)
    7470                            .dwattr $C$DW$731, DW_AT_name("dest")
    7471                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("dest")
    7472                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    7473                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7474                            .dwattr $C$DW$731, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7475                            .dwattr $C$DW$731, DW_AT_decl_line(0x37d)
    7476                            .dwattr $C$DW$731, DW_AT_decl_column(0x05)
    7477                    
    7478                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:54 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{2C8978D1-F7D9-4E82-B60C-E020EAD6637E} PAGE  137

    7479                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x355)
    7480                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    7481                            .dwendtag $C$DW$T$58
    7482                    
    7483                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    7484                            .dwattr $C$DW$T$60, DW_AT_name("macTxIntData_t")
    7485                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    7486                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7487                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7488                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x37e)
    7489                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    7490                    
    7491                    
    7492                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    7493                            .dwattr $C$DW$T$61, DW_AT_byte_size(0xa4)
    7494                    $C$DW$732       .dwtag  DW_TAG_member
    7495                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$35)
    7496                            .dwattr $C$DW$732, DW_AT_name("hdr")
    7497                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("hdr")
    7498                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7499                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7500                            .dwattr $C$DW$732, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7501                            .dwattr $C$DW$732, DW_AT_decl_line(0x150)
    7502                            .dwattr $C$DW$732, DW_AT_decl_column(0x1f)
    7503                    
    7504                    $C$DW$733       .dwtag  DW_TAG_member
    7505                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$59)
    7506                            .dwattr $C$DW$733, DW_AT_name("mpdu")
    7507                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("mpdu")
    7508                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7509                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7510                            .dwattr $C$DW$733, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7511                            .dwattr $C$DW$733, DW_AT_decl_line(0x151)
    7512                            .dwattr $C$DW$733, DW_AT_decl_column(0x1f)
    7513                    
    7514                    $C$DW$734       .dwtag  DW_TAG_member
    7515                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$60)
    7516                            .dwattr $C$DW$734, DW_AT_name("internal")
    7517                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("internal")
    7518                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7519                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7520                            .dwattr $C$DW$734, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7521                            .dwattr $C$DW$734, DW_AT_decl_line(0x152)
    7522                            .dwattr $C$DW$734, DW_AT_decl_column(0x1f)
    7523                    
    7524                    $C$DW$735       .dwtag  DW_TAG_member
    7525                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$558)
    7526                            .dwattr $C$DW$735, DW_AT_name("mac")
    7527                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("mac")
    7528                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7529                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7530                            .dwattr $C$DW$735, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
