TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 17:19:53 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1929                    
    1930                    $C$DW$T$177     .dwtag  DW_TAG_typedef
    1931                            .dwattr $C$DW$T$177, DW_AT_name("tFlashStateCommandsType")
    1932                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    1933                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    1934                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1935                            .dwattr $C$DW$T$177, DW_AT_decl_line(0xb0)
    1936                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    1937                    
    1938                    
    1939                    $C$DW$T$178     .dwtag  DW_TAG_enumeration_type
    1940                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    1941                    $C$DW$118       .dwtag  DW_TAG_enumerator
    1942                            .dwattr $C$DW$118, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1943                            .dwattr $C$DW$118, DW_AT_const_value(0xe0)
    1944                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1945                            .dwattr $C$DW$118, DW_AT_decl_line(0x3de)
    1946                            .dwattr $C$DW$118, DW_AT_decl_column(0x04)
    1947                    
    1948                    $C$DW$119       .dwtag  DW_TAG_enumerator
    1949                            .dwattr $C$DW$119, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1950                            .dwattr $C$DW$119, DW_AT_const_value(0xe1)
    1951                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1952                            .dwattr $C$DW$119, DW_AT_decl_line(0x3e0)
    1953                            .dwattr $C$DW$119, DW_AT_decl_column(0x04)
    1954                    
    1955                    $C$DW$120       .dwtag  DW_TAG_enumerator
    1956                            .dwattr $C$DW$120, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1957                            .dwattr $C$DW$120, DW_AT_const_value(0xe2)
    1958                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1959                            .dwattr $C$DW$120, DW_AT_decl_line(0x3e2)
    1960                            .dwattr $C$DW$120, DW_AT_decl_column(0x04)
    1961                    
    1962                    $C$DW$121       .dwtag  DW_TAG_enumerator
    1963                            .dwattr $C$DW$121, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1964                            .dwattr $C$DW$121, DW_AT_const_value(0xe3)
    1965                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1966                            .dwattr $C$DW$121, DW_AT_decl_line(0x3e4)
    1967                            .dwattr $C$DW$121, DW_AT_decl_column(0x04)
    1968                    
    1969                    $C$DW$122       .dwtag  DW_TAG_enumerator
    1970                            .dwattr $C$DW$122, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   37

    1971                            .dwattr $C$DW$122, DW_AT_const_value(0xe4)
    1972                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1973                            .dwattr $C$DW$122, DW_AT_decl_line(0x3e6)
    1974                            .dwattr $C$DW$122, DW_AT_decl_column(0x04)
    1975                    
    1976                    $C$DW$123       .dwtag  DW_TAG_enumerator
    1977                            .dwattr $C$DW$123, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1978                            .dwattr $C$DW$123, DW_AT_const_value(0xe5)
    1979                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1980                            .dwattr $C$DW$123, DW_AT_decl_line(0x3e8)
    1981                            .dwattr $C$DW$123, DW_AT_decl_column(0x04)
    1982                    
    1983                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1984                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x3dc)
    1985                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x01)
    1986                            .dwendtag $C$DW$T$178
    1987                    
    1988                    $C$DW$T$179     .dwtag  DW_TAG_typedef
    1989                            .dwattr $C$DW$T$179, DW_AT_name("ICall_RemotiCmdEvent_t")
    1990                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    1991                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1992                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1993                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x3e9)
    1994                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x02)
    1995                    
    1996                    
    1997                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1998                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    1999                    $C$DW$124       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$3)
    2001                            .dwattr $C$DW$124, DW_AT_name("next")
    2002                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("next")
    2003                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$124, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2006                            .dwattr $C$DW$124, DW_AT_decl_line(0x4d)
    2007                            .dwattr $C$DW$124, DW_AT_decl_column(0x0b)
    2008                    
    2009                    $C$DW$125       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2011                            .dwattr $C$DW$125, DW_AT_name("timeout")
    2012                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("timeout")
    2013                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2014                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$125, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2016                            .dwattr $C$DW$125, DW_AT_decl_line(0x4e)
    2017                            .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    2018                    
    2019                    $C$DW$126       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    2021                            .dwattr $C$DW$126, DW_AT_name("event_flag")
    2022                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("event_flag")
    2023                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2024                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$126, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   38

    2026                            .dwattr $C$DW$126, DW_AT_decl_line(0x4f)
    2027                            .dwattr $C$DW$126, DW_AT_decl_column(0x0a)
    2028                    
    2029                    $C$DW$127       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    2031                            .dwattr $C$DW$127, DW_AT_name("task_id")
    2032                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("task_id")
    2033                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2034                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2035                            .dwattr $C$DW$127, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2036                            .dwattr $C$DW$127, DW_AT_decl_line(0x50)
    2037                            .dwattr $C$DW$127, DW_AT_decl_column(0x0a)
    2038                    
    2039                    $C$DW$128       .dwtag  DW_TAG_member
    2040                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$22)
    2041                            .dwattr $C$DW$128, DW_AT_name("reloadTimeout")
    2042                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("reloadTimeout")
    2043                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2044                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2045                            .dwattr $C$DW$128, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2046                            .dwattr $C$DW$128, DW_AT_decl_line(0x51)
    2047                            .dwattr $C$DW$128, DW_AT_decl_column(0x0a)
    2048                    
    2049                            .dwattr $C$DW$T$23, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2050                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4c)
    2051                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    2052                            .dwendtag $C$DW$T$23
    2053                    
    2054                    $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    2055                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$23)
    2056                            .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    2057                    
    2058                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    2059                            .dwattr $C$DW$T$186, DW_AT_name("osalTimerRec_t")
    2060                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$23)
    2061                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    2062                            .dwattr $C$DW$T$186, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2063                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x52)
    2064                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    2065                    
    2066                    $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    2067                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    2068                            .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    2069                    
    2070                    $C$DW$T$190     .dwtag  DW_TAG_const_type
    2071                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$187)
    2072                    
    2073                    
    2074                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    2075                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x4c)
    2076                    $C$DW$129       .dwtag  DW_TAG_member
    2077                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    2078                            .dwattr $C$DW$129, DW_AT_name("Crc32")
    2079                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("Crc32")
    2080                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   39

    2081                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2082                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2083                            .dwattr $C$DW$129, DW_AT_decl_line(0x76)
    2084                            .dwattr $C$DW$129, DW_AT_decl_column(0x25)
    2085                    
    2086                    $C$DW$130       .dwtag  DW_TAG_member
    2087                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    2088                            .dwattr $C$DW$130, DW_AT_name("FlashGetSize")
    2089                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("FlashGetSize")
    2090                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2091                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2092                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2093                            .dwattr $C$DW$130, DW_AT_decl_line(0x77)
    2094                            .dwattr $C$DW$130, DW_AT_decl_column(0x25)
    2095                    
    2096                    $C$DW$131       .dwtag  DW_TAG_member
    2097                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    2098                            .dwattr $C$DW$131, DW_AT_name("GetChipId")
    2099                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("GetChipId")
    2100                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2101                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2102                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2103                            .dwattr $C$DW$131, DW_AT_decl_line(0x78)
    2104                            .dwattr $C$DW$131, DW_AT_decl_column(0x25)
    2105                    
    2106                    $C$DW$132       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$36)
    2108                            .dwattr $C$DW$132, DW_AT_name("ReservedLocation1")
    2109                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("ReservedLocation1")
    2110                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2111                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2112                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2113                            .dwattr $C$DW$132, DW_AT_decl_line(0x79)
    2114                            .dwattr $C$DW$132, DW_AT_decl_column(0x25)
    2115                    
    2116                    $C$DW$133       .dwtag  DW_TAG_member
    2117                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$37)
    2118                            .dwattr $C$DW$133, DW_AT_name("ReservedLocation2")
    2119                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ReservedLocation2")
    2120                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2121                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2122                            .dwattr $C$DW$133, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2123                            .dwattr $C$DW$133, DW_AT_decl_line(0x7a)
    2124                            .dwattr $C$DW$133, DW_AT_decl_column(0x25)
    2125                    
    2126                    $C$DW$134       .dwtag  DW_TAG_member
    2127                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$38)
    2128                            .dwattr $C$DW$134, DW_AT_name("ReservedLocation3")
    2129                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ReservedLocation3")
    2130                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2131                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2132                            .dwattr $C$DW$134, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2133                            .dwattr $C$DW$134, DW_AT_decl_line(0x7b)
    2134                            .dwattr $C$DW$134, DW_AT_decl_column(0x25)
    2135                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   40

    2136                    $C$DW$135       .dwtag  DW_TAG_member
    2137                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$41)
    2138                            .dwattr $C$DW$135, DW_AT_name("ResetDevice")
    2139                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("ResetDevice")
    2140                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2141                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2142                            .dwattr $C$DW$135, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2143                            .dwattr $C$DW$135, DW_AT_decl_line(0x7c)
    2144                            .dwattr $C$DW$135, DW_AT_decl_column(0x25)
    2145                    
    2146                    $C$DW$136       .dwtag  DW_TAG_member
    2147                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$46)
    2148                            .dwattr $C$DW$136, DW_AT_name("Fletcher32")
    2149                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("Fletcher32")
    2150                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2151                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2152                            .dwattr $C$DW$136, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2153                            .dwattr $C$DW$136, DW_AT_decl_line(0x7d)
    2154                            .dwattr $C$DW$136, DW_AT_decl_column(0x25)
    2155                    
    2156                    $C$DW$137       .dwtag  DW_TAG_member
    2157                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$50)
    2158                            .dwattr $C$DW$137, DW_AT_name("MinValue")
    2159                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("MinValue")
    2160                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2161                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2162                            .dwattr $C$DW$137, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2163                            .dwattr $C$DW$137, DW_AT_decl_line(0x7e)
    2164                            .dwattr $C$DW$137, DW_AT_decl_column(0x25)
    2165                    
    2166                    $C$DW$138       .dwtag  DW_TAG_member
    2167                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$51)
    2168                            .dwattr $C$DW$138, DW_AT_name("MaxValue")
    2169                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("MaxValue")
    2170                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2171                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2172                            .dwattr $C$DW$138, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2173                            .dwattr $C$DW$138, DW_AT_decl_line(0x7f)
    2174                            .dwattr $C$DW$138, DW_AT_decl_column(0x25)
    2175                    
    2176                    $C$DW$139       .dwtag  DW_TAG_member
    2177                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$52)
    2178                            .dwattr $C$DW$139, DW_AT_name("MeanValue")
    2179                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("MeanValue")
    2180                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2181                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2182                            .dwattr $C$DW$139, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2183                            .dwattr $C$DW$139, DW_AT_decl_line(0x80)
    2184                            .dwattr $C$DW$139, DW_AT_decl_column(0x25)
    2185                    
    2186                    $C$DW$140       .dwtag  DW_TAG_member
    2187                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$53)
    2188                            .dwattr $C$DW$140, DW_AT_name("StandDeviationValue")
    2189                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("StandDeviationValue")
    2190                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   41

    2191                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2192                            .dwattr $C$DW$140, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2193                            .dwattr $C$DW$140, DW_AT_decl_line(0x81)
    2194                            .dwattr $C$DW$140, DW_AT_decl_column(0x25)
    2195                    
    2196                    $C$DW$141       .dwtag  DW_TAG_member
    2197                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$56)
    2198                            .dwattr $C$DW$141, DW_AT_name("ReservedLocation4")
    2199                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("ReservedLocation4")
    2200                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2201                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2202                            .dwattr $C$DW$141, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2203                            .dwattr $C$DW$141, DW_AT_decl_line(0x82)
    2204                            .dwattr $C$DW$141, DW_AT_decl_column(0x25)
    2205                    
    2206                    $C$DW$142       .dwtag  DW_TAG_member
    2207                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$57)
    2208                            .dwattr $C$DW$142, DW_AT_name("ReservedLocation5")
    2209                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("ReservedLocation5")
    2210                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2211                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2212                            .dwattr $C$DW$142, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2213                            .dwattr $C$DW$142, DW_AT_decl_line(0x83)
    2214                            .dwattr $C$DW$142, DW_AT_decl_column(0x25)
    2215                    
    2216                    $C$DW$143       .dwtag  DW_TAG_member
    2217                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$58)
    2218                            .dwattr $C$DW$143, DW_AT_name("HFSourceSafeSwitch")
    2219                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    2220                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2221                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2222                            .dwattr $C$DW$143, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2223                            .dwattr $C$DW$143, DW_AT_decl_line(0x84)
    2224                            .dwattr $C$DW$143, DW_AT_decl_column(0x25)
    2225                    
    2226                    $C$DW$144       .dwtag  DW_TAG_member
    2227                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$61)
    2228                            .dwattr $C$DW$144, DW_AT_name("SelectCompAInput")
    2229                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("SelectCompAInput")
    2230                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2231                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2232                            .dwattr $C$DW$144, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2233                            .dwattr $C$DW$144, DW_AT_decl_line(0x85)
    2234                            .dwattr $C$DW$144, DW_AT_decl_column(0x25)
    2235                    
    2236                    $C$DW$145       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$62)
    2238                            .dwattr $C$DW$145, DW_AT_name("SelectCompARef")
    2239                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("SelectCompARef")
    2240                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2241                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$145, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2243                            .dwattr $C$DW$145, DW_AT_decl_line(0x86)
    2244                            .dwattr $C$DW$145, DW_AT_decl_column(0x25)
    2245                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   42

    2246                    $C$DW$146       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$63)
    2248                            .dwattr $C$DW$146, DW_AT_name("SelectADCCompBInput")
    2249                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("SelectADCCompBInput")
    2250                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2251                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$146, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2253                            .dwattr $C$DW$146, DW_AT_decl_line(0x87)
    2254                            .dwattr $C$DW$146, DW_AT_decl_column(0x25)
    2255                    
    2256                    $C$DW$147       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$64)
    2258                            .dwattr $C$DW$147, DW_AT_name("SelectCompBRef")
    2259                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("SelectCompBRef")
    2260                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2261                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$147, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    2263                            .dwattr $C$DW$147, DW_AT_decl_line(0x88)
    2264                            .dwattr $C$DW$147, DW_AT_decl_column(0x25)
    2265                    
    2266                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    2267                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x75)
    2268                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
    2269                            .dwendtag $C$DW$T$65
    2270                    
    2271                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    2272                            .dwattr $C$DW$T$191, DW_AT_name("HARD_API_T")
    2273                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$65)
    2274                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    2275                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    2276                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x89)
    2277                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
    2278                    
    2279                    
    2280                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    2281                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x08)
    2282                    $C$DW$148       .dwtag  DW_TAG_member
    2283                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$10)
    2284                            .dwattr $C$DW$148, DW_AT_name("quot")
    2285                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("quot")
    2286                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2288                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    2289                            .dwattr $C$DW$148, DW_AT_decl_line(0x5c)
    2290                            .dwattr $C$DW$148, DW_AT_decl_column(0x16)
    2291                    
    2292                    $C$DW$149       .dwtag  DW_TAG_member
    2293                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$10)
    2294                            .dwattr $C$DW$149, DW_AT_name("rem")
    2295                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("rem")
    2296                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2297                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2298                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    2299                            .dwattr $C$DW$149, DW_AT_decl_line(0x5c)
    2300                            .dwattr $C$DW$149, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   43

    2301                    
    2302                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    2303                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x5c)
    2304                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    2305                            .dwendtag $C$DW$T$66
    2306                    
    2307                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    2308                            .dwattr $C$DW$T$192, DW_AT_name("div_t")
    2309                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$66)
    2310                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    2311                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    2312                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x5c)
    2313                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x23)
    2314                    
    2315                    
    2316                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    2317                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
    2318                    $C$DW$150       .dwtag  DW_TAG_member
    2319                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2320                            .dwattr $C$DW$150, DW_AT_name("quot")
    2321                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("quot")
    2322                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2324                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    2325                            .dwattr $C$DW$150, DW_AT_decl_line(0x5e)
    2326                            .dwattr $C$DW$150, DW_AT_decl_column(0x16)
    2327                    
    2328                    $C$DW$151       .dwtag  DW_TAG_member
    2329                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2330                            .dwattr $C$DW$151, DW_AT_name("rem")
    2331                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("rem")
    2332                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2333                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2334                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    2335                            .dwattr $C$DW$151, DW_AT_decl_line(0x5e)
    2336                            .dwattr $C$DW$151, DW_AT_decl_column(0x1c)
    2337                    
    2338                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    2339                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x5e)
    2340                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x10)
    2341                            .dwendtag $C$DW$T$67
    2342                    
    2343                    $C$DW$T$193     .dwtag  DW_TAG_typedef
    2344                            .dwattr $C$DW$T$193, DW_AT_name("ldiv_t")
    2345                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$67)
    2346                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    2347                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    2348                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x5e)
    2349                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x23)
    2350                    
    2351                    
    2352                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    2353                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    2354                    $C$DW$152       .dwtag  DW_TAG_member
    2355                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   44

    2356                            .dwattr $C$DW$152, DW_AT_name("quot")
    2357                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("quot")
    2358                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2359                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2360                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    2361                            .dwattr $C$DW$152, DW_AT_decl_line(0x61)
    2362                            .dwattr $C$DW$152, DW_AT_decl_column(0x1c)
    2363                    
    2364                    $C$DW$153       .dwtag  DW_TAG_member
    2365                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$14)
    2366                            .dwattr $C$DW$153, DW_AT_name("rem")
    2367                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("rem")
    2368                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2369                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2370                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/s
    2371                            .dwattr $C$DW$153, DW_AT_decl_line(0x61)
    2372                            .dwattr $C$DW$153, DW_AT_decl_column(0x22)
    2373                    
    2374                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
    2375                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x61)
    2376                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    2377                            .dwendtag $C$DW$T$68
    2378                    
    2379                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    2380                            .dwattr $C$DW$T$194, DW_AT_name("lldiv_t")
    2381                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$68)
    2382                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    2383                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    2384                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x61)
    2385                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x29)
    2386                    
    2387                    
    2388                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    2389                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    2390                    $C$DW$154       .dwtag  DW_TAG_member
    2391                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$70)
    2392                            .dwattr $C$DW$154, DW_AT_name("pointerStack")
    2393                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("pointerStack")
    2394                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2395                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2396                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2397                            .dwattr $C$DW$154, DW_AT_decl_line(0x3f5)
    2398                            .dwattr $C$DW$154, DW_AT_decl_column(0x16)
    2399                    
    2400                    $C$DW$155       .dwtag  DW_TAG_member
    2401                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$71)
    2402                            .dwattr $C$DW$155, DW_AT_name("directAPI")
    2403                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("directAPI")
    2404                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2405                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2406                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2407                            .dwattr $C$DW$155, DW_AT_decl_line(0x3f6)
    2408                            .dwattr $C$DW$155, DW_AT_decl_column(0x15)
    2409                    
    2410                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   45

    2411                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3f4)
    2412                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    2413                            .dwendtag $C$DW$T$72
    2414                    
    2415                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    2416                            .dwattr $C$DW$T$74, DW_AT_name("icall_directAPIMsg_t")
    2417                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$72)
    2418                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2419                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2420                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x3f7)
    2421                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    2422                    
    2423                    
    2424                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
    2425                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x14)
    2426                    $C$DW$156       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$73)
    2428                            .dwattr $C$DW$156, DW_AT_name("hdr")
    2429                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("hdr")
    2430                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2433                            .dwattr $C$DW$156, DW_AT_decl_line(0x3fb)
    2434                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    2435                    
    2436                    $C$DW$157       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$74)
    2438                            .dwattr $C$DW$157, DW_AT_name("msg")
    2439                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("msg")
    2440                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2441                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2443                            .dwattr $C$DW$157, DW_AT_decl_line(0x3fc)
    2444                            .dwattr $C$DW$157, DW_AT_decl_column(0x1a)
    2445                    
    2446                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2447                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x3fa)
    2448                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
    2449                            .dwendtag $C$DW$T$75
    2450                    
    2451                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    2452                            .dwattr $C$DW$T$195, DW_AT_name("icallLiteMsg_t")
    2453                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$75)
    2454                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    2455                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2456                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x3fd)
    2457                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    2458                    
    2459                    
    2460                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    2461                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
    2462                    $C$DW$158       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$76)
    2464                            .dwattr $C$DW$158, DW_AT_name("bufferHead")
    2465                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("bufferHead")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   46

    2466                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2469                            .dwattr $C$DW$158, DW_AT_decl_line(0x80)
    2470                            .dwattr $C$DW$158, DW_AT_decl_column(0x13)
    2471                    
    2472                    $C$DW$159       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$76)
    2474                            .dwattr $C$DW$159, DW_AT_name("bufferTail")
    2475                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("bufferTail")
    2476                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2477                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2479                            .dwattr $C$DW$159, DW_AT_decl_line(0x81)
    2480                            .dwattr $C$DW$159, DW_AT_decl_column(0x13)
    2481                    
    2482                    $C$DW$160       .dwtag  DW_TAG_member
    2483                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2484                            .dwattr $C$DW$160, DW_AT_name("maxBufSize")
    2485                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("maxBufSize")
    2486                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2487                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2488                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2489                            .dwattr $C$DW$160, DW_AT_decl_line(0x82)
    2490                            .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2491                    
    2492                    $C$DW$161       .dwtag  DW_TAG_member
    2493                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$77)
    2494                            .dwattr $C$DW$161, DW_AT_name("pBuffer")
    2495                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pBuffer")
    2496                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2497                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2498                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2499                            .dwattr $C$DW$161, DW_AT_decl_line(0x83)
    2500                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2501                    
    2502                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2503                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x7e)
    2504                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    2505                            .dwendtag $C$DW$T$78
    2506                    
    2507                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    2508                            .dwattr $C$DW$T$80, DW_AT_name("halUARTBufControl_t")
    2509                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    2510                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2511                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2512                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x84)
    2513                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    2514                    
    2515                    
    2516                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    2517                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x2c)
    2518                    $C$DW$162       .dwtag  DW_TAG_member
    2519                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$79)
    2520                            .dwattr $C$DW$162, DW_AT_name("configured")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   47

    2521                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("configured")
    2522                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2525                            .dwattr $C$DW$162, DW_AT_decl_line(0x88)
    2526                            .dwattr $C$DW$162, DW_AT_decl_column(0x17)
    2527                    
    2528                    $C$DW$163       .dwtag  DW_TAG_member
    2529                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    2530                            .dwattr $C$DW$163, DW_AT_name("baudRate")
    2531                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("baudRate")
    2532                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2533                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2534                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2535                            .dwattr $C$DW$163, DW_AT_decl_line(0x89)
    2536                            .dwattr $C$DW$163, DW_AT_decl_column(0x17)
    2537                    
    2538                    $C$DW$164       .dwtag  DW_TAG_member
    2539                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$79)
    2540                            .dwattr $C$DW$164, DW_AT_name("flowControl")
    2541                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("flowControl")
    2542                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2543                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2545                            .dwattr $C$DW$164, DW_AT_decl_line(0x8a)
    2546                            .dwattr $C$DW$164, DW_AT_decl_column(0x17)
    2547                    
    2548                    $C$DW$165       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2550                            .dwattr $C$DW$165, DW_AT_name("flowControlThreshold")
    2551                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("flowControlThreshold")
    2552                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2553                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2555                            .dwattr $C$DW$165, DW_AT_decl_line(0x8b)
    2556                            .dwattr $C$DW$165, DW_AT_decl_column(0x17)
    2557                    
    2558                    $C$DW$166       .dwtag  DW_TAG_member
    2559                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2560                            .dwattr $C$DW$166, DW_AT_name("idleTimeout")
    2561                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("idleTimeout")
    2562                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2563                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2564                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2565                            .dwattr $C$DW$166, DW_AT_decl_line(0x8c)
    2566                            .dwattr $C$DW$166, DW_AT_decl_column(0x17)
    2567                    
    2568                    $C$DW$167       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$80)
    2570                            .dwattr $C$DW$167, DW_AT_name("rx")
    2571                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("rx")
    2572                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2573                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2575                            .dwattr $C$DW$167, DW_AT_decl_line(0x8d)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   48

    2576                            .dwattr $C$DW$167, DW_AT_decl_column(0x17)
    2577                    
    2578                    $C$DW$168       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$80)
    2580                            .dwattr $C$DW$168, DW_AT_name("tx")
    2581                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("tx")
    2582                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2583                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2585                            .dwattr $C$DW$168, DW_AT_decl_line(0x8e)
    2586                            .dwattr $C$DW$168, DW_AT_decl_column(0x17)
    2587                    
    2588                    $C$DW$169       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$79)
    2590                            .dwattr $C$DW$169, DW_AT_name("intEnable")
    2591                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("intEnable")
    2592                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2593                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2595                            .dwattr $C$DW$169, DW_AT_decl_line(0x8f)
    2596                            .dwattr $C$DW$169, DW_AT_decl_column(0x17)
    2597                    
    2598                    $C$DW$170       .dwtag  DW_TAG_member
    2599                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2600                            .dwattr $C$DW$170, DW_AT_name("rxChRvdTime")
    2601                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("rxChRvdTime")
    2602                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2603                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2604                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2605                            .dwattr $C$DW$170, DW_AT_decl_line(0x90)
    2606                            .dwattr $C$DW$170, DW_AT_decl_column(0x17)
    2607                    
    2608                    $C$DW$171       .dwtag  DW_TAG_member
    2609                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$83)
    2610                            .dwattr $C$DW$171, DW_AT_name("callBackFunc")
    2611                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("callBackFunc")
    2612                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2613                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2614                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2615                            .dwattr $C$DW$171, DW_AT_decl_line(0x91)
    2616                            .dwattr $C$DW$171, DW_AT_decl_column(0x17)
    2617                    
    2618                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2619                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x87)
    2620                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    2621                            .dwendtag $C$DW$T$84
    2622                    
    2623                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    2624                            .dwattr $C$DW$T$196, DW_AT_name("halUARTCfg_t")
    2625                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$84)
    2626                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    2627                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2628                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x92)
    2629                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x02)
    2630                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   49

    2631                    
    2632                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    2633                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    2634                    $C$DW$172       .dwtag  DW_TAG_member
    2635                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$21)
    2636                            .dwattr $C$DW$172, DW_AT_name("event")
    2637                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("event")
    2638                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2640                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2641                            .dwattr $C$DW$172, DW_AT_decl_line(0x79)
    2642                            .dwattr $C$DW$172, DW_AT_decl_column(0x0a)
    2643                    
    2644                    $C$DW$173       .dwtag  DW_TAG_member
    2645                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2646                            .dwattr $C$DW$173, DW_AT_name("status")
    2647                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("status")
    2648                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2649                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2650                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2651                            .dwattr $C$DW$173, DW_AT_decl_line(0x7a)
    2652                            .dwattr $C$DW$173, DW_AT_decl_column(0x0a)
    2653                    
    2654                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2655                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x78)
    2656                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    2657                            .dwendtag $C$DW$T$85
    2658                    
    2659                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    2660                            .dwattr $C$DW$T$86, DW_AT_name("osal_event_hdr_t")
    2661                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2662                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2663                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2664                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    2665                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    2666                    
    2667                    
    2668                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
    2669                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    2670                    $C$DW$174       .dwtag  DW_TAG_member
    2671                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$86)
    2672                            .dwattr $C$DW$174, DW_AT_name("hdr")
    2673                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("hdr")
    2674                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2676                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2677                            .dwattr $C$DW$174, DW_AT_decl_line(0xbc)
    2678                            .dwattr $C$DW$174, DW_AT_decl_column(0x14)
    2679                    
    2680                    $C$DW$175       .dwtag  DW_TAG_member
    2681                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    2682                            .dwattr $C$DW$175, DW_AT_name("state")
    2683                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("state")
    2684                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2685                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   50

    2686                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2687                            .dwattr $C$DW$175, DW_AT_decl_line(0xbd)
    2688                            .dwattr $C$DW$175, DW_AT_decl_column(0x09)
    2689                    
    2690                    $C$DW$176       .dwtag  DW_TAG_member
    2691                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    2692                            .dwattr $C$DW$176, DW_AT_name("keys")
    2693                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("keys")
    2694                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2695                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2696                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    2697                            .dwattr $C$DW$176, DW_AT_decl_line(0xbe)
    2698                            .dwattr $C$DW$176, DW_AT_decl_column(0x09)
    2699                    
    2700                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    2701                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xbb)
    2702                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    2703                            .dwendtag $C$DW$T$87
    2704                    
    2705                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    2706                            .dwattr $C$DW$T$197, DW_AT_name("keyChange_t")
    2707                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$87)
    2708                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    2709                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    2710                            .dwattr $C$DW$T$197, DW_AT_decl_line(0xbf)
    2711                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x03)
    2712                    
    2713                    
    2714                    $C$DW$T$90      .dwtag  DW_TAG_union_type
    2715                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x04)
    2716                    $C$DW$177       .dwtag  DW_TAG_member
    2717                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2718                            .dwattr $C$DW$177, DW_AT_name("time32")
    2719                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("time32")
    2720                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2722                            .dwattr $C$DW$177, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2723                            .dwattr $C$DW$177, DW_AT_decl_line(0x46)
    2724                            .dwattr $C$DW$177, DW_AT_decl_column(0x0a)
    2725                    
    2726                    $C$DW$178       .dwtag  DW_TAG_member
    2727                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$88)
    2728                            .dwattr $C$DW$178, DW_AT_name("time16")
    2729                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("time16")
    2730                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2732                            .dwattr $C$DW$178, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2733                            .dwattr $C$DW$178, DW_AT_decl_line(0x47)
    2734                            .dwattr $C$DW$178, DW_AT_decl_column(0x0a)
    2735                    
    2736                    $C$DW$179       .dwtag  DW_TAG_member
    2737                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$89)
    2738                            .dwattr $C$DW$179, DW_AT_name("time8")
    2739                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("time8")
    2740                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   51

    2741                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2742                            .dwattr $C$DW$179, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2743                            .dwattr $C$DW$179, DW_AT_decl_line(0x48)
    2744                            .dwattr $C$DW$179, DW_AT_decl_column(0x09)
    2745                    
    2746                            .dwattr $C$DW$T$90, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2747                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x45)
    2748                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x0f)
    2749                            .dwendtag $C$DW$T$90
    2750                    
    2751                    $C$DW$T$19      .dwtag  DW_TAG_typedef
    2752                            .dwattr $C$DW$T$19, DW_AT_name("osalTime_t")
    2753                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$90)
    2754                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2755                            .dwattr $C$DW$T$19, DW_AT_decl_file("../Application/MAC/OSAL/osal_timers.c")
    2756                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x49)
    2757                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x03)
    2758                    
    2759                    
    2760                    $C$DW$T$95      .dwtag  DW_TAG_union_type
    2761                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x02)
    2762                    $C$DW$180       .dwtag  DW_TAG_member
    2763                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$92)
    2764                            .dwattr $C$DW$180, DW_AT_name("entityId")
    2765                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("entityId")
    2766                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2768                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2769                            .dwattr $C$DW$180, DW_AT_decl_line(0x1fe)
    2770                            .dwattr $C$DW$180, DW_AT_decl_column(0x14)
    2771                    
    2772                    $C$DW$181       .dwtag  DW_TAG_member
    2773                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$94)
    2774                            .dwattr $C$DW$181, DW_AT_name("servId")
    2775                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("servId")
    2776                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2778                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2779                            .dwattr $C$DW$181, DW_AT_decl_line(0x200)
    2780                            .dwattr $C$DW$181, DW_AT_decl_column(0x17)
    2781                    
    2782                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2783                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x1fc)
    2784                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2785                            .dwendtag $C$DW$T$95
    2786                    
    2787                    
    2788                    $C$DW$T$96      .dwtag  DW_TAG_union_type
    2789                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x02)
    2790                    $C$DW$182       .dwtag  DW_TAG_member
    2791                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$94)
    2792                            .dwattr $C$DW$182, DW_AT_name("servId")
    2793                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("servId")
    2794                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2795                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   52

    2796                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2797                            .dwattr $C$DW$182, DW_AT_decl_line(0x211)
    2798                            .dwattr $C$DW$182, DW_AT_decl_column(0x17)
    2799                    
    2800                    $C$DW$183       .dwtag  DW_TAG_member
    2801                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$92)
    2802                            .dwattr $C$DW$183, DW_AT_name("entityId")
    2803                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("entityId")
    2804                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2805                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2806                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2807                            .dwattr $C$DW$183, DW_AT_decl_line(0x213)
    2808                            .dwattr $C$DW$183, DW_AT_decl_column(0x14)
    2809                    
    2810                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2811                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x20f)
    2812                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    2813                            .dwendtag $C$DW$T$96
    2814                    
    2815                    
    2816                    $C$DW$T$97      .dwtag  DW_TAG_union_type
    2817                            .dwattr $C$DW$T$97, DW_AT_byte_size(0x02)
    2818                    $C$DW$184       .dwtag  DW_TAG_member
    2819                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$79)
    2820                            .dwattr $C$DW$184, DW_AT_name("paramCTS")
    2821                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("paramCTS")
    2822                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2823                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2824                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2825                            .dwattr $C$DW$184, DW_AT_decl_line(0x96)
    2826                            .dwattr $C$DW$184, DW_AT_decl_column(0x08)
    2827                    
    2828                    $C$DW$185       .dwtag  DW_TAG_member
    2829                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$79)
    2830                            .dwattr $C$DW$185, DW_AT_name("paramRTS")
    2831                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("paramRTS")
    2832                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2834                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2835                            .dwattr $C$DW$185, DW_AT_decl_line(0x97)
    2836                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2837                    
    2838                    $C$DW$186       .dwtag  DW_TAG_member
    2839                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$79)
    2840                            .dwattr $C$DW$186, DW_AT_name("paramDSR")
    2841                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("paramDSR")
    2842                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2843                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2844                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2845                            .dwattr $C$DW$186, DW_AT_decl_line(0x98)
    2846                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2847                    
    2848                    $C$DW$187       .dwtag  DW_TAG_member
    2849                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$79)
    2850                            .dwattr $C$DW$187, DW_AT_name("paramDTR")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   53

    2851                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("paramDTR")
    2852                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2854                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2855                            .dwattr $C$DW$187, DW_AT_decl_line(0x99)
    2856                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2857                    
    2858                    $C$DW$188       .dwtag  DW_TAG_member
    2859                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$79)
    2860                            .dwattr $C$DW$188, DW_AT_name("paramCD")
    2861                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("paramCD")
    2862                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2863                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2864                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2865                            .dwattr $C$DW$188, DW_AT_decl_line(0x9a)
    2866                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2867                    
    2868                    $C$DW$189       .dwtag  DW_TAG_member
    2869                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$79)
    2870                            .dwattr $C$DW$189, DW_AT_name("paramRI")
    2871                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("paramRI")
    2872                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2874                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2875                            .dwattr $C$DW$189, DW_AT_decl_line(0x9b)
    2876                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2877                    
    2878                    $C$DW$190       .dwtag  DW_TAG_member
    2879                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2880                            .dwattr $C$DW$190, DW_AT_name("baudRate")
    2881                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("baudRate")
    2882                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2884                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2885                            .dwattr $C$DW$190, DW_AT_decl_line(0x9c)
    2886                            .dwattr $C$DW$190, DW_AT_decl_column(0x0a)
    2887                    
    2888                    $C$DW$191       .dwtag  DW_TAG_member
    2889                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$79)
    2890                            .dwattr $C$DW$191, DW_AT_name("flowControl")
    2891                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("flowControl")
    2892                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2894                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2895                            .dwattr $C$DW$191, DW_AT_decl_line(0x9d)
    2896                            .dwattr $C$DW$191, DW_AT_decl_column(0x08)
    2897                    
    2898                    $C$DW$192       .dwtag  DW_TAG_member
    2899                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$79)
    2900                            .dwattr $C$DW$192, DW_AT_name("flushControl")
    2901                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("flushControl")
    2902                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2903                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2904                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2905                            .dwattr $C$DW$192, DW_AT_decl_line(0x9e)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   54

    2906                            .dwattr $C$DW$192, DW_AT_decl_column(0x08)
    2907                    
    2908                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2909                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x95)
    2910                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2911                            .dwendtag $C$DW$T$97
    2912                    
    2913                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    2914                            .dwattr $C$DW$T$199, DW_AT_name("halUARTIoctl_t")
    2915                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$97)
    2916                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    2917                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2918                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x9f)
    2919                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x02)
    2920                    
    2921                    
    2922                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    2923                            .dwattr $C$DW$T$99, DW_AT_name(".ggroup1")
    2924                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x08)
    2925                    $C$DW$193       .dwtag  DW_TAG_member
    2926                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$98)
    2927                            .dwattr $C$DW$193, DW_AT_name("timerHead")
    2928                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("timerHead")
    2929                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2931                    
    2932                    $C$DW$194       .dwtag  DW_TAG_member
    2933                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$11)
    2934                            .dwattr $C$DW$194, DW_AT_name("osal_systemClock")
    2935                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("osal_systemClock")
    2936                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2937                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2938                    
    2939                            .dwendtag $C$DW$T$99
    2940                    
    2941                    
    2942                    $C$DW$T$100     .dwtag  DW_TAG_structure_type
    2943                            .dwattr $C$DW$T$100, DW_AT_name("_ICall_LiteCmdStatus_")
    2944                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    2945                    $C$DW$195       .dwtag  DW_TAG_member
    2946                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$91)
    2947                            .dwattr $C$DW$195, DW_AT_name("cmdId")
    2948                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("cmdId")
    2949                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2950                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2951                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2952                            .dwattr $C$DW$195, DW_AT_decl_line(0x3f0)
    2953                            .dwattr $C$DW$195, DW_AT_decl_column(0x11)
    2954                    
    2955                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2956                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x3ee)
    2957                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x10)
    2958                            .dwendtag $C$DW$T$100
    2959                    
    2960                    $C$DW$T$201     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   55

    2961                            .dwattr $C$DW$T$201, DW_AT_name("ICall_LiteCmdStatus")
    2962                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$100)
    2963                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    2964                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2965                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x3f1)
    2966                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    2967                    
    2968                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2969                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2970                    
    2971                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2972                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2973                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2974                    
    2975                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    2976                            .dwattr $C$DW$T$202, DW_AT_name("ICall_Semaphore")
    2977                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$3)
    2978                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    2979                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2980                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1ac)
    2981                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x0f)
    2982                    
    2983                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    2984                            .dwattr $C$DW$T$114, DW_AT_name("ICall_SyncHandle")
    2985                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$3)
    2986                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2987                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2988                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1aa)
    2989                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    2990                    
    2991                    $C$DW$T$158     .dwtag  DW_TAG_typedef
    2992                            .dwattr $C$DW$T$158, DW_AT_name("ICall_TimerID")
    2993                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$3)
    2994                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    2995                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2996                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x1b7)
    2997                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x0f)
    2998                    
    2999                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    3000                            .dwattr $C$DW$T$206, DW_AT_name("osal_msg_q_t")
    3001                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$3)
    3002                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    3003                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3004                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x7d)
    3005                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x10)
    3006                    
    3007                    
    3008                    $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    3009                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3010                            .dwendtag $C$DW$T$39
    3011                    
    3012                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3013                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3014                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3015                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   56

    3016                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    3017                            .dwattr $C$DW$T$174, DW_AT_name("APPASRTINTF_callAssrtHndler")
    3018                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$40)
    3019                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    3020                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3021                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x43)
    3022                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x10)
    3023                    
    3024                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    3025                            .dwattr $C$DW$T$58, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    3026                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$40)
    3027                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3028                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3029                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x5f)
    3030                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
    3031                    
    3032                    $C$DW$T$41      .dwtag  DW_TAG_typedef
    3033                            .dwattr $C$DW$T$41, DW_AT_name("FPTR_RESETDEV_T")
    3034                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3035                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3036                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3037                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x4d)
    3038                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x19)
    3039                    
    3040                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    3041                            .dwattr $C$DW$T$207, DW_AT_name("FPTR_VOID_VOID_T")
    3042                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$40)
    3043                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    3044                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    3045                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x33)
    3046                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x11)
    3047                    
    3048                    $C$DW$T$208     .dwtag  DW_TAG_typedef
    3049                            .dwattr $C$DW$T$208, DW_AT_name("__TI_atexit_fn")
    3050                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$40)
    3051                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    3052                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    3053                            .dwattr $C$DW$T$208, DW_AT_decl_line(0xb9)
    3054                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x14)
    3055                    
    3056                    
    3057                    $C$DW$T$54      .dwtag  DW_TAG_subroutine_type
    3058                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3059                    $C$DW$196       .dwtag  DW_TAG_formal_parameter
    3060                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$24)
    3061                    
    3062                            .dwendtag $C$DW$T$54
    3063                    
    3064                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    3065                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3066                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    3067                    
    3068                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    3069                            .dwattr $C$DW$T$56, DW_AT_name("FPTR_RESERVED4_T")
    3070                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{0F401651-7FB9-4478-86EF-6FE3E227B336} PAGE   57

    3071                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3072                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3073                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x61)
    3074                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x19)
    3075                    
    3076                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    3077                            .dwattr $C$DW$T$57, DW_AT_name("FPTR_RESERVED5_T")
    3078                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$55)
    3079                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3080                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3081                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x63)
    3082                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x19)
    3083                    
    3084                    
    3085                    $C$DW$T$59      .dwtag  DW_TAG_subroutine_type
    3086                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3087                    $C$DW$197       .dwtag  DW_TAG_formal_parameter
    3088                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$25)
    3089                    
    3090                            .dwendtag $C$DW$T$59
    3091                    
    3092                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    3093                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3094                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    3095                    
    3096                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    3097                            .dwattr $C$DW$T$63, DW_AT_name("FPTR_ADCCOMPBIN_T")
    3098                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$60)
    3099                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3100                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3101                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x69)
    3102                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x19)
    3103                    
    3104                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    3105                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_COMPAIN_T")
    3106                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3107                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3108                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3109                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x65)
    3110                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    3111                    
    3112                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    3113                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_COMPAREF_T")
    3114                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$60)
    3115                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3116                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3117                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x67)
    3118                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    3119                    
