TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.9.LTS *
       3                    ;* Date/Time created: Sun Nov 25 17:19:52 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_pwrmgr.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.9.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CCSWorkspace\ECG603\sensor_cc1350lp\sensor_cc1350lp")
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("ICall_dispatcher")

     601                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   12

     602                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     603                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
     604                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
     605                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     606                    
     607                    
     608                    $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
     609                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
     610                    $C$DW$39        .dwtag  DW_TAG_enumerator
     611                            .dwattr $C$DW$39, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
     612                            .dwattr $C$DW$39, DW_AT_const_value(0xe0)
     613                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     614                            .dwattr $C$DW$39, DW_AT_decl_line(0x3de)
     615                            .dwattr $C$DW$39, DW_AT_decl_column(0x04)
     616                    
     617                    $C$DW$40        .dwtag  DW_TAG_enumerator
     618                            .dwattr $C$DW$40, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
     619                            .dwattr $C$DW$40, DW_AT_const_value(0xe1)
     620                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     621                            .dwattr $C$DW$40, DW_AT_decl_line(0x3e0)
     622                            .dwattr $C$DW$40, DW_AT_decl_column(0x04)
     623                    
     624                    $C$DW$41        .dwtag  DW_TAG_enumerator
     625                            .dwattr $C$DW$41, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
     626                            .dwattr $C$DW$41, DW_AT_const_value(0xe2)
     627                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     628                            .dwattr $C$DW$41, DW_AT_decl_line(0x3e2)
     629                            .dwattr $C$DW$41, DW_AT_decl_column(0x04)
     630                    
     631                    $C$DW$42        .dwtag  DW_TAG_enumerator
     632                            .dwattr $C$DW$42, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
     633                            .dwattr $C$DW$42, DW_AT_const_value(0xe3)
     634                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     635                            .dwattr $C$DW$42, DW_AT_decl_line(0x3e4)
     636                            .dwattr $C$DW$42, DW_AT_decl_column(0x04)
     637                    
     638                    $C$DW$43        .dwtag  DW_TAG_enumerator
     639                            .dwattr $C$DW$43, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
     640                            .dwattr $C$DW$43, DW_AT_const_value(0xe4)
     641                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     642                            .dwattr $C$DW$43, DW_AT_decl_line(0x3e6)
     643                            .dwattr $C$DW$43, DW_AT_decl_column(0x04)
     644                    
     645                    $C$DW$44        .dwtag  DW_TAG_enumerator
     646                            .dwattr $C$DW$44, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
     647                            .dwattr $C$DW$44, DW_AT_const_value(0xe5)
     648                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     649                            .dwattr $C$DW$44, DW_AT_decl_line(0x3e8)
     650                            .dwattr $C$DW$44, DW_AT_decl_column(0x04)
     651                    
     652                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
     653                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x3dc)
     654                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x01)
     655                            .dwendtag $C$DW$T$173
     656                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   13

     657                    $C$DW$T$174     .dwtag  DW_TAG_typedef
     658                            .dwattr $C$DW$T$174, DW_AT_name("ICall_RemotiCmdEvent_t")
     659                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
     660                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
     661                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
     662                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x3e9)
     663                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x02)
     664                    
     665                    
     666                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     667                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     668                    $C$DW$45        .dwtag  DW_TAG_member
     669                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     670                            .dwattr $C$DW$45, DW_AT_name("pwrmgr_task_state")
     671                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("pwrmgr_task_state")
     672                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     674                            .dwattr $C$DW$45, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     675                            .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     676                            .dwattr $C$DW$45, DW_AT_decl_column(0x0a)
     677                    
     678                            .dwattr $C$DW$T$20, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     679                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x47)
     680                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
     681                            .dwendtag $C$DW$T$20
     682                    
     683                    $C$DW$T$176     .dwtag  DW_TAG_typedef
     684                            .dwattr $C$DW$T$176, DW_AT_name("pwrmgr_attribute_t")
     685                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$20)
     686                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
     687                            .dwattr $C$DW$T$176, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     688                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x4e)
     689                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
     690                    
     691                    
     692                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
     693                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x4c)
     694                    $C$DW$46        .dwtag  DW_TAG_member
     695                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     696                            .dwattr $C$DW$46, DW_AT_name("Crc32")
     697                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("Crc32")
     698                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     700                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     701                            .dwattr $C$DW$46, DW_AT_decl_line(0x76)
     702                            .dwattr $C$DW$46, DW_AT_decl_column(0x25)
     703                    
     704                    $C$DW$47        .dwtag  DW_TAG_member
     705                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$29)
     706                            .dwattr $C$DW$47, DW_AT_name("FlashGetSize")
     707                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("FlashGetSize")
     708                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     709                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     710                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     711                            .dwattr $C$DW$47, DW_AT_decl_line(0x77)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   14

     712                            .dwattr $C$DW$47, DW_AT_decl_column(0x25)
     713                    
     714                    $C$DW$48        .dwtag  DW_TAG_member
     715                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$30)
     716                            .dwattr $C$DW$48, DW_AT_name("GetChipId")
     717                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("GetChipId")
     718                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     719                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     720                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     721                            .dwattr $C$DW$48, DW_AT_decl_line(0x78)
     722                            .dwattr $C$DW$48, DW_AT_decl_column(0x25)
     723                    
     724                    $C$DW$49        .dwtag  DW_TAG_member
     725                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$33)
     726                            .dwattr $C$DW$49, DW_AT_name("ReservedLocation1")
     727                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("ReservedLocation1")
     728                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     729                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     730                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     731                            .dwattr $C$DW$49, DW_AT_decl_line(0x79)
     732                            .dwattr $C$DW$49, DW_AT_decl_column(0x25)
     733                    
     734                    $C$DW$50        .dwtag  DW_TAG_member
     735                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$34)
     736                            .dwattr $C$DW$50, DW_AT_name("ReservedLocation2")
     737                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("ReservedLocation2")
     738                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     739                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     740                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     741                            .dwattr $C$DW$50, DW_AT_decl_line(0x7a)
     742                            .dwattr $C$DW$50, DW_AT_decl_column(0x25)
     743                    
     744                    $C$DW$51        .dwtag  DW_TAG_member
     745                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$35)
     746                            .dwattr $C$DW$51, DW_AT_name("ReservedLocation3")
     747                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ReservedLocation3")
     748                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     749                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     750                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     751                            .dwattr $C$DW$51, DW_AT_decl_line(0x7b)
     752                            .dwattr $C$DW$51, DW_AT_decl_column(0x25)
     753                    
     754                    $C$DW$52        .dwtag  DW_TAG_member
     755                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$38)
     756                            .dwattr $C$DW$52, DW_AT_name("ResetDevice")
     757                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ResetDevice")
     758                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     759                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     760                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     761                            .dwattr $C$DW$52, DW_AT_decl_line(0x7c)
     762                            .dwattr $C$DW$52, DW_AT_decl_column(0x25)
     763                    
     764                    $C$DW$53        .dwtag  DW_TAG_member
     765                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$43)
     766                            .dwattr $C$DW$53, DW_AT_name("Fletcher32")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   15

     767                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("Fletcher32")
     768                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     769                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     770                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     771                            .dwattr $C$DW$53, DW_AT_decl_line(0x7d)
     772                            .dwattr $C$DW$53, DW_AT_decl_column(0x25)
     773                    
     774                    $C$DW$54        .dwtag  DW_TAG_member
     775                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$47)
     776                            .dwattr $C$DW$54, DW_AT_name("MinValue")
     777                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("MinValue")
     778                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     779                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     780                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     781                            .dwattr $C$DW$54, DW_AT_decl_line(0x7e)
     782                            .dwattr $C$DW$54, DW_AT_decl_column(0x25)
     783                    
     784                    $C$DW$55        .dwtag  DW_TAG_member
     785                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$48)
     786                            .dwattr $C$DW$55, DW_AT_name("MaxValue")
     787                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("MaxValue")
     788                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     789                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     790                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     791                            .dwattr $C$DW$55, DW_AT_decl_line(0x7f)
     792                            .dwattr $C$DW$55, DW_AT_decl_column(0x25)
     793                    
     794                    $C$DW$56        .dwtag  DW_TAG_member
     795                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$49)
     796                            .dwattr $C$DW$56, DW_AT_name("MeanValue")
     797                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("MeanValue")
     798                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     799                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     800                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     801                            .dwattr $C$DW$56, DW_AT_decl_line(0x80)
     802                            .dwattr $C$DW$56, DW_AT_decl_column(0x25)
     803                    
     804                    $C$DW$57        .dwtag  DW_TAG_member
     805                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$50)
     806                            .dwattr $C$DW$57, DW_AT_name("StandDeviationValue")
     807                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("StandDeviationValue")
     808                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     809                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     810                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     811                            .dwattr $C$DW$57, DW_AT_decl_line(0x81)
     812                            .dwattr $C$DW$57, DW_AT_decl_column(0x25)
     813                    
     814                    $C$DW$58        .dwtag  DW_TAG_member
     815                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$53)
     816                            .dwattr $C$DW$58, DW_AT_name("ReservedLocation4")
     817                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("ReservedLocation4")
     818                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     819                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     820                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     821                            .dwattr $C$DW$58, DW_AT_decl_line(0x82)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   16

     822                            .dwattr $C$DW$58, DW_AT_decl_column(0x25)
     823                    
     824                    $C$DW$59        .dwtag  DW_TAG_member
     825                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$54)
     826                            .dwattr $C$DW$59, DW_AT_name("ReservedLocation5")
     827                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("ReservedLocation5")
     828                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     829                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     830                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     831                            .dwattr $C$DW$59, DW_AT_decl_line(0x83)
     832                            .dwattr $C$DW$59, DW_AT_decl_column(0x25)
     833                    
     834                    $C$DW$60        .dwtag  DW_TAG_member
     835                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$55)
     836                            .dwattr $C$DW$60, DW_AT_name("HFSourceSafeSwitch")
     837                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     838                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     839                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     840                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     841                            .dwattr $C$DW$60, DW_AT_decl_line(0x84)
     842                            .dwattr $C$DW$60, DW_AT_decl_column(0x25)
     843                    
     844                    $C$DW$61        .dwtag  DW_TAG_member
     845                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$58)
     846                            .dwattr $C$DW$61, DW_AT_name("SelectCompAInput")
     847                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("SelectCompAInput")
     848                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     849                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     850                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     851                            .dwattr $C$DW$61, DW_AT_decl_line(0x85)
     852                            .dwattr $C$DW$61, DW_AT_decl_column(0x25)
     853                    
     854                    $C$DW$62        .dwtag  DW_TAG_member
     855                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$59)
     856                            .dwattr $C$DW$62, DW_AT_name("SelectCompARef")
     857                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("SelectCompARef")
     858                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     859                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     860                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     861                            .dwattr $C$DW$62, DW_AT_decl_line(0x86)
     862                            .dwattr $C$DW$62, DW_AT_decl_column(0x25)
     863                    
     864                    $C$DW$63        .dwtag  DW_TAG_member
     865                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$60)
     866                            .dwattr $C$DW$63, DW_AT_name("SelectADCCompBInput")
     867                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SelectADCCompBInput")
     868                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     869                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     870                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     871                            .dwattr $C$DW$63, DW_AT_decl_line(0x87)
     872                            .dwattr $C$DW$63, DW_AT_decl_column(0x25)
     873                    
     874                    $C$DW$64        .dwtag  DW_TAG_member
     875                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$61)
     876                            .dwattr $C$DW$64, DW_AT_name("SelectCompBRef")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   17

     877                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("SelectCompBRef")
     878                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     879                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     880                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     881                            .dwattr $C$DW$64, DW_AT_decl_line(0x88)
     882                            .dwattr $C$DW$64, DW_AT_decl_column(0x25)
     883                    
     884                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     885                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x75)
     886                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
     887                            .dwendtag $C$DW$T$62
     888                    
     889                    $C$DW$T$177     .dwtag  DW_TAG_typedef
     890                            .dwattr $C$DW$T$177, DW_AT_name("HARD_API_T")
     891                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$62)
     892                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
     893                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
     894                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x89)
     895                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
     896                    
     897                    
     898                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
     899                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
     900                    $C$DW$65        .dwtag  DW_TAG_member
     901                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$10)
     902                            .dwattr $C$DW$65, DW_AT_name("quot")
     903                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("quot")
     904                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     906                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
     907                            .dwattr $C$DW$65, DW_AT_decl_line(0x5c)
     908                            .dwattr $C$DW$65, DW_AT_decl_column(0x16)
     909                    
     910                    $C$DW$66        .dwtag  DW_TAG_member
     911                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$10)
     912                            .dwattr $C$DW$66, DW_AT_name("rem")
     913                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("rem")
     914                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     915                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     916                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
     917                            .dwattr $C$DW$66, DW_AT_decl_line(0x5c)
     918                            .dwattr $C$DW$66, DW_AT_decl_column(0x1c)
     919                    
     920                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
     921                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x5c)
     922                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
     923                            .dwendtag $C$DW$T$63
     924                    
     925                    $C$DW$T$178     .dwtag  DW_TAG_typedef
     926                            .dwattr $C$DW$T$178, DW_AT_name("div_t")
     927                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$63)
     928                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
     929                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
     930                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x5c)
     931                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x23)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   18

     932                    
     933                    
     934                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
     935                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
     936                    $C$DW$67        .dwtag  DW_TAG_member
     937                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
     938                            .dwattr $C$DW$67, DW_AT_name("quot")
     939                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("quot")
     940                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     942                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
     943                            .dwattr $C$DW$67, DW_AT_decl_line(0x5e)
     944                            .dwattr $C$DW$67, DW_AT_decl_column(0x16)
     945                    
     946                    $C$DW$68        .dwtag  DW_TAG_member
     947                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
     948                            .dwattr $C$DW$68, DW_AT_name("rem")
     949                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rem")
     950                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     951                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     952                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
     953                            .dwattr $C$DW$68, DW_AT_decl_line(0x5e)
     954                            .dwattr $C$DW$68, DW_AT_decl_column(0x1c)
     955                    
     956                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
     957                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5e)
     958                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
     959                            .dwendtag $C$DW$T$64
     960                    
     961                    $C$DW$T$179     .dwtag  DW_TAG_typedef
     962                            .dwattr $C$DW$T$179, DW_AT_name("ldiv_t")
     963                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$64)
     964                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
     965                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
     966                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x5e)
     967                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x23)
     968                    
     969                    
     970                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
     971                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
     972                    $C$DW$69        .dwtag  DW_TAG_member
     973                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$14)
     974                            .dwattr $C$DW$69, DW_AT_name("quot")
     975                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("quot")
     976                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     978                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
     979                            .dwattr $C$DW$69, DW_AT_decl_line(0x61)
     980                            .dwattr $C$DW$69, DW_AT_decl_column(0x1c)
     981                    
     982                    $C$DW$70        .dwtag  DW_TAG_member
     983                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$14)
     984                            .dwattr $C$DW$70, DW_AT_name("rem")
     985                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rem")
     986                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   19

     987                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     988                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/st
     989                            .dwattr $C$DW$70, DW_AT_decl_line(0x61)
     990                            .dwattr $C$DW$70, DW_AT_decl_column(0x22)
     991                    
     992                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include/
     993                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x61)
     994                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
     995                            .dwendtag $C$DW$T$65
     996                    
     997                    $C$DW$T$180     .dwtag  DW_TAG_typedef
     998                            .dwattr $C$DW$T$180, DW_AT_name("lldiv_t")
     999                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$65)
    1000                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    1001                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1002                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x61)
    1003                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x29)
    1004                    
    1005                    
    1006                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1007                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    1008                    $C$DW$71        .dwtag  DW_TAG_member
    1009                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$67)
    1010                            .dwattr $C$DW$71, DW_AT_name("pointerStack")
    1011                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("pointerStack")
    1012                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1014                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1015                            .dwattr $C$DW$71, DW_AT_decl_line(0x3f5)
    1016                            .dwattr $C$DW$71, DW_AT_decl_column(0x16)
    1017                    
    1018                    $C$DW$72        .dwtag  DW_TAG_member
    1019                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$68)
    1020                            .dwattr $C$DW$72, DW_AT_name("directAPI")
    1021                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("directAPI")
    1022                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1023                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1024                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1025                            .dwattr $C$DW$72, DW_AT_decl_line(0x3f6)
    1026                            .dwattr $C$DW$72, DW_AT_decl_column(0x15)
    1027                    
    1028                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1029                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3f4)
    1030                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    1031                            .dwendtag $C$DW$T$69
    1032                    
    1033                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1034                            .dwattr $C$DW$T$71, DW_AT_name("icall_directAPIMsg_t")
    1035                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    1036                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1037                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1038                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x3f7)
    1039                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1040                    
    1041                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   20

    1042                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    1043                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x14)
    1044                    $C$DW$73        .dwtag  DW_TAG_member
    1045                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$70)
    1046                            .dwattr $C$DW$73, DW_AT_name("hdr")
    1047                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("hdr")
    1048                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1050                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1051                            .dwattr $C$DW$73, DW_AT_decl_line(0x3fb)
    1052                            .dwattr $C$DW$73, DW_AT_decl_column(0x10)
    1053                    
    1054                    $C$DW$74        .dwtag  DW_TAG_member
    1055                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$71)
    1056                            .dwattr $C$DW$74, DW_AT_name("msg")
    1057                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("msg")
    1058                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1059                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1060                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1061                            .dwattr $C$DW$74, DW_AT_decl_line(0x3fc)
    1062                            .dwattr $C$DW$74, DW_AT_decl_column(0x1a)
    1063                    
    1064                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1065                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3fa)
    1066                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    1067                            .dwendtag $C$DW$T$72
    1068                    
    1069                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1070                            .dwattr $C$DW$T$181, DW_AT_name("icallLiteMsg_t")
    1071                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$72)
    1072                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1073                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1074                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x3fd)
    1075                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1076                    
    1077                    
    1078                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1079                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x0c)
    1080                    $C$DW$75        .dwtag  DW_TAG_member
    1081                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$73)
    1082                            .dwattr $C$DW$75, DW_AT_name("bufferHead")
    1083                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("bufferHead")
    1084                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1086                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1087                            .dwattr $C$DW$75, DW_AT_decl_line(0x80)
    1088                            .dwattr $C$DW$75, DW_AT_decl_column(0x13)
    1089                    
    1090                    $C$DW$76        .dwtag  DW_TAG_member
    1091                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$73)
    1092                            .dwattr $C$DW$76, DW_AT_name("bufferTail")
    1093                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("bufferTail")
    1094                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1095                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1096                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   21

    1097                            .dwattr $C$DW$76, DW_AT_decl_line(0x81)
    1098                            .dwattr $C$DW$76, DW_AT_decl_column(0x13)
    1099                    
    1100                    $C$DW$77        .dwtag  DW_TAG_member
    1101                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1102                            .dwattr $C$DW$77, DW_AT_name("maxBufSize")
    1103                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("maxBufSize")
    1104                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1105                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1106                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1107                            .dwattr $C$DW$77, DW_AT_decl_line(0x82)
    1108                            .dwattr $C$DW$77, DW_AT_decl_column(0x0a)
    1109                    
    1110                    $C$DW$78        .dwtag  DW_TAG_member
    1111                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$75)
    1112                            .dwattr $C$DW$78, DW_AT_name("pBuffer")
    1113                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("pBuffer")
    1114                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1115                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1116                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1117                            .dwattr $C$DW$78, DW_AT_decl_line(0x83)
    1118                            .dwattr $C$DW$78, DW_AT_decl_column(0x0a)
    1119                    
    1120                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1121                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x7e)
    1122                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1123                            .dwendtag $C$DW$T$76
    1124                    
    1125                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1126                            .dwattr $C$DW$T$78, DW_AT_name("halUARTBufControl_t")
    1127                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1128                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1129                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1130                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x84)
    1131                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1132                    
    1133                    
    1134                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1135                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x2c)
    1136                    $C$DW$79        .dwtag  DW_TAG_member
    1137                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$77)
    1138                            .dwattr $C$DW$79, DW_AT_name("configured")
    1139                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("configured")
    1140                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1142                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1143                            .dwattr $C$DW$79, DW_AT_decl_line(0x88)
    1144                            .dwattr $C$DW$79, DW_AT_decl_column(0x17)
    1145                    
    1146                    $C$DW$80        .dwtag  DW_TAG_member
    1147                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$74)
    1148                            .dwattr $C$DW$80, DW_AT_name("baudRate")
    1149                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("baudRate")
    1150                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1151                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   22

    1152                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1153                            .dwattr $C$DW$80, DW_AT_decl_line(0x89)
    1154                            .dwattr $C$DW$80, DW_AT_decl_column(0x17)
    1155                    
    1156                    $C$DW$81        .dwtag  DW_TAG_member
    1157                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$77)
    1158                            .dwattr $C$DW$81, DW_AT_name("flowControl")
    1159                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("flowControl")
    1160                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1161                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1162                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1163                            .dwattr $C$DW$81, DW_AT_decl_line(0x8a)
    1164                            .dwattr $C$DW$81, DW_AT_decl_column(0x17)
    1165                    
    1166                    $C$DW$82        .dwtag  DW_TAG_member
    1167                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1168                            .dwattr $C$DW$82, DW_AT_name("flowControlThreshold")
    1169                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("flowControlThreshold")
    1170                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1171                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1172                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1173                            .dwattr $C$DW$82, DW_AT_decl_line(0x8b)
    1174                            .dwattr $C$DW$82, DW_AT_decl_column(0x17)
    1175                    
    1176                    $C$DW$83        .dwtag  DW_TAG_member
    1177                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$74)
    1178                            .dwattr $C$DW$83, DW_AT_name("idleTimeout")
    1179                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("idleTimeout")
    1180                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1181                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1182                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1183                            .dwattr $C$DW$83, DW_AT_decl_line(0x8c)
    1184                            .dwattr $C$DW$83, DW_AT_decl_column(0x17)
    1185                    
    1186                    $C$DW$84        .dwtag  DW_TAG_member
    1187                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$78)
    1188                            .dwattr $C$DW$84, DW_AT_name("rx")
    1189                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("rx")
    1190                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1191                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1192                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1193                            .dwattr $C$DW$84, DW_AT_decl_line(0x8d)
    1194                            .dwattr $C$DW$84, DW_AT_decl_column(0x17)
    1195                    
    1196                    $C$DW$85        .dwtag  DW_TAG_member
    1197                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$78)
    1198                            .dwattr $C$DW$85, DW_AT_name("tx")
    1199                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("tx")
    1200                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1201                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1202                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1203                            .dwattr $C$DW$85, DW_AT_decl_line(0x8e)
    1204                            .dwattr $C$DW$85, DW_AT_decl_column(0x17)
    1205                    
    1206                    $C$DW$86        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   23

    1207                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$77)
    1208                            .dwattr $C$DW$86, DW_AT_name("intEnable")
    1209                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("intEnable")
    1210                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1211                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1212                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1213                            .dwattr $C$DW$86, DW_AT_decl_line(0x8f)
    1214                            .dwattr $C$DW$86, DW_AT_decl_column(0x17)
    1215                    
    1216                    $C$DW$87        .dwtag  DW_TAG_member
    1217                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$79)
    1218                            .dwattr $C$DW$87, DW_AT_name("rxChRvdTime")
    1219                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("rxChRvdTime")
    1220                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1221                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1222                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1223                            .dwattr $C$DW$87, DW_AT_decl_line(0x90)
    1224                            .dwattr $C$DW$87, DW_AT_decl_column(0x17)
    1225                    
    1226                    $C$DW$88        .dwtag  DW_TAG_member
    1227                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$82)
    1228                            .dwattr $C$DW$88, DW_AT_name("callBackFunc")
    1229                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("callBackFunc")
    1230                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1231                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1232                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1233                            .dwattr $C$DW$88, DW_AT_decl_line(0x91)
    1234                            .dwattr $C$DW$88, DW_AT_decl_column(0x17)
    1235                    
    1236                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1237                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x87)
    1238                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1239                            .dwendtag $C$DW$T$83
    1240                    
    1241                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1242                            .dwattr $C$DW$T$182, DW_AT_name("halUARTCfg_t")
    1243                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$83)
    1244                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1245                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1246                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x92)
    1247                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x02)
    1248                    
    1249                    
    1250                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    1251                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1252                    $C$DW$89        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$74)
    1254                            .dwattr $C$DW$89, DW_AT_name("event")
    1255                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("event")
    1256                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1258                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1259                            .dwattr $C$DW$89, DW_AT_decl_line(0x79)
    1260                            .dwattr $C$DW$89, DW_AT_decl_column(0x0a)
    1261                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   24

    1262                    $C$DW$90        .dwtag  DW_TAG_member
    1263                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$74)
    1264                            .dwattr $C$DW$90, DW_AT_name("status")
    1265                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("status")
    1266                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1268                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1269                            .dwattr $C$DW$90, DW_AT_decl_line(0x7a)
    1270                            .dwattr $C$DW$90, DW_AT_decl_column(0x0a)
    1271                    
    1272                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1273                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x78)
    1274                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    1275                            .dwendtag $C$DW$T$84
    1276                    
    1277                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1278                            .dwattr $C$DW$T$85, DW_AT_name("osal_event_hdr_t")
    1279                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1280                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1281                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1282                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7b)
    1283                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1284                    
    1285                    
    1286                    $C$DW$T$86      .dwtag  DW_TAG_structure_type
    1287                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    1288                    $C$DW$91        .dwtag  DW_TAG_member
    1289                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$85)
    1290                            .dwattr $C$DW$91, DW_AT_name("hdr")
    1291                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("hdr")
    1292                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1294                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1295                            .dwattr $C$DW$91, DW_AT_decl_line(0xbc)
    1296                            .dwattr $C$DW$91, DW_AT_decl_column(0x14)
    1297                    
    1298                    $C$DW$92        .dwtag  DW_TAG_member
    1299                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$74)
    1300                            .dwattr $C$DW$92, DW_AT_name("state")
    1301                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("state")
    1302                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1303                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1304                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1305                            .dwattr $C$DW$92, DW_AT_decl_line(0xbd)
    1306                            .dwattr $C$DW$92, DW_AT_decl_column(0x09)
    1307                    
    1308                    $C$DW$93        .dwtag  DW_TAG_member
    1309                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$74)
    1310                            .dwattr $C$DW$93, DW_AT_name("keys")
    1311                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("keys")
    1312                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1313                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1314                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1315                            .dwattr $C$DW$93, DW_AT_decl_line(0xbe)
    1316                            .dwattr $C$DW$93, DW_AT_decl_column(0x09)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   25

    1317                    
    1318                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    1319                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xbb)
    1320                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1321                            .dwendtag $C$DW$T$86
    1322                    
    1323                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1324                            .dwattr $C$DW$T$183, DW_AT_name("keyChange_t")
    1325                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$86)
    1326                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1327                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    1328                            .dwattr $C$DW$T$183, DW_AT_decl_line(0xbf)
    1329                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1330                    
    1331                    
    1332                    $C$DW$T$91      .dwtag  DW_TAG_union_type
    1333                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1334                    $C$DW$94        .dwtag  DW_TAG_member
    1335                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$88)
    1336                            .dwattr $C$DW$94, DW_AT_name("entityId")
    1337                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("entityId")
    1338                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1340                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1341                            .dwattr $C$DW$94, DW_AT_decl_line(0x1fe)
    1342                            .dwattr $C$DW$94, DW_AT_decl_column(0x14)
    1343                    
    1344                    $C$DW$95        .dwtag  DW_TAG_member
    1345                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$90)
    1346                            .dwattr $C$DW$95, DW_AT_name("servId")
    1347                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("servId")
    1348                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1350                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1351                            .dwattr $C$DW$95, DW_AT_decl_line(0x200)
    1352                            .dwattr $C$DW$95, DW_AT_decl_column(0x17)
    1353                    
    1354                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1355                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x1fc)
    1356                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1357                            .dwendtag $C$DW$T$91
    1358                    
    1359                    
    1360                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    1361                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    1362                    $C$DW$96        .dwtag  DW_TAG_member
    1363                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$90)
    1364                            .dwattr $C$DW$96, DW_AT_name("servId")
    1365                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("servId")
    1366                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1368                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1369                            .dwattr $C$DW$96, DW_AT_decl_line(0x211)
    1370                            .dwattr $C$DW$96, DW_AT_decl_column(0x17)
    1371                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   26

    1372                    $C$DW$97        .dwtag  DW_TAG_member
    1373                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$88)
    1374                            .dwattr $C$DW$97, DW_AT_name("entityId")
    1375                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("entityId")
    1376                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1378                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1379                            .dwattr $C$DW$97, DW_AT_decl_line(0x213)
    1380                            .dwattr $C$DW$97, DW_AT_decl_column(0x14)
    1381                    
    1382                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1383                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x20f)
    1384                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1385                            .dwendtag $C$DW$T$92
    1386                    
    1387                    
    1388                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    1389                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    1390                    $C$DW$98        .dwtag  DW_TAG_member
    1391                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$77)
    1392                            .dwattr $C$DW$98, DW_AT_name("paramCTS")
    1393                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("paramCTS")
    1394                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1396                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1397                            .dwattr $C$DW$98, DW_AT_decl_line(0x96)
    1398                            .dwattr $C$DW$98, DW_AT_decl_column(0x08)
    1399                    
    1400                    $C$DW$99        .dwtag  DW_TAG_member
    1401                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$77)
    1402                            .dwattr $C$DW$99, DW_AT_name("paramRTS")
    1403                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("paramRTS")
    1404                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1406                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1407                            .dwattr $C$DW$99, DW_AT_decl_line(0x97)
    1408                            .dwattr $C$DW$99, DW_AT_decl_column(0x08)
    1409                    
    1410                    $C$DW$100       .dwtag  DW_TAG_member
    1411                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$77)
    1412                            .dwattr $C$DW$100, DW_AT_name("paramDSR")
    1413                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("paramDSR")
    1414                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1416                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1417                            .dwattr $C$DW$100, DW_AT_decl_line(0x98)
    1418                            .dwattr $C$DW$100, DW_AT_decl_column(0x08)
    1419                    
    1420                    $C$DW$101       .dwtag  DW_TAG_member
    1421                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$77)
    1422                            .dwattr $C$DW$101, DW_AT_name("paramDTR")
    1423                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("paramDTR")
    1424                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1426                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   27

    1427                            .dwattr $C$DW$101, DW_AT_decl_line(0x99)
    1428                            .dwattr $C$DW$101, DW_AT_decl_column(0x08)
    1429                    
    1430                    $C$DW$102       .dwtag  DW_TAG_member
    1431                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$77)
    1432                            .dwattr $C$DW$102, DW_AT_name("paramCD")
    1433                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("paramCD")
    1434                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1436                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1437                            .dwattr $C$DW$102, DW_AT_decl_line(0x9a)
    1438                            .dwattr $C$DW$102, DW_AT_decl_column(0x08)
    1439                    
    1440                    $C$DW$103       .dwtag  DW_TAG_member
    1441                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$77)
    1442                            .dwattr $C$DW$103, DW_AT_name("paramRI")
    1443                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("paramRI")
    1444                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1446                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1447                            .dwattr $C$DW$103, DW_AT_decl_line(0x9b)
    1448                            .dwattr $C$DW$103, DW_AT_decl_column(0x08)
    1449                    
    1450                    $C$DW$104       .dwtag  DW_TAG_member
    1451                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1452                            .dwattr $C$DW$104, DW_AT_name("baudRate")
    1453                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("baudRate")
    1454                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1456                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1457                            .dwattr $C$DW$104, DW_AT_decl_line(0x9c)
    1458                            .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    1459                    
    1460                    $C$DW$105       .dwtag  DW_TAG_member
    1461                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$77)
    1462                            .dwattr $C$DW$105, DW_AT_name("flowControl")
    1463                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("flowControl")
    1464                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1466                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1467                            .dwattr $C$DW$105, DW_AT_decl_line(0x9d)
    1468                            .dwattr $C$DW$105, DW_AT_decl_column(0x08)
    1469                    
    1470                    $C$DW$106       .dwtag  DW_TAG_member
    1471                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$77)
    1472                            .dwattr $C$DW$106, DW_AT_name("flushControl")
    1473                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("flushControl")
    1474                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1476                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1477                            .dwattr $C$DW$106, DW_AT_decl_line(0x9e)
    1478                            .dwattr $C$DW$106, DW_AT_decl_column(0x08)
    1479                    
    1480                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1481                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x95)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   28

    1482                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    1483                            .dwendtag $C$DW$T$93
    1484                    
    1485                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1486                            .dwattr $C$DW$T$184, DW_AT_name("halUARTIoctl_t")
    1487                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$93)
    1488                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1489                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1490                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x9f)
    1491                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x02)
    1492                    
    1493                    
    1494                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    1495                            .dwattr $C$DW$T$94, DW_AT_name(".ggroup1")
    1496                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    1497                    $C$DW$107       .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$6)
    1499                            .dwattr $C$DW$107, DW_AT_name("pwrmgr_initialized")
    1500                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("pwrmgr_initialized")
    1501                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1503                    
    1504                    $C$DW$108       .dwtag  DW_TAG_member
    1505                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1506                            .dwattr $C$DW$108, DW_AT_name("pwrmgr_attribute")
    1507                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("pwrmgr_attribute")
    1508                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1509                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1510                    
    1511                            .dwendtag $C$DW$T$94
    1512                    
    1513                    
    1514                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    1515                            .dwattr $C$DW$T$95, DW_AT_name("_ICall_LiteCmdStatus_")
    1516                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    1517                    $C$DW$109       .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$87)
    1519                            .dwattr $C$DW$109, DW_AT_name("cmdId")
    1520                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("cmdId")
    1521                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1523                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1524                            .dwattr $C$DW$109, DW_AT_decl_line(0x3f0)
    1525                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1526                    
    1527                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1528                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x3ee)
    1529                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    1530                            .dwendtag $C$DW$T$95
    1531                    
    1532                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1533                            .dwattr $C$DW$T$186, DW_AT_name("ICall_LiteCmdStatus")
    1534                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$95)
    1535                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1536                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   29

    1537                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x3f1)
    1538                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1539                    
    1540                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1541                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1542                    
    1543                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1544                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1545                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1546                    
    1547                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    1548                            .dwattr $C$DW$T$187, DW_AT_name("ICall_Semaphore")
    1549                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$3)
    1550                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    1551                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1552                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x1ac)
    1553                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x0f)
    1554                    
    1555                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    1556                            .dwattr $C$DW$T$109, DW_AT_name("ICall_SyncHandle")
    1557                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$3)
    1558                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1559                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1560                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x1aa)
    1561                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0f)
    1562                    
    1563                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1564                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerID")
    1565                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$3)
    1566                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1567                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1568                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1b7)
    1569                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x0f)
    1570                    
    1571                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1572                            .dwattr $C$DW$T$188, DW_AT_name("osal_msg_q_t")
    1573                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$3)
    1574                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1575                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1576                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x7d)
    1577                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    1578                    
    1579                    
    1580                    $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    1581                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1582                            .dwendtag $C$DW$T$36
    1583                    
    1584                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1585                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1586                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    1587                    
    1588                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    1589                            .dwattr $C$DW$T$169, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1590                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$37)
    1591                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   30

    1592                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1593                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x43)
    1594                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
    1595                    
    1596                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    1597                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1598                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$37)
    1599                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1600                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1601                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x5f)
    1602                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    1603                    
    1604                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    1605                            .dwattr $C$DW$T$38, DW_AT_name("FPTR_RESETDEV_T")
    1606                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1607                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1608                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1609                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4d)
    1610                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x19)
    1611                    
    1612                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1613                            .dwattr $C$DW$T$189, DW_AT_name("FPTR_VOID_VOID_T")
    1614                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$37)
    1615                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1616                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1617                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x33)
    1618                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x11)
    1619                    
    1620                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    1621                            .dwattr $C$DW$T$190, DW_AT_name("__TI_atexit_fn")
    1622                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$37)
    1623                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    1624                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.9.LTS/include
    1625                            .dwattr $C$DW$T$190, DW_AT_decl_line(0xb9)
    1626                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x14)
    1627                    
    1628                    
    1629                    $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    1630                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1631                    $C$DW$110       .dwtag  DW_TAG_formal_parameter
    1632                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    1633                    
    1634                            .dwendtag $C$DW$T$51
    1635                    
    1636                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1637                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1638                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    1639                    
    1640                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    1641                            .dwattr $C$DW$T$53, DW_AT_name("FPTR_RESERVED4_T")
    1642                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1643                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1644                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1645                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x61)
    1646                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   31

    1647                    
    1648                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    1649                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESERVED5_T")
    1650                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$52)
    1651                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1652                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1653                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x63)
    1654                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    1655                    
    1656                    
    1657                    $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
    1658                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1659                    $C$DW$111       .dwtag  DW_TAG_formal_parameter
    1660                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1661                    
    1662                            .dwendtag $C$DW$T$56
    1663                    
    1664                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1665                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1666                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    1667                    
    1668                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    1669                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1670                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    1671                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1672                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1673                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x69)
    1674                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    1675                    
    1676                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    1677                            .dwattr $C$DW$T$58, DW_AT_name("FPTR_COMPAIN_T")
    1678                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1679                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1680                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1681                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x65)
    1682                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
    1683                    
    1684                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    1685                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_COMPAREF_T")
    1686                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$57)
    1687                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1688                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1689                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x67)
    1690                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    1691                    
    1692                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    1693                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_COMPBREF_T")
    1694                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$57)
    1695                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1696                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1697                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x6b)
    1698                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    1699                    
    1700                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    1701                            .dwattr $C$DW$T$191, DW_AT_name("FPTR_VOID_UINT8_T")
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   32

    1702                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$57)
    1703                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    1704                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1705                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x34)
    1706                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x11)
    1707                    
    1708                    
    1709                    $C$DW$T$80      .dwtag  DW_TAG_subroutine_type
    1710                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1711                    $C$DW$112       .dwtag  DW_TAG_formal_parameter
    1712                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$74)
    1713                    
    1714                    $C$DW$113       .dwtag  DW_TAG_formal_parameter
    1715                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$74)
    1716                    
    1717                            .dwendtag $C$DW$T$80
    1718                    
    1719                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    1720                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1721                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    1722                    
    1723                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    1724                            .dwattr $C$DW$T$192, DW_AT_name("assertCback_t")
    1725                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$81)
    1726                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    1727                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1728                            .dwattr $C$DW$T$192, DW_AT_decl_line(0xd3)
    1729                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x10)
    1730                    
    1731                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    1732                            .dwattr $C$DW$T$82, DW_AT_name("halUARTCBack_t")
    1733                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1734                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1735                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1736                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x7b)
    1737                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
    1738                    
    1739                    
    1740                    $C$DW$T$99      .dwtag  DW_TAG_subroutine_type
    1741                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1742                    $C$DW$114       .dwtag  DW_TAG_formal_parameter
    1743                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$97)
    1744                    
    1745                            .dwendtag $C$DW$T$99
    1746                    
    1747                    $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    1748                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1749                            .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    1750                    
    1751                    
    1752                    $C$DW$T$131     .dwtag  DW_TAG_subroutine_type
    1753                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    1754                    $C$DW$115       .dwtag  DW_TAG_formal_parameter
    1755                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$129)
    1756                    
TI ARM Assembler PC v16.9.9 Sun Nov 25 17:19:53 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Stryd\AppData\Local\Temp\{857B65F1-7A99-4ABB-954E-3657A8773A54} PAGE   33

    1757                    $C$DW$116       .dwtag  DW_TAG_formal_parameter
    1758                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$130)
    1759                    
    1760                            .dwendtag $C$DW$T$131
    1761                    
    1762                    $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    1763                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    1764                            .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    1765                    
    1766                    $C$DW$T$133     .dwtag  DW_TAG_typedef
    1767                            .dwattr $C$DW$T$133, DW_AT_name("ICall_PwrNotifyFn")
    1768                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    1769                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    1770                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1771                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x333)
    1772                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x10)
    1773                    
    1774                    
    1775                    $C$DW$T$147     .dwtag  DW_TAG_subroutine_type
    1776                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    1777                    $C$DW$117       .dwtag  DW_TAG_formal_parameter
    1778                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$143)
    1779                    
    1780                            .dwendtag $C$DW$T$147
    1781                    
    1782                    $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    1783                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    1784                            .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    1785                    
    1786                    $C$DW$T$149     .dwtag  DW_TAG_typedef
    1787                            .dwattr $C$DW$T$149, DW_AT_name("ICall_LeaveCS")
    1788                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    1789                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    1790                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1791                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x37e)
    1792                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x10)
    1793                    
    1794                    
    1795                    $C$DW$T$154     .dwtag  DW_TAG_subroutine_type
    1796                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    1797                    $C$DW$118       .dwtag  DW_TAG_formal_parameter
    1798                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$3)
    1799                    
    1800                            .dwendtag $C$DW$T$154
    1801                    
    1802                    $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    1803                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    1804                            .dwattr $C$DW$T$155, DW_AT_address_class(0x20)
    1805                    
